{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Main steps:\n",
    "1. testare connessione grafo \n",
    "2. creazione nodi Ristorante - Piatti - Ingredienti"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "OPENAI_API_KEY = \"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\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "from dotenv import load_dotenv\n",
    "import json"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "load_dotenv()\n",
    "\n",
    "os.environ[\"NEO4J_URI\"] = os.getenv(\"NEO4J_URI\")\n",
    "os.environ[\"NEO4J_USERNAME\"] = os.getenv(\"NEO4J_USERNAME\")\n",
    "os.environ[\"NEO4J_PASSWORD\"] = os.getenv(\"NEO4J_PASSWORD\")\n",
    "uri = os.environ[\"NEO4J_URI\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(uri, auth=(os.environ[\"NEO4J_USERNAME\"], os.environ[\"NEO4J_PASSWORD\"]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record nodes=[<Node element_id='-5' labels=frozenset({'Tecnica'}) properties={'name': 'Tecnica', 'indexes': [], 'constraints': [\"Constraint( id=12, name='constraint_7b990bc7', type='UNIQUENESS', schema=(:Tecnica {id}), ownedIndex=11 )\"]}>, <Node element_id='-4' labels=frozenset({'Ingrediente'}) properties={'name': 'Ingrediente', 'indexes': [], 'constraints': [\"Constraint( id=10, name='constraint_5c7a41c', type='UNIQUENESS', schema=(:Ingrediente {id}), ownedIndex=9 )\"]}>, <Node element_id='-6' labels=frozenset({'Pianeta'}) properties={'name': 'Pianeta', 'indexes': [], 'constraints': [\"Constraint( id=14, name='constraint_de0a272c', type='UNIQUENESS', schema=(:Pianeta {id}), ownedIndex=13 )\"]}>, <Node element_id='-1' labels=frozenset({'Ristorante'}) properties={'name': 'Ristorante', 'indexes': [], 'constraints': [\"Constraint( id=4, name='constraint_727b183b', type='UNIQUENESS', schema=(:Ristorante {id}), ownedIndex=3 )\"]}>, <Node element_id='-2' labels=frozenset({'Chef'}) properties={'name': 'Chef', 'indexes': [], 'constraints': [\"Constraint( id=6, name='constraint_204acb3d', type='UNIQUENESS', schema=(:Chef {id}), ownedIndex=5 )\"]}>, <Node element_id='-3' labels=frozenset({'Piatto'}) properties={'name': 'Piatto', 'indexes': [], 'constraints': [\"Constraint( id=8, name='constraint_471e6641', type='UNIQUENESS', schema=(:Piatto {id}), ownedIndex=7 )\"]}>] relationships=[<Relationship element_id='-1' nodes=(<Node element_id='-1' labels=frozenset({'Ristorante'}) properties={'name': 'Ristorante', 'indexes': [], 'constraints': [\"Constraint( id=4, name='constraint_727b183b', type='UNIQUENESS', schema=(:Ristorante {id}), ownedIndex=3 )\"]}>, <Node element_id='-2' labels=frozenset({'Chef'}) properties={'name': 'Chef', 'indexes': [], 'constraints': [\"Constraint( id=6, name='constraint_204acb3d', type='UNIQUENESS', schema=(:Chef {id}), ownedIndex=5 )\"]}>) type='GESTITO_DA' properties={'name': 'GESTITO_DA'}>, <Relationship element_id='-3' nodes=(<Node element_id='-3' labels=frozenset({'Piatto'}) properties={'name': 'Piatto', 'indexes': [], 'constraints': [\"Constraint( id=8, name='constraint_471e6641', type='UNIQUENESS', schema=(:Piatto {id}), ownedIndex=7 )\"]}>, <Node element_id='-4' labels=frozenset({'Ingrediente'}) properties={'name': 'Ingrediente', 'indexes': [], 'constraints': [\"Constraint( id=10, name='constraint_5c7a41c', type='UNIQUENESS', schema=(:Ingrediente {id}), ownedIndex=9 )\"]}>) type='CONTIENE' properties={'name': 'CONTIENE'}>, <Relationship element_id='-6' nodes=(<Node element_id='-6' labels=frozenset({'Pianeta'}) properties={'name': 'Pianeta', 'indexes': [], 'constraints': [\"Constraint( id=14, name='constraint_de0a272c', type='UNIQUENESS', schema=(:Pianeta {id}), ownedIndex=13 )\"]}>, <Node element_id='-6' labels=frozenset({'Pianeta'}) properties={'name': 'Pianeta', 'indexes': [], 'constraints': [\"Constraint( id=14, name='constraint_de0a272c', type='UNIQUENESS', schema=(:Pianeta {id}), ownedIndex=13 )\"]}>) type='HA_DISTANZA_ANNI_LUCE' properties={'name': 'HA_DISTANZA_ANNI_LUCE'}>, <Relationship element_id='-2' nodes=(<Node element_id='-1' labels=frozenset({'Ristorante'}) properties={'name': 'Ristorante', 'indexes': [], 'constraints': [\"Constraint( id=4, name='constraint_727b183b', type='UNIQUENESS', schema=(:Ristorante {id}), ownedIndex=3 )\"]}>, <Node element_id='-3' labels=frozenset({'Piatto'}) properties={'name': 'Piatto', 'indexes': [], 'constraints': [\"Constraint( id=8, name='constraint_471e6641', type='UNIQUENESS', schema=(:Piatto {id}), ownedIndex=7 )\"]}>) type='OFFRE_IL_PIATTO' properties={'name': 'OFFRE_IL_PIATTO'}>, <Relationship element_id='-4' nodes=(<Node element_id='-3' labels=frozenset({'Piatto'}) properties={'name': 'Piatto', 'indexes': [], 'constraints': [\"Constraint( id=8, name='constraint_471e6641', type='UNIQUENESS', schema=(:Piatto {id}), ownedIndex=7 )\"]}>, <Node element_id='-5' labels=frozenset({'Tecnica'}) properties={'name': 'Tecnica', 'indexes': [], 'constraints': [\"Constraint( id=12, name='constraint_7b990bc7', type='UNIQUENESS', schema=(:Tecnica {id}), ownedIndex=11 )\"]}>) type='REALIZZATO_CON_LA_TECNICA' properties={'name': 'REALIZZATO_CON_LA_TECNICA'}>, <Relationship element_id='-5' nodes=(<Node element_id='-1' labels=frozenset({'Ristorante'}) properties={'name': 'Ristorante', 'indexes': [], 'constraints': [\"Constraint( id=4, name='constraint_727b183b', type='UNIQUENESS', schema=(:Ristorante {id}), ownedIndex=3 )\"]}>, <Node element_id='-6' labels=frozenset({'Pianeta'}) properties={'name': 'Pianeta', 'indexes': [], 'constraints': [\"Constraint( id=14, name='constraint_de0a272c', type='UNIQUENESS', schema=(:Pianeta {id}), ownedIndex=13 )\"]}>) type='SI_TROVA_SU' properties={'name': 'SI_TROVA_SU'}>]>\n"
     ]
    }
   ],
   "source": [
    "def get_graph_schema(driver):\n",
    "    with driver.session() as session:\n",
    "        result = session.run(\"\"\"CALL db.schema.visualization()\n",
    "               \"\"\")\n",
    "        return result.single()\n",
    "    \n",
    "schema = get_graph_schema(driver)\n",
    "print(schema)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Aggiunta menu-ristoranti-piatti al grafo"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {},
   "outputs": [],
   "source": [
    "directory = 'menu_json'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_restaurant(restaurant_name):\n",
    "    query = \"\"\"\n",
    "    CREATE (r:Ristorante {nome: $nome})\n",
    "    RETURN r\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query, nome=restaurant_name)\n",
    "        return result.single()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 71,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_chef(chef, nome_ristorante):\n",
    "    query = \"\"\"\n",
    "    MERGE (c:Chef {nome: $chef})\n",
    "    WITH c\n",
    "    MATCH (r:Ristorante {nome: $nome_ristorante})\n",
    "    MERGE (r)-[:GESTITO_DA]->(c)\n",
    "    RETURN c\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query, chef=chef, nome_ristorante=nome_ristorante)\n",
    "        return result.single()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 70,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_piatto(piatto, nome_ristorante):\n",
    "    query = \"\"\"\n",
    "    MERGE (p:Piatto {nome: $piatto})\n",
    "    WITH p\n",
    "    MATCH (r:Ristorante {nome: $nome_ristorante})\n",
    "    MERGE (r)-[:OFFRE_IL_PIATTO]->(p)\n",
    "    RETURN p\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query, piatto=piatto, nome_ristorante=nome_ristorante)\n",
    "        return result.single()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 69,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_ingrediente(ingrediente, nome_piatto):\n",
    "    query = \"\"\"\n",
    "    MERGE (i:Ingrediente {nome: $ingrediente})\n",
    "    WITH i\n",
    "    MATCH (p:Piatto {nome: $nome_piatto})\n",
    "    MERGE (p)-[:CONTIENE]->(i)\n",
    "    RETURN i\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query, ingrediente=ingrediente, nome_piatto=nome_piatto)\n",
    "        return result.single()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_tecnica(tecnica, nome_piatto):\n",
    "    query = \"\"\"\n",
    "    MERGE (t:Tecnica {nome: $tecnica})\n",
    "    WITH t\n",
    "    MATCH (p:Piatto {nome: $nome_piatto})\n",
    "    MERGE (p)-[:REALIZZATO_CON_LA_TECNICA]->(t)\n",
    "    RETURN t\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query, tecnica=tecnica, nome_piatto=nome_piatto)\n",
    "        return result.single()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_menu(menu, nome_ristorante):\n",
    "    \"\"\"Riceva una lista di piatti, ogni piatto è un dizionario con chiavi:\n",
    "    nome_piatto: str,\n",
    "    ingredienti: list[str],\n",
    "    tecniche: list [str]\n",
    "    \"\"\"\n",
    "    \n",
    "    for piatto in menu:\n",
    "        nome_piatto = piatto['nome_piatto'] if 'nome_piatto' in piatto else ''\n",
    "        add_piatto(nome_piatto, nome_ristorante)\n",
    "                        \n",
    "        if 'ingredienti' in piatto:\n",
    "            ingredienti = piatto['ingredienti']\n",
    "            for ingrediente in ingredienti:\n",
    "                add_ingrediente(ingrediente, nome_piatto)\n",
    "\n",
    "        if 'tecniche' in piatto:\n",
    "            tecniche = piatto['tecniche']\n",
    "            for tecnica in tecniche:\n",
    "                add_tecnica(tecnica, nome_piatto)\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "metadata": {},
   "outputs": [],
   "source": [
    "for filename in os.listdir(directory):\n",
    "    if filename.endswith('.json'):\n",
    "        filepath = os.path.join(directory, filename)\n",
    "        with open(filepath, 'r', encoding='utf-8') as file:\n",
    "            data = json.load(file)\n",
    "            if 'nome_ristorante' in data:\n",
    "                add_restaurant(data['nome_ristorante'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "metadata": {},
   "outputs": [],
   "source": [
    "for filename in os.listdir(directory):\n",
    "    if filename.endswith('.json'):\n",
    "        filepath = os.path.join(directory, filename)\n",
    "        with open(filepath, 'r', encoding='utf-8') as file:\n",
    "            data = json.load(file)\n",
    "            if 'nome_ristorante' in data:\n",
    "                nome_ristorante = data['nome_ristorante']\n",
    "                \n",
    "                if 'nome_chef' in data:\n",
    "                    add_chef(data['nome_chef'], nome_ristorante)\n",
    "                if 'menu' in data:\n",
    "                    add_menu(data['menu'], nome_ristorante)\n",
    "                \n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Creazione indici (per migliori performance)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 308,
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_indexes(driver):\n",
    "    with driver.session() as session:\n",
    "        for label in [\"Ristorante\", \"Chef\", \"Piatto\", \"Ingrediente\", \"Tecnica\", \"Pianeta\"]:\n",
    "            session.run(f\"CREATE CONSTRAINT IF NOT EXISTS FOR (n:{label}) REQUIRE n.id IS UNIQUE\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 309,
   "metadata": {},
   "outputs": [],
   "source": [
    "create_indexes(driver)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Querying the Graph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Vanilla\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_neo4j import GraphCypherQAChain\n",
    "from langchain_openai import ChatOpenAI\n",
    "from langchain_neo4j import Neo4jGraph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "llm = ChatOpenAI(\n",
    "    model=\"gpt-4o\",\n",
    "    temperature=0,\n",
    "    max_tokens=None,\n",
    "    api_key=OPENAI_API_KEY\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties:\n",
      "- **Ristorante**\n",
      "  - `nome`: STRING Example: \"Anima Cosmica\"\n",
      "- **Chef**\n",
      "  - `nome`: STRING Example: \"Aurora Stellaris\"\n",
      "- **Piatto**\n",
      "  - `nome`: STRING Example: \"Nebulosa Celestiale alla Stellaris\"\n",
      "- **Ingrediente**\n",
      "  - `nome`: STRING Example: \"Shard di Materia Oscura\"\n",
      "- **Tecnica**\n",
      "  - `nome`: STRING Example: \"Cottura a Vapore con Flusso di Particelle Isoarmon\"\n",
      "- **Pianeta**\n",
      "  - `nome`: STRING Available options: ['Pandora', 'Tatooine', 'Ego', 'Klyntar', 'Cybertron', 'Arrakis', 'Asgard', 'Krypton', 'Namecc']\n",
      "Relationship properties:\n",
      "- **HA_DISTANZA_ANNI_LUCE**\n",
      "  - `distanza`: INTEGER Min: 0, Max: 1227\n",
      "The relationships:\n",
      "(:Ristorante)-[:SI_TROVA_SU]->(:Pianeta)\n",
      "(:Ristorante)-[:GESTITO_DA]->(:Chef)\n",
      "(:Ristorante)-[:OFFRE_IL_PIATTO]->(:Piatto)\n",
      "(:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica)\n",
      "(:Piatto)-[:CONTIENE]->(:Ingrediente)\n",
      "(:Pianeta)-[:HA_DISTANZA_ANNI_LUCE]->(:Pianeta)\n"
     ]
    }
   ],
   "source": [
    "graph = Neo4jGraph(\n",
    "    url=uri, \n",
    "    username=os.environ[\"NEO4J_USERNAME\"], \n",
    "    password=os.environ[\"NEO4J_PASSWORD\"],\n",
    "    enhanced_schema=True\n",
    ")\n",
    "\n",
    "print(graph.schema)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_core.prompts.prompt import PromptTemplate"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "CYPHER_GENERATION_TEMPLATE = \"\"\"Task:Generate Cypher statement to query a graph database.\n",
    "The graph database contains restaurants and dishes from an alien galaxy.\n",
    "Each restaurant is located in a planet.\n",
    "Each planet has a given distance from the other ones expressed in light years. \n",
    "The distance between planets is specified as a property of the 'HA_DISTANZA_ANNI_LUCE' relationship. This property is named 'distanza'.\n",
    "\n",
    "\n",
    "Instructions:\n",
    "Use only the provided relationship types and properties in the schema.\n",
    "Do not use any other relationship types or properties that are not provided.\n",
    "Your goal is always to find a dish (Piatto) or a list of dishes starting from some filters.\n",
    "You will never be provided with a name of a dish in the initial question. \n",
    " \n",
    "Schema:\n",
    "{schema}\n",
    "Note: Do not include any explanations or apologies in your responses.\n",
    "Do not respond to any questions that might ask anything else than for you to construct a Cypher statement.\n",
    "Do not include any text except the generated Cypher statement.\n",
    "\n",
    "Examples: Here are a few examples of generated Cypher statements for particular questions:\n",
    "# Quali sono i piatti disponibili nei ristoranti entro 200 anni luce da Pandora?\n",
    "\n",
    "MATCH (p1:Pianeta {{nome: \"Pandora\"}})-[rel:HA_DISTANZA_ANNI_LUCE]->(p2:Pianeta),\n",
    "      (r:Ristorante)-[:SI_TROVA_SU]->(p2),\n",
    "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)\n",
    "WHERE rel.distanza <= 200\n",
    "RETURN DISTINCT piatto.nome\n",
    "\n",
    "\n",
    "The question is:\n",
    "{question}\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "CYPHER_GENERATION_PROMPT = PromptTemplate(\n",
    "    input_variables=[\"schema\", \"question\"], template=CYPHER_GENERATION_TEMPLATE\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "chain = GraphCypherQAChain.from_llm(\n",
    "    llm, \n",
    "    graph=graph, \n",
    "    verbose=True, \n",
    "    allow_dangerous_requests=True, \n",
    "    cypher_prompt=CYPHER_GENERATION_PROMPT,\n",
    "    return_direct=True,\n",
    "    top_k=50,\n",
    "    validate_cypher=True\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Cioccorane\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    }
   ],
   "source": [
    "answer = chain.invoke(\"Quali piatti dovrei scegliere per un banchetto a tema magico che includa le celebri Cioccorane?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 227,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "dict"
      ]
     },
     "execution_count": 227,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "type(answer)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 322,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'piatto.nome': 'Sinfonia Cosmica: Versione Pizza'}]"
      ]
     },
     "execution_count": 322,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "answer[\"result\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 298,
   "metadata": {},
   "outputs": [],
   "source": [
    "tmp=[]\n",
    "for piatto in answer[\"result\"]:\n",
    "    tmp.append(list(piatto.values())[0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 299,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Sinfonia Temporale al Tocco di Crono',\n",
       " 'Nebulosa di Fenice con Sinfonia Eterea',\n",
       " 'Sfogliare Galattico di Sogni Temporali',\n",
       " 'Viaggio dei Sensi: Bolla Temporale di Aromi Ancestrali',\n",
       " 'Sinfonia di Stagioni Stellari',\n",
       " 'Sinfonia di Crepuscolo Celestiale',\n",
       " 'Sinfonia Temporale nello Spaghi del Sole',\n",
       " 'Galassia Risvegliata',\n",
       " 'Cosmopolis delle Galassie Perdute',\n",
       " 'Sinfonia Tempolare Galattica']"
      ]
     },
     "execution_count": 299,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "tmp"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "import csv\n",
    "\n",
    "def read_csv(file_path):\n",
    "    with open(file_path, mode='r', encoding='utf-8') as file:\n",
    "        lista_domande = []\n",
    "        csv_reader = csv.DictReader(file)\n",
    "        for row in csv_reader:\n",
    "            lista_domande.append(row['domanda'])\n",
    "        return lista_domande\n",
    "            \n",
    "\n",
    "# Example usage\n",
    "file_path = 'domande.csv'\n",
    "lista_domande = read_csv(file_path)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Chocobo Wings\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 1 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Cioccorane\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 2 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Latte+\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 3 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Ravioli al Vaporeon\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 4 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Sashimi di Magikarp\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 5 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Frutti del Diavolo\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 6 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Grigliatura a Energia Stellare DiV\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 7 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Sferificazione a Gravità Psionica Variabile\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 8 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica1:Tecnica {nome: \"Marinatura Temporale Sincronizzata\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica2:Tecnica {nome: \"Congelamento Bio-Luminiscente Sincronico\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 9 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica1:Tecnica {nome: \"Cottura Olografica Quantum Fluttuante\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica2:Tecnica {nome: \"Decostruzione Interdimensionale Lovecraftiana\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 10 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (ingrediente1:Ingrediente {nome: \"Riso di Cassandra\"}),\n",
      "      (ingrediente2:Ingrediente {nome: \"Polvere di Crononite\"}),\n",
      "      (piatto:Piatto)-[:CONTIENE]->(ingrediente1),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente2)\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 11 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente {nome: \"Shard di Prisma Stellare\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente {nome: \"Sale Temporale\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 12 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Teste di Idra\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Cottura Sottovuoto Multirealità Collassante\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 13 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Fermentazione Quantico Biometrica\"}),\n",
      "      (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Erba Pipa\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 14 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE tecnica.nome = \"Sferificazione Filamentare a Molecole Vibrazionali\"\n",
      "AND NOT EXISTS {\n",
      "  MATCH (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: \"Amalgamazione Sintetica Molecolare\"})\n",
      "}\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 15 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Sferificazione Filamentare a Molecole Vibrazionali\"})\n",
      "WHERE NOT EXISTS {\n",
      "  MATCH (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Decostruzione Magnetica Risonante\"})\n",
      "}\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 16 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Sferificazione con Campi Magnetici Entropici\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE NOT ingrediente.nome = \"Spezie Melange\"\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 17 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Surgelamento Antimaterico a Risonanza Inversa\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE NOT ingrediente.nome = \"Foglie di Mandragora\"\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 18 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente {nome: \"Foglie di Nebulosa\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente {nome: \"Amido di Stellarion\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente3:Ingrediente {nome: \"Uova di Fenice\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 19 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente {nome: \"Carne di Balena spaziale\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente {nome: \"Essenza di Tachioni\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente3:Ingrediente {nome: \"Alghe Bioluminescenti\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 20 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente {nome: \"Erba Pipa\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente {nome: \"Funghi Orbitali\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Bollitura Infrasonica Armonizzata\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 21 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Pianeta)<-[:SI_TROVA_SU]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: \"Cottura a Vapore con Flusso di Particelle Isoarmoniche\"}),\n",
      "      (piatto)-[:CONTIENE]->(i1:Ingrediente {nome: \"Riso di Cassandra\"}),\n",
      "      (piatto)-[:CONTIENE]->(i2:Ingrediente {nome: \"Foglie di Nebulosa\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 22 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Carne di Balena spaziale\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Bollitura Entropica Sincronizzata\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Affettamento a Pulsazioni Quantistiche\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 23 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Lacrime di Unicorno\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Taglio Sinaptico Biomimetico\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Idro-Cristallizzazione Sonora Quantistica\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 24 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica1:Tecnica {nome: \"Cottura a Vapore Risonante Simbiotico\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica2:Tecnica {nome: \"doppia Fermentazione Quantico Biometrica\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 25 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica1:Tecnica {nome: \"Taglio a Risonanza Sonica Rigenerativa\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica2:Tecnica {nome: \"Cottura a Vapore Ecodinamico Bilanciato\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 26 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente {nome: \"Lattuga Namecciana\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente {nome: \"Carne di Mucca\"})\n",
      "WHERE NOT (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Teste di Idra\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 27 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente {nome: \"Essenza di Tachioni\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente {nome: \"Carne di Mucca\"})\n",
      "WHERE NOT EXISTS {\n",
      "  MATCH (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Muffa Lunare\"})\n",
      "}\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 28 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Funghi Orbitali\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Marinatura Psionica\"})\n",
      "WHERE NOT (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Shard di Materia Oscura\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 29 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Funghi dell’Etere\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Impasto Gravitazionale Vorticoso\"})\n",
      "WHERE NOT (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Plasma Vitale\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 30 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente {nome: \"Funghi dell’Etere\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente {nome: \"Erba Pipa\"})\n",
      "WHERE NOT (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Decostruzione Magnetica Risonante\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 31 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Salsa Szechuan\"}),\n",
      "      (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Granuli di Nebbia Arcobaleno\"})\n",
      "WHERE NOT EXISTS {\n",
      "  MATCH (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Affumicatura a Stratificazione Quantica\"})\n",
      "}\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 32 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica1:Tecnica {nome: \"Affumicatura tramite Big Bang Microcosmico\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica2:Tecnica {nome: \"Affettamento a Pulsazioni Quantistiche\"})\n",
      "WHERE NOT (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Funghi Orbitali\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 33 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica1:Tecnica {nome: \"Incisione Elettromagnetica Plasmica\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica2:Tecnica {nome: \"Bollitura Entropica Sincronizzata\"})\n",
      "WHERE NOT (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Cristalli di Memoria\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 34 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Polvere di Crononite\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Incisione Elettromagnetica Plasmica\"})\n",
      "WHERE NOT (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Decostruzione Atomica a Strati Energetici\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 35 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Alghe Bioluminescenti\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Idro-Cristallizzazione Sonora Quantistica\"})\n",
      "WHERE NOT (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Marinatura Temporale Sincronizzata\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 36 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE NOT (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Cottura a Vapore Termocinetica Multipla\"})\n",
      "AND (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Congelazione Iperdimensionalmente Stratificata\"})\n",
      "AND (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Fermentazione Quantico Biometrica\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 37 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE NOT (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Fermentazione Quantico Biometrica\"})\n",
      "WITH piatto, COLLECT(tecnica.nome) AS tecniche\n",
      "WHERE \"Affumicatura tramite Big Bang Microcosmico\" IN tecniche AND \"Cottura Sottovuoto Frugale Energeticamente Negativa\" IN tecniche\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 38 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Marinatura tramite Reazioni d'Antimateria Diluite\"})\n",
      "WHERE NOT (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Cristalli di Nebulite\"})\n",
      "  AND NOT (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Funghi dell’Etere\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 39 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Congelazione Iperdimensionalmente Stratificata\"})\n",
      "WHERE NOT (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Fibra di Sintetex\"})\n",
      "  AND NOT (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Funghi Orbitali\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 40 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Grigliatura Psionica Dinamica Ritmica\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE NOT ingrediente.nome IN [\"Pane degli Abissi\", \"Cottura Olografica Quantum Fluttuante\"]\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 41 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Taglio Sinaptico Biomimetico\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE NOT ingrediente.nome = \"Lattuga Namecciana\"\n",
      "AND NOT EXISTS {\n",
      "  MATCH (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Cottura Sottovuoto Bioma Sintetico\"})\n",
      "}\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 42 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE tecnica.nome = \"Decostruzione Ancestrale\"\n",
      "AND NOT (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Cottura a Vapore Termocinetica Multipla\"})\n",
      "AND NOT (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Marinatura a Infusione Gravitazionale\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 43 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE tecnica.nome = \"Affumicatura Polarizzata a Freddo Iperbarico\"\n",
      "AND NOT (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Fermentazione Psionica Energetica\"})\n",
      "AND NOT (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Congelamento Bio-Luminiscente Sincronico\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 44 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente {nome: \"Carne di Balena spaziale\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente {nome: \"Teste di Idra\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente3:Ingrediente {nome: \"Spaghi del Sole\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente4:Ingrediente {nome: \"Carne di Xenodonte\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 45 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente {nome: \"Cristalli di Memoria\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente {nome: \"Essenza di Tachioni\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente3:Ingrediente {nome: \"Carne di Kraken\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 46 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Vero Ghiaccio\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica1:Tecnica {nome: \"Cottura Sottovuoto Frugale Energeticamente Negativa\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica2:Tecnica {nome: \"Cottura Sottovuoto Bioma Sintetico\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 47 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente {nome: \"Shard di Materia Oscura\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente {nome: \"Uova di Fenice\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica1:Tecnica {nome: \"Affumicatura Polarizzata a Freddo Iperbarico\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica2:Tecnica {nome: \"Cottura a Vapore Ecodinamico Bilanciato\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 48 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (r:Ristorante)-[:SI_TROVA_SU]->(:Pianeta {nome: \"Asgard\"}),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Essenza di Speziaria\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 49 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (r:Ristorante)-[:SI_TROVA_SU]->(:Pianeta {nome: \"Asgard\"}),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Pane di Luce\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 50 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Pianeta {nome: \"Krypton\"}),\n",
      "      (r:Ristorante)-[:SI_TROVA_SU]->(p),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: \"Cryo-Tessitura Energetica Polarizzata\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 51 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante)-[:SI_TROVA_SU]->(:Pianeta {nome: \"Krypton\"}),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Cottura Sottovuoto Bioma Sintetico\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 52 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante {nome: \"L'Etere del Gusto\"})-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: \"Decostruzione Atomica a Strati Energetici\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 53 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante {nome: \"Stelle dell'Infinito Celestiale\"})-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: \"Congelamento Bio-Luminiscente Sincronico\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 54 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (r:Ristorante {nome: \"L'Universo in Cucina\"})-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Funghi Orbitali\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 55 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante {nome: \"L'Oasi delle Dune Stellari\"})-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Lattuga Namecciana\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 56 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: licenza)} {position: line: 3, column: 12, offset: 165} for query: 'cypher\\nMATCH (chef:Chef)-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Spezie Melange\"})\\nWHERE chef.licenza = \"LTK\" AND chef.grado >= 7\\nRETURN DISTINCT piatto.nome\\n'\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: grado)} {position: line: 3, column: 37, offset: 190} for query: 'cypher\\nMATCH (chef:Chef)-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Spezie Melange\"})\\nWHERE chef.licenza = \"LTK\" AND chef.grado >= 7\\nRETURN DISTINCT piatto.nome\\n'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (chef:Chef)-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Spezie Melange\"})\n",
      "WHERE chef.licenza = \"LTK\" AND chef.grado >= 7\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 57 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: grado)} {position: line: 1, column: 33, offset: 32} for query: 'MATCH (chef:Chef {licenza: \"Q\", grado: 15})<-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Nduja Fritta Tanto\"})\\nRETURN DISTINCT piatto.nome'\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: licenza)} {position: line: 1, column: 19, offset: 18} for query: 'MATCH (chef:Chef {licenza: \"Q\", grado: 15})<-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Nduja Fritta Tanto\"})\\nRETURN DISTINCT piatto.nome'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (chef:Chef {licenza: \"Q\", grado: 15})<-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Nduja Fritta Tanto\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 58 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: licenza)} {position: line: 1, column: 16, offset: 15} for query: 'MATCH (c:Chef {licenza: \"t\", grado: 2})<-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: \"Cottura Idrodinamica Autoregolante\"})\\nRETURN DISTINCT piatto.nome'\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: grado)} {position: line: 1, column: 30, offset: 29} for query: 'MATCH (c:Chef {licenza: \"t\", grado: 2})<-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: \"Cottura Idrodinamica Autoregolante\"})\\nRETURN DISTINCT piatto.nome'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (c:Chef {licenza: \"t\", grado: 2})<-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: \"Cottura Idrodinamica Autoregolante\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 59 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: licenza_grado)} {position: line: 2, column: 12, offset: 196} for query: 'MATCH (chef:Chef)-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Cottura Sottovuoto Multirealità Collassante\"})\\nWHERE chef.licenza_grado >= 3\\nRETURN DISTINCT piatto.nome'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (chef:Chef)-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Cottura Sottovuoto Multirealità Collassante\"})\n",
      "WHERE chef.licenza_grado >= 3\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 60 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (r:Ristorante {nome: \"L'Essenza dell'Infinito\"})-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE ingrediente.nome IN [\"Fibra di Sintetex\", \"Essenza di Vuoto\"]\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 61 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (r:Ristorante {nome: \"Le Dimensioni del Gusto\"})-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE ingrediente.nome IN [\"Petali di Eco\", \"Uova di Fenice\"]\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 62 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (r:Ristorante {nome: \"L'Universo in Cucina\"})-[:OFFRE_IL_PIATTO]->(piatto:Piatto)\n",
      "WHERE (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Frammenti di Supernova\"})\n",
      "   OR (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Fermentazione Psionica Energetica\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 63 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (r:Ristorante {nome: \"Cosmica Essenza\"})-[:OFFRE_IL_PIATTO]->(piatto:Piatto)\n",
      "WHERE (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Funghi dell’Etere\"})\n",
      "   OR (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Marinatura Temporale Sincronizzata\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 64 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante)-[:SI_TROVA_SU]->(:Pianeta {nome: \"Klyntar\"}),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE ingrediente.nome IN [\"Alghe Bioluminescenti\", \"Amido di Stellarion\"]\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 65 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Pianeta {nome: \"Asgard\"})<-[:SI_TROVA_SU]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE ingrediente.nome IN [\"Essenza di Vuoto\", \"Carne di Xenodonte\"]\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 66 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Pianeta {nome: \"Pandora\"})<-[:SI_TROVA_SU]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica)\n",
      "WHERE t.nome IN [\"Surgelamento Antimaterico a Risonanza Inversa\", \"Cottura a Vapore con Flusso di Particelle Isoarmoniche\"]\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 67 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Pianeta {nome: \"Namecc\"})<-[:SI_TROVA_SU]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica)\n",
      "WHERE t.nome IN [\"Grigliatura Plasma Sintetico Risonante\", \"Affumicatura Polarizzata a Freddo Iperbarico\"]\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 68 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: licenza_grado)} {position: line: 3, column: 9, offset: 100} for query: 'MATCH (r:Ristorante)-[:GESTITO_DA]->(c:Chef),\\n      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)\\nWHERE c.licenza_grado >= 5\\nAND ((piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Teste di Idra\"})\\n     OR (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Bollitura Entropica Sincronizzata\"}))\\nRETURN DISTINCT piatto.nome'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (r:Ristorante)-[:GESTITO_DA]->(c:Chef),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)\n",
      "WHERE c.licenza_grado >= 5\n",
      "AND ((piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Teste di Idra\"})\n",
      "     OR (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Bollitura Entropica Sincronizzata\"}))\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 69 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: licenza_grado)} {position: line: 3, column: 9, offset: 100} for query: 'MATCH (r:Ristorante)-[:GESTITO_DA]->(c:Chef),\\n      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)\\nWHERE c.licenza_grado >= 6\\nMATCH (piatto)-[:CONTIENE]->(i:Ingrediente {nome: \"Polvere di Pulsar\"})\\nRETURN DISTINCT piatto.nome\\nUNION\\nMATCH (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: \"Cottura al Forno con Paradosso Temporale Cronospeculare\"})\\nRETURN DISTINCT piatto.nome'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (r:Ristorante)-[:GESTITO_DA]->(c:Chef),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)\n",
      "WHERE c.licenza_grado >= 6\n",
      "MATCH (piatto)-[:CONTIENE]->(i:Ingrediente {nome: \"Polvere di Pulsar\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "UNION\n",
      "MATCH (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: \"Cottura al Forno con Paradosso Temporale Cronospeculare\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 70 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: licenzaQGrado)} {position: line: 2, column: 132, offset: 262} for query: 'MATCH (chef:Chef)-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\\nWHERE (tecnica.nome = \"Affumicatura Psionica Sensoriale\" OR tecnica.nome = \"Cottura Sottovuoto Multirealità Collassante\") AND chef.licenzaQGrado >= 9\\nRETURN DISTINCT piatto.nome'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (chef:Chef)-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE (tecnica.nome = \"Affumicatura Psionica Sensoriale\" OR tecnica.nome = \"Cottura Sottovuoto Multirealità Collassante\") AND chef.licenzaQGrado >= 9\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 71 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: licenzaMxGrado)} {position: line: 4, column: 13, offset: 264} for query: 'MATCH (r:Ristorante)-[:GESTITO_DA]->(c:Chef),\\n      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica)\\nWHERE (t.nome = \"Congelazione Iperdimensionalmente Stratificata\" OR t.nome = \"Cristallizzazione Temporale Reversiva\")\\n      AND c.licenzaMxGrado >= 1\\nRETURN DISTINCT piatto.nome'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (r:Ristorante)-[:GESTITO_DA]->(c:Chef),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica)\n",
      "WHERE (t.nome = \"Congelazione Iperdimensionalmente Stratificata\" OR t.nome = \"Cristallizzazione Temporale Reversiva\")\n",
      "      AND c.licenzaMxGrado >= 1\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 72 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE ingrediente.nome IN [\"Spore Quantiche\", \"Latte+\", \"Radici di Singolarità\"]\n",
      "WITH piatto, COUNT(DISTINCT ingrediente) AS ingredientCount\n",
      "WHERE ingredientCount >= 2\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 73 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE ingrediente.nome IN [\"Ravioli al Vaporeon\", \"Spaghi del Sole\", \"Nettare di Sirena\"]\n",
      "WITH piatto, COUNT(DISTINCT ingrediente) AS ingredientCount\n",
      "WHERE ingredientCount >= 2\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 74 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE ingrediente.nome IN [\"Polvere di Crononite\", \"Nduja Fritta Tanto\", \"Spezie di Melange\", \"Polvere di Stelle\"]\n",
      "WITH piatto, COUNT(DISTINCT ingrediente) AS ingredientCount\n",
      "WHERE ingredientCount >= 2\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 75 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE ingrediente.nome IN [\"Carne di Drago\", \"Chocobo Wings\", \"Foglie di Mandragora\", \"Burrobirra\"]\n",
      "WITH piatto, COUNT(DISTINCT ingrediente) AS ingredientCount\n",
      "WHERE ingredientCount >= 2\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 76 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Spaghi del Sole\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Surgelamento del di Sirius Cosmo\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 77 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica),\n",
      "      (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Fusilli del Vento\"}),\n",
      "      (tecnica {nome: \"taglio di Sirius Cosmo\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 78 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: licenza_temporale)} {position: line: 4, column: 15, offset: 246} for query: 'MATCH (r:Ristorante)-[:SI_TROVA_SU]->(:Pianeta {nome: \"Asgard\"}),\\n      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Farina di Nettuno\"}),\\n      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\\nWHERE tecnica.licenza_temporale > 0\\nRETURN DISTINCT piatto.nome'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (r:Ristorante)-[:SI_TROVA_SU]->(:Pianeta {nome: \"Asgard\"}),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Farina di Nettuno\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE tecnica.licenza_temporale > 0\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 79 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Pianeta {nome: \"Asgard\"})<-[:SI_TROVA_SU]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Carne di Xenodonte\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Licenza LTK non base\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 80 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Pianeta {nome: \"Pandora\"})<-[:SI_TROVA_SU]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Spore Quantiche\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Licenza P di grado 2\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 81 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Pianeta {nome: \"Arrakis\"})<-[:SI_TROVA_SU]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Riso di Cassandra\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 82 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica1:Tecnica {nome: \"taglio\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica2:Tecnica {nome: \"surgelamento\"}),\n",
      "      (r)-[:GESTITO_DA]->(chef:Chef {nome: \"Sirius Cosmo\"})\n",
      "WHERE NOT (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Polvere di Crononite\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 83 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica1:Tecnica {nome: \"impasto\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica2:Tecnica {nome: \"taglio\"})\n",
      "WHERE NOT (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Shard di Prisma Stellare\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 84 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE tecnica.nome CONTAINS \"taglio\" AND NOT (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Fusilli del Vento\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 85 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"surgelamento\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE NOT ingrediente.nome = \"Melange\"\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 86 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"taglio del di Sirius Cosmo\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE NOT ingrediente.nome = \"Gnocchi del Crepuscolo\" AND tecnica.nome CONTAINS \"licenza G di grado 2\"\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 87 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE tecnica.nome CONTAINS \"taglio\" \n",
      "  AND NOT ingrediente.nome = \"Farina di Nettuno\"\n",
      "  AND (r)-[:SI_TROVA_SU]->(:Pianeta {nome: \"Sirius Cosmo\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 88 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: licenza_grado)} {position: line: 4, column: 39, offset: 254} for query: 'MATCH (p1:Pianeta {nome: \"Namecc\"})-[rel:HA_DISTANZA_ANNI_LUCE]->(p2:Pianeta),\\n      (r:Ristorante)-[:SI_TROVA_SU]->(p2),\\n      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\\nWHERE rel.distanza <= 659 AND tecnica.licenza_grado >= 3\\nRETURN DISTINCT piatto.nome'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p1:Pianeta {nome: \"Namecc\"})-[rel:HA_DISTANZA_ANNI_LUCE]->(p2:Pianeta),\n",
      "      (r:Ristorante)-[:SI_TROVA_SU]->(p2),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE rel.distanza <= 659 AND tecnica.licenza_grado >= 3\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 89 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p1:Pianeta {nome: \"Arrakis\"})-[rel:HA_DISTANZA_ANNI_LUCE]->(p2:Pianeta),\n",
      "      (r:Ristorante)-[:SI_TROVA_SU]->(p2),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)\n",
      "WHERE rel.distanza <= 176 OR p2.nome = \"Arrakis\"\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 90 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p1:Pianeta {nome: \"Krypton\"})-[rel:HA_DISTANZA_ANNI_LUCE]->(p2:Pianeta),\n",
      "      (r:Ristorante)-[:SI_TROVA_SU]->(p2),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"surgelamento\"}),\n",
      "      (r)-[:GESTITO_DA]->(chef:Chef {nome: \"Sirius Cosmo\"})\n",
      "WHERE rel.distanza <= 317 OR p2.nome = \"Krypton\"\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 91 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p1:Pianeta {nome: \"Krypton\"})-[rel:HA_DISTANZA_ANNI_LUCE]->(p2:Pianeta),\n",
      "      (r:Ristorante)-[:SI_TROVA_SU]->(p2),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"impasto del di Sirius Cosmo\"})\n",
      "WHERE rel.distanza <= 21\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 92 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p1:Pianeta {nome: \"Cybertron\"})-[rel:HA_DISTANZA_ANNI_LUCE]->(p2:Pianeta),\n",
      "      (r:Ristorante)-[:SI_TROVA_SU]->(p2),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)\n",
      "WHERE rel.distanza <= 126\n",
      "AND NOT (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Funghi dell'Etere\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 93 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p1:Pianeta {nome: \"Cybertron\"})-[rel:HA_DISTANZA_ANNI_LUCE]->(p2:Pianeta),\n",
      "      (r:Ristorante)-[:SI_TROVA_SU]->(p2),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)\n",
      "WHERE rel.distanza <= 83\n",
      "AND NOT EXISTS {\n",
      "  MATCH (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Farina di Nettuno\"})\n",
      "}\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 94 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 95 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Pianeta {nome: \"Andromeda\"})<-[:SI_TROVA_SU]-(r:Ristorante),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 96 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Essenza di Tachioni\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Cottura a Vapore Ecodinamico Bilanciato\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 97 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente {nome: \"Petali di Eco\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente {nome: \"Foglie di Mandragora\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 98 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Fusilli del Vento\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Marinatura a Infusione Gravitazionale\"}),\n",
      "      (r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto),\n",
      "      (r)-[:GESTITO_DA]->(:Chef)\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 99 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Teste di Idra\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Marinatura a Infusione Gravitazionale\"}),\n",
      "      (r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto),\n",
      "      (r)-[:GESTITO_DA]->(chef:Chef)\n",
      "WHERE chef.nome CONTAINS \"Codice di Galattico\"\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 100 ok!\n"
     ]
    }
   ],
   "source": [
    "lista_risposte = {}\n",
    "\n",
    "for indice, domanda in enumerate(lista_domande):\n",
    "    try:\n",
    "        answer = chain.invoke(domanda)\n",
    "        lista_piatti = []\n",
    "        for piatto in answer[\"result\"]:\n",
    "            lista_piatti.append(list(piatto.values())[0])\n",
    "        lista_risposte[indice+1] = lista_piatti\n",
    "        print(f\"domanda {indice+1} ok!\")\n",
    "    except:\n",
    "        lista_risposte[indice+1] = []\n",
    "        print(f\"domanda {indice+1} in errore\")\n",
    "        pass\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{1: ['Galassia di Sapori: Il Viaggio Senza Tempo'],\n",
       " 2: ['Sinfonia Cosmica: Versione Pizza'],\n",
       " 3: [\"Pizza Cosmica all'Essenza di Drago con Nebbia Arcobaleno e Funghi Orbitali\"],\n",
       " 4: ['Sinfonia Cosmica di Sapore'],\n",
       " 5: [],\n",
       " 6: ['Rinascita Cosmica'],\n",
       " 7: ['Portale del Cosmo: Sinfonia di Sapori Multidimensionali',\n",
       "  'Stella Nova',\n",
       "  'Rivisitazione del Kraken sotto Molecole'],\n",
       " 8: ['Cosmic Synchrony: Il Destino di Pulsar',\n",
       "  'Nebulosa Galattica',\n",
       "  'Cosmic Serenade',\n",
       "  'Aurora del Cosmo',\n",
       "  'Sinfonia Cosmica di Andromeda',\n",
       "  'Fusione Celeste'],\n",
       " 9: ['Galassia di Sapori Sublimi', 'Sinfonia Cosmica del Multiverso'],\n",
       " 10: [\"La Mucca Che Stordisce l'Universo\", 'Sogni di Abisso Cosmico'],\n",
       " 11: ['Il Viaggio delle Dimensioni Confluenti'],\n",
       " 12: ['Sinfonia Quantistica delle Stelle', 'Risveglio Cosmico'],\n",
       " 13: ['Nebulare Asteroideo con Crepuscolo di Mucca'],\n",
       " 14: ['Galassia di Sogni Cosmogastronomici', 'Il Viaggio Celeste'],\n",
       " 15: ['Tris di Carne con Pane',\n",
       "  'Panetto di Carne',\n",
       "  'Pizza Gio',\n",
       "  'Eclissi Quantica: Viaggio nei Reami del Gusto',\n",
       "  'Cosmic Harmony Infusion',\n",
       "  'Nebulare Asteroideo con Crepuscolo di Mucca',\n",
       "  'Viaggio Cosmico nel Multiverso',\n",
       "  'Serenata del Multiverso'],\n",
       " 16: ['Panetto di Carne',\n",
       "  'Pizza Gio',\n",
       "  'Eclissi Quantica: Viaggio nei Reami del Gusto',\n",
       "  'Cosmic Harmony Infusion',\n",
       "  'Nebulare Asteroideo con Crepuscolo di Mucca',\n",
       "  'Viaggio Cosmico nel Multiverso',\n",
       "  'Sinfonia Cosmica di Terracotta',\n",
       "  'Serenata del Multiverso'],\n",
       " 17: ['Sassi e Sassolini',\n",
       "  'La Balena Sputafuoco',\n",
       "  'Sinfonia di Gusti del Multiverso',\n",
       "  'Universo in Un Boccone',\n",
       "  'Pizza Cri',\n",
       "  'Portale Interdimensionale di Sapori',\n",
       "  'Cosmo Sferico di Sogni Rigenerativi',\n",
       "  'Sinfonia Cosmica in Otto Movimenti',\n",
       "  'Sinfonia Cosmica di Sapore'],\n",
       " 18: ['Nebulosa di Confini Sfondati',\n",
       "  'Nebulosa Celestiale di Sogni Quantici',\n",
       "  'Ecosistema Celeste',\n",
       "  'Portale Interdimensionale di Sapori',\n",
       "  'Euforia Cosmica',\n",
       "  'Galaxia Rinasciata'],\n",
       " 19: [],\n",
       " 20: [\"Il Viaggio dell'Etereo Risveglio\", 'Galassia Commovente di Stellari'],\n",
       " 21: ['Portale Cosmico del Kraken', 'Sinfonia Tempolare Galattica'],\n",
       " 22: ['Galassia di Sapori Eterei'],\n",
       " 23: ['Piccola Odissea Cosmica'],\n",
       " 24: ['Luce e Ombra di Nomea Spaziale'],\n",
       " 25: [],\n",
       " 26: [\"Sinfonia Cosmica all'Alba di Fenice\"],\n",
       " 27: ['Il Banchetto delle Galassie',\n",
       "  'Cosmofantasia di Terra e Mare nel Vortice delle Stelle',\n",
       "  \"La Mucca Che Stordisce l'Universo\",\n",
       "  'Cosmos Culinary Symphony',\n",
       "  'Sinfonia Temporale al Tocco di Crono',\n",
       "  'Risveglio Cosmico: Una Sinfonia di Sapori Universali'],\n",
       " 28: ['Cosmofantasia di Terra e Mare nel Vortice delle Stelle',\n",
       "  \"Sinfonia Cosmica all'Alba di Fenice\",\n",
       "  'Odissea Temporale',\n",
       "  'Il Risveglio del Drago Celeste',\n",
       "  'Sinfonia Temporale al Tocco di Crono',\n",
       "  'Galassia Suprema'],\n",
       " 29: ['Sinfonia Galattica di Sapori con Sorpresa di Drago Fiammante'],\n",
       " 30: [\"Sinfonia Cosmica all'Alba di Fenice\",\n",
       "  'Sassi e Sassolini',\n",
       "  'La Balena Sputafuoco',\n",
       "  \"L'Eternità al Crepuscolo\",\n",
       "  'Rintocchi del Cosmo',\n",
       "  'Galassia di Sapori di Aurora'],\n",
       " 31: ['Porta Celestiale alle Stelle', 'Sinfonia Cosmica ma Fatta Male'],\n",
       " 32: ['Sinfonia Cosmica alla Szechuan',\n",
       "  'Nebulosa Celestiale di Sogni Quantici',\n",
       "  'Nebulae Di-Cedri Risvegliati'],\n",
       " 33: [],\n",
       " 34: ['Universo Cosmico nel Piatto'],\n",
       " 35: ['Melodia del Multiverso Parallelo', 'Sinfonia Cosmica di Terracotta'],\n",
       " 36: ['Galassia di Sapore Quantum',\n",
       "  'Universo in Un Boccone',\n",
       "  'Sinfonia Temporale nello Spaghi del Sole'],\n",
       " 37: ['Nebulose della Fenice su Vento Lunare'],\n",
       " 38: ['Rivelazione del Multiverso'],\n",
       " 39: ['Sinfonia Temporale nello Spaghi del Sole',\n",
       "  'Etereo Crepuscolare',\n",
       "  'Il Risveglio delle Stelle',\n",
       "  'Galassie Infiammate: Sinfonia Cosmica in Sei Dimensioni',\n",
       "  'Astro-Risotto alle Onde Temporali'],\n",
       " 40: ['Fenice Galattica',\n",
       "  'Eterea Sinfonia di Gravità',\n",
       "  'Pizza Baby Daniele',\n",
       "  'Pizza Cri',\n",
       "  'Pizza Emma',\n",
       "  'Sinfonia Astrale - Risotto Multiversale con Risacca Celeste',\n",
       "  \"Fenice sull'Orizzonte degli Eventi\",\n",
       "  'Sinfonia Interstellare di Fusilli del Vento con Nettare di Sirena',\n",
       "  'Nebulose della Fenice su Vento Lunare'],\n",
       " 41: ['Sinfonia Celestiale',\n",
       "  'Serenata del Multiverso',\n",
       "  \"Galassia Incantata: Un Viaggio Attraverso l'Infinito\",\n",
       "  'Risveglio Cosmico: Una Sinfonia di Sapori Universali'],\n",
       " 42: ['Luce e Ombra di Nomea Spaziale',\n",
       "  \"Falso Risotto dell'Infinito Multiverso\",\n",
       "  'Rinascita Cosmica'],\n",
       " 43: ['Sinfonia Cosmica del Multiverso',\n",
       "  'Ecosistema Celeste',\n",
       "  'Universo in Fusilli - Variazione Celestiale',\n",
       "  'Mycoflora con Polvere di Stelle Sbagliato',\n",
       "  'Sinfonia di Stagioni Stellari',\n",
       "  'Galassia Risvegliata'],\n",
       " 44: ['Panetto di Carne',\n",
       "  'Galassia Speculare',\n",
       "  'Ode al Crepuscolo del Multiverso',\n",
       "  'Viaggio Cosmico nel Multiverso',\n",
       "  'Portale Cosmico: Sinfonia di Gnocchi del Crepuscolo con Essenza di Tachioni e Sfumature di Fenice'],\n",
       " 45: [\"Galassie in Epifania: Risotto Celestiale con Preziosi dell'Universo\"],\n",
       " 46: ['Viaggio dei Sensi: Bolla Temporale di Aromi Ancestrali'],\n",
       " 47: [],\n",
       " 48: ['Portale Cosmico: Sinfonia di Gnocchi del Crepuscolo con Essenza di Tachioni e Sfumature di Fenice'],\n",
       " 49: ['Una Mucca e una Balena nella Singolarità', \"L'Ascensione Siderale\"],\n",
       " 50: ['Risotto Interdimensionale alla Carne di Drago e Balena Spaziale con Biscotti della Galassia Croccanti',\n",
       "  'Pane e Carne Rivisitato',\n",
       "  \"Fenice sull'Orizzonte degli Eventi\",\n",
       "  'Sinfonia Cosmica di Terre e Stelle',\n",
       "  'Quadrifonia Cosmica: Sinfonia di Sapori e Dimensioni'],\n",
       " 51: ['Sinfonia Galattica Agentica', 'Il Viaggio Cosmico di Marinetti'],\n",
       " 52: [],\n",
       " 53: [\"Sinfonia dell'Universo Morente\"],\n",
       " 54: ['Nebulosa di Confini Sfondati', 'Galassia Ardente'],\n",
       " 55: ['Stellar Fusion'],\n",
       " 56: ['Universo Cosmico nel Piatto', 'La Creazione di Nova'],\n",
       " 57: [],\n",
       " 58: [],\n",
       " 59: [],\n",
       " 60: [],\n",
       " 61: ['Tris di Verdure con Xenodonte',\n",
       "  'Galassia di Sapori: Il Viaggio Senza Tempo',\n",
       "  'Il Rapsodo Celestiale'],\n",
       " 62: ['Galassia di Sapori di Aurora', 'Evanescenza Cosmica'],\n",
       " 63: ['Portale delle Stelle'],\n",
       " 64: [\"Sinfonia Celeste dell'Equilibrio Temporale\",\n",
       "  'Porta Celestiale alle Stelle'],\n",
       " 65: ['Galassia Aurorale',\n",
       "  'Galassia di Sapori Interstellari',\n",
       "  'Cosmic Rhapsody'],\n",
       " 66: [\"Plasma Celestiale al Risotto di Kraken nell'Aura del Sole\",\n",
       "  'Più-dimensionale Sinfonia di Sapori: La Carne del Cosmo',\n",
       "  'Sinfonia del Cosmo e della Leggenda',\n",
       "  'Risotto Cosmico Multiversale',\n",
       "  \"Fenice sull'Orizzonte degli Eventi\",\n",
       "  'Sinfonia Cosmica di Terre e Stelle'],\n",
       " 67: ['Abbraccio del Cosmo',\n",
       "  'Galassia di Sapori Eterei',\n",
       "  'Euforia Cosmica',\n",
       "  'Portale Cosmico: Sinfonia di Gnocchi del Crepuscolo con Essenza di Tachioni e Sfumature di Fenice',\n",
       "  'Sinfonia Cosmica: Versione Pizza',\n",
       "  'Nebulosa Celestiale alla Stellaris'],\n",
       " 68: ['Panetto di Carne', 'Galassia Ardente', 'Sassi e Sassolini'],\n",
       " 69: [],\n",
       " 70: ['Eterea Sinfonia di Gravità',\n",
       "  'Sfogliare Galattico di Sogni Temporali',\n",
       "  'Galassia a Tavola: Sinfonia di Tempeste Cosmiche'],\n",
       " 71: [],\n",
       " 72: [],\n",
       " 73: ['Galassia di Sapori Interstellari',\n",
       "  'Il Risveglio del Drago Celeste',\n",
       "  'Una Mucca e una Balena nella Singolarità',\n",
       "  'Crescendo Cosmico',\n",
       "  'Fusione Celeste'],\n",
       " 74: ['Galassia Sensoriale',\n",
       "  'Ode Cosmica di Terra e Stelle',\n",
       "  'Galassia di Sogni Cosmogastronomici',\n",
       "  \"La Sinfonia dell'Universo\",\n",
       "  'Universo Incantato: Sinfonia dei Gusti Cosmogonici',\n",
       "  \"Nebulosa dell'Infinito: Un Viaggio attraverso il Cosmo del Gusto\",\n",
       "  'Sinfonia Cosmica'],\n",
       " 75: ['Galassia di Sapore Quantico',\n",
       "  'Ethereal Temporal Elixir',\n",
       "  'Pizza Baby Simone e Alessandro',\n",
       "  'Melodia del Multiverso Parallelo',\n",
       "  'Mandragora e Radici'],\n",
       " 76: ['Odissea Temporale', 'Galassia di Sapori: Il Viaggio Senza Tempo'],\n",
       " 77: [],\n",
       " 78: [],\n",
       " 79: [],\n",
       " 80: [],\n",
       " 81: [],\n",
       " 82: ['Sinfonia di Cristalli e Rigenerazione'],\n",
       " 83: [],\n",
       " 84: [],\n",
       " 85: [],\n",
       " 86: [],\n",
       " 87: [],\n",
       " 88: [],\n",
       " 89: [],\n",
       " 90: ['Cosmologia Terrestre: Viaggio in Otto Dimensioni',\n",
       "  'Il Banchetto delle Galassie',\n",
       "  'Odissea Celestiale',\n",
       "  'Cosmic Symphony di Ghiaccio e Fuoco',\n",
       "  'Cosmofantasia di Terra e Mare nel Vortice delle Stelle',\n",
       "  'Sinfonia Cosmica: Il Crescendo delle Stelle',\n",
       "  'Sinfonia Cosmica alla Szechuan',\n",
       "  \"Sinfonia Cosmica all'Alba di Fenice\",\n",
       "  'Cosmopastico di Meraviglie Celesti',\n",
       "  'Galassia Sensoriale',\n",
       "  'Sinfonia Galattica',\n",
       "  'Ode Cosmica di Terra e Stelle',\n",
       "  'Pioggia di Dimensioni Galattiche',\n",
       "  'Sinfonia Temporale delle Profondità Infrasoniche',\n",
       "  'Interstellare Risveglio di Kraken',\n",
       "  'Galassia di Sapore Quantico',\n",
       "  'Galassia di Sapori Sublimi',\n",
       "  'Evanescenza Quantica',\n",
       "  \"Sinfonia Quantistica dell'Universo\",\n",
       "  'Sinfonia Quantistica delle Stelle',\n",
       "  'Galassia Speculare',\n",
       "  'Universo Cosmico nel Piatto',\n",
       "  'Nebulosa Celestiale di Sogni Quantici',\n",
       "  'Universo in Un Boccone',\n",
       "  'Ecosistema Celeste',\n",
       "  'Cosmic Serenade',\n",
       "  'Universo in Fusilli - Variazione Celestiale',\n",
       "  'Eterea Sinfonia di Gravità',\n",
       "  'La Creazione di Nova',\n",
       "  'Il Viaggio delle Dimensioni Confluenti',\n",
       "  'Sinfonia Temporale del Drago',\n",
       "  'Nebulare Asteroideo con Crepuscolo di Mucca',\n",
       "  'Sinfonia Temporale di Fenice e Xenodonte su Pane degli Abissi con Colata di Plasma Vitale e Polvere di Crononite',\n",
       "  'Sinfonia Quantica dell’Oceano Interstellare',\n",
       "  'Sinfonia del Multiverso Calante',\n",
       "  'Etereo Crepuscolare',\n",
       "  \"Essenze dell'Infinito\",\n",
       "  \"Antipasto Stellare dell'Eterna Armonia\",\n",
       "  'Sinfonia del Multiverso Nascente',\n",
       "  'Il Risveglio delle Stelle',\n",
       "  \"Sinfonia Celeste dell'Equilibrio Temporale\",\n",
       "  'Porta Celestiale alle Stelle',\n",
       "  'Sinfonia Celestiale di Echi Galattici',\n",
       "  \"Galassia Incantata: Un Viaggio Attraverso l'Infinito\",\n",
       "  'Risveglio Cosmico: Una Sinfonia di Sapori Universali',\n",
       "  'Sinfonia Cosmica di Andromeda',\n",
       "  'Fusione Celeste',\n",
       "  'Galassia Suprema',\n",
       "  \"Galassie in Epifania: Risotto Celestiale con Preziosi dell'Universo\",\n",
       "  'Sinfonia Galattica ai Cristalli di Nebulite'],\n",
       " 91: [],\n",
       " 92: [],\n",
       " 93: ['Sinfonia Temporale al Tocco di Crono',\n",
       "  'Nebulosa di Fenice con Sinfonia Eterea',\n",
       "  'Sfogliare Galattico di Sogni Temporali',\n",
       "  'Viaggio dei Sensi: Bolla Temporale di Aromi Ancestrali',\n",
       "  'Sinfonia di Stagioni Stellari',\n",
       "  'Sinfonia di Crepuscolo Celestiale',\n",
       "  'Sinfonia Temporale nello Spaghi del Sole',\n",
       "  'Galassia Risvegliata',\n",
       "  'Cosmopolis delle Galassie Perdute',\n",
       "  'Sinfonia Tempolare Galattica'],\n",
       " 94: ['Sinfonia Temporale al Tocco di Crono',\n",
       "  'Nebulosa di Fenice con Sinfonia Eterea',\n",
       "  'Sfogliare Galattico di Sogni Temporali',\n",
       "  'Viaggio dei Sensi: Bolla Temporale di Aromi Ancestrali',\n",
       "  'Sinfonia di Stagioni Stellari',\n",
       "  'Sinfonia Temporale nello Spaghi del Sole',\n",
       "  'Galassia Risvegliata',\n",
       "  'Sinfonia Tempolare Galattica'],\n",
       " 95: ['Galassia Commovente di Stellari',\n",
       "  'Odissea Cosmica di Nettuno',\n",
       "  'Sinfonia Cosmica ma Fatta Bene',\n",
       "  'Pioggia di Andromeda',\n",
       "  'Galassie Sospese: Un Viaggio di Sapori Cosmogalattici',\n",
       "  'Galassie Infiammate: Sinfonia Cosmica in Sei Dimensioni',\n",
       "  'Sinfonia Galattica alla Griglia Cangiante',\n",
       "  'Astro-Risotto alle Onde Temporali',\n",
       "  'Sinfonia Cosmica ma Fatta Male',\n",
       "  'Nebulosa Celestiale alla Stellaris',\n",
       "  'Cosmo Sferico di Sogni Rigenerativi',\n",
       "  'Sinfonia Cosmica di Armonie Terrestri e Celesti',\n",
       "  'Sinfonia Cosmologica',\n",
       "  'Sinfonia Cosmica: Versione Data',\n",
       "  'Portale Cosmico: Sinfonia di Gnocchi del Crepuscolo con Essenza di Tachioni e Sfumature di Fenice',\n",
       "  'Sinfonia Cosmica in Otto Movimenti',\n",
       "  'Sinfonia Cosmica di Luminiscenze e Contrasti',\n",
       "  'Sinfonia Cosmica di Sapore',\n",
       "  'Sinfonia Cosmica',\n",
       "  'Sinfonia Cosmica: Versione Pizza',\n",
       "  'Il Risveglio delle Stelle',\n",
       "  \"Sinfonia Celeste dell'Equilibrio Temporale\",\n",
       "  'Porta Celestiale alle Stelle',\n",
       "  'Sinfonia Celestiale di Echi Galattici',\n",
       "  \"Galassia Incantata: Un Viaggio Attraverso l'Infinito\",\n",
       "  'Risveglio Cosmico: Una Sinfonia di Sapori Universali',\n",
       "  'Sinfonia Cosmica di Andromeda',\n",
       "  'Fusione Celeste',\n",
       "  'Galassia Suprema',\n",
       "  \"Galassie in Epifania: Risotto Celestiale con Preziosi dell'Universo\",\n",
       "  'Galassie alla Spirale di Vento con Sfera di Ghiaccio Eterno',\n",
       "  'Galassia in Tavola: Sinfonia dei Sensi',\n",
       "  'Nebulosa di Sapori Quantici',\n",
       "  'Cosmic Harmony',\n",
       "  'Galaxia Rinasciata',\n",
       "  'Mandragora e Radici',\n",
       "  'Galassia Rinascente',\n",
       "  'Galassia di Fusilli Sferici alla Risonanza Crononica',\n",
       "  'Cosmic Rhapsody',\n",
       "  \"Creazione Celestiale: L'Alba del Cosmo\",\n",
       "  \"Pioggia Calante dell'Universo\",\n",
       "  'Galassia di Celestial Delight',\n",
       "  'Cosmic Harmony Risotto',\n",
       "  'Portale Astrale di Sapori',\n",
       "  'Galassia a Tavola: Sinfonia di Tempeste Cosmiche',\n",
       "  \"Galassia d'Aromi Perduti\",\n",
       "  'Enigma Celeste',\n",
       "  'Galassia Riflessa',\n",
       "  'Sinfonia degli Elementi Eterni',\n",
       "  'Sinfonia di Galassie Perdute'],\n",
       " 96: [],\n",
       " 97: [\"Sinfonia Cosmica all'Alba di Fenice\",\n",
       "  'Sinfonia di Cristalli e Rigenerazione',\n",
       "  'Il Risveglio del Drago Celeste',\n",
       "  'Sinfonia Temporale al Tocco di Crono',\n",
       "  'Portale Cosmico: Sinfonia di Gnocchi del Crepuscolo con Essenza di Tachioni e Sfumature di Fenice'],\n",
       " 98: ['La Balena incontra la Mandragora',\n",
       "  'Nebulosa di Confini Sfondati',\n",
       "  'Sinfonia di Galassie Riflesse',\n",
       "  'Cosmic Harmony',\n",
       "  'Sinfonia Cosmica di Andromeda'],\n",
       " 99: ['Sfogliare Galattico di Sogni Temporali',\n",
       "  'Sinfonia Galattica alla Griglia Cangiante'],\n",
       " 100: []}"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "lista_risposte"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "with open('submission2.txt', 'w') as convert_file: \n",
    "     convert_file.write(json.dumps(lista_risposte))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "from format_submission import json_txt_to_submission\n",
    "json_txt_to_submission(\"dish_mapping.json\", \"submission2.txt\", \"output2.csv\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 156,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{1: [78], 2: [225], 3: [156], 4: [215], 5: [], 6: [179], 7: [171, 267, 189], 8: [15, 130, 13, 6, 209, 51], 9: [76, 207], 10: [115, 266], 11: [104], 12: [240, 185], 13: [125], 14: [81, 101], 15: [269, 147, 160, 35, 10, 125, 281, 191], 16: [147, 160, 35, 10, 125, 281, 217, 191], 17: [112, 263, 276, 157, 170, 16, 215], 18: [128, 37, 45, 91], 19: [], 20: [103, 54], 21: [168, 241], 22: [74], 23: [149], 24: [118], 25: [], 26: [205], 27: [92, 17, 115, 21, 243, 187], 28: [17, 205, 145, 96, 243, 62], 29: [234], 30: [205, 190, 112, 110, 180, 77], 31: [166, 221], 32: [206, 128, 124], 33: [], 34: [272], 35: [121, 217], 36: [72, 276, 247], 37: [140], 38: [188], 39: [247, 42, 99, 85, 5], 40: [49, 153, 157, 158, 197, 50, 235, 140], 41: [191, 187], 42: [48, 179], 43: [207, 37, 275, 123, 265, 59], 44: [147, 61, 142, 281, 169], 45: [89], 46: [286], 47: [], 48: [169], 49: [], 50: [], 51: [], 52: [], 53: [258], 54: [132, 52], 55: [268], 56: [272, 114], 57: [], 58: [], 59: [], 60: [], 61: [270, 78, 94], 62: [77, 46], 63: [174], 64: [198, 166], 65: [], 66: [], 67: [], 68: [], 69: [], 70: [], 71: [], 72: [], 73: [75, 96, 271, 26, 51], 74: [60, 141, 81, 116, 273, 131, 204], 75: [71, 44, 155, 121], 76: [145, 78], 77: [], 78: [], 79: [], 80: [], 81: [], 82: [], 83: [], 84: [], 85: [], 86: [], 87: [], 88: [], 89: [], 90: []}\n"
     ]
    }
   ],
   "source": [
    "import json\n",
    "\n",
    "def load_mapping(mapping_file):\n",
    "    with open(mapping_file, 'r', encoding='utf-8') as file:\n",
    "        mapping = json.load(file)\n",
    "    return mapping\n",
    "\n",
    "def map_dishes(dishes_dict, mapping):\n",
    "    mapped_dict = {}\n",
    "    for key, dishes in dishes_dict.items():\n",
    "        mapped_dishes = [mapping[dish] for dish in dishes if dish in mapping]\n",
    "        mapped_dict[key] = mapped_dishes\n",
    "    return mapped_dict\n",
    "\n",
    "# Esempio di utilizzo\n",
    "\n",
    "mapping_file = 'dish_mapping.json'\n",
    "mapping = load_mapping(mapping_file)\n",
    "mapped_dishes_dict = map_dishes(lista_risposte, mapping)\n",
    "\n",
    "print(mapped_dishes_dict)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 162,
   "metadata": {},
   "outputs": [],
   "source": [
    "import csv\n",
    "\n",
    "def dict_to_csv(data_dict, csv_filename):\n",
    "    with open(csv_filename, mode='w', newline='', encoding='utf-8') as file:\n",
    "        writer = csv.writer(file)\n",
    "        writer.writerow(['row_id', 'result'])  # Scrivi l'intestazione\n",
    "\n",
    "        for key, values in data_dict.items():\n",
    "            result = \",\".join(map(str, values))  # Converte la lista in stringa separata da virgole\n",
    "            writer.writerow([key, f'{result}'])  # Aggiungi manualmente le virgolette attorno alla stringa result\n",
    "            \n",
    "\n",
    "\n",
    "csv_filename = 'outputDaSottomettere.csv'\n",
    "dict_to_csv(mapped_dishes_dict, csv_filename)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Pianeti"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 168,
   "metadata": {},
   "outputs": [],
   "source": [
    "planet_directory = 'restaurant_planet_json'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 169,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_planet(pianeta, nome_ristorante):\n",
    "    query = \"\"\"\n",
    "    MERGE (p:Pianeta {nome: $pianeta})\n",
    "    WITH p\n",
    "    MATCH (r:Ristorante {nome: $nome_ristorante})\n",
    "    MERGE (r)-[:SI_TROVA_SU]->(p)\n",
    "    RETURN p\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query, pianeta=pianeta, nome_ristorante=nome_ristorante)\n",
    "        return result.single()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 175,
   "metadata": {},
   "outputs": [],
   "source": [
    "for filename in os.listdir(planet_directory):\n",
    "    if filename.endswith('.json'):\n",
    "        filepath = os.path.join(directory, filename)\n",
    "        with open(filepath, 'r', encoding='utf-8') as file:\n",
    "            data = json.load(file)\n",
    "            if 'nome_ristorante' in data:\n",
    "                nome_ristorante = data['nome_ristorante']\n",
    "\n",
    "                if 'nome_pianeta' in data:\n",
    "                    add_planet(data['nome_pianeta'], nome_ristorante)\n",
    "                "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 193,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'Tatooine': {'Asgard': 695, 'Namecc': 641, 'Arrakis': 109, 'Krypton': 661, 'Pandora': 1130, 'Cybertron': 344, 'Ego': 835, 'Montressosr': 731, 'Klyntar': 530}}, {'Asgard': {'Tatooine': 695, 'Namecc': 550, 'Arrakis': 781, 'Krypton': 188, 'Pandora': 473, 'Cybertron': 493, 'Ego': 156, 'Montressosr': 240, 'Klyntar': 479}}, {'Namecc': {'Tatooine': 641, 'Asgard': 550, 'Arrakis': 651, 'Krypton': 367, 'Pandora': 987, 'Cybertron': 728, 'Ego': 688, 'Montressosr': 767, 'Klyntar': 845}}, {'Arrakis': {'Tatooine': 109, 'Asgard': 781, 'Namecc': 651, 'Krypton': 727, 'Pandora': 1227, 'Cybertron': 454, 'Ego': 926, 'Montressosr': 834, 'Klyntar': 640}}, {'Krypton': {'Tatooine': 661, 'Asgard': 188, 'Namecc': 367, 'Arrakis': 727, 'Pandora': 626, 'Cybertron': 557, 'Ego': 321, 'Montressosr': 422, 'Klyntar': 599}}, {'Pandora': {'Tatooine': 1130, 'Asgard': 473, 'Namecc': 987, 'Arrakis': 1227, 'Krypton': 626, 'Cybertron': 847, 'Ego': 317, 'Montressosr': 413, 'Klyntar': 731}}, {'Cybertron': {'Tatooine': 344, 'Asgard': 493, 'Namecc': 728, 'Arrakis': 454, 'Krypton': 557, 'Pandora': 847, 'Ego': 594, 'Montressosr': 434, 'Klyntar': 186}}, {'Ego': {'Tatooine': 835, 'Asgard': 156, 'Namecc': 688, 'Arrakis': 926, 'Krypton': 321, 'Pandora': 317, 'Cybertron': 594, 'Montressosr': 215, 'Klyntar': 532}}, {'Montressosr': {'Tatooine': 731, 'Asgard': 240, 'Namecc': 767, 'Arrakis': 834, 'Krypton': 422, 'Pandora': 413, 'Cybertron': 434, 'Ego': 215, 'Klyntar': 331}}, {'Klyntar': {'Tatooine': 530, 'Asgard': 479, 'Namecc': 845, 'Arrakis': 640, 'Krypton': 599, 'Pandora': 731, 'Cybertron': 186, 'Ego': 532, 'Montressosr': 331}}]\n"
     ]
    }
   ],
   "source": [
    "import pandas as pd\n",
    "\n",
    "# Carica il file CSV in un DataFrame\n",
    "df = pd.read_csv('Distanze.csv', index_col=0, delimiter=',')\n",
    "\n",
    "# Crea la struttura dati desiderata\n",
    "distanze = {}\n",
    "for pianeta in df.index:\n",
    "    distanze[pianeta] = df.loc[pianeta].to_dict()\n",
    "\n",
    "# Rimuovi le distanze verso se stessi (0)\n",
    "for pianeta, distanze_pianeta in distanze.items():\n",
    "    if pianeta in distanze_pianeta:\n",
    "        del distanze_pianeta[pianeta]\n",
    "\n",
    "# Converti il dizionario in una lista di dizionari\n",
    "distanze_pianeti = [{pianeta: distanze_pianeta} for pianeta, distanze_pianeta in distanze.items()]\n",
    "\n",
    "print(distanze_pianeti)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 233,
   "metadata": {},
   "outputs": [],
   "source": [
    "def process_planet_data(planet_data):\n",
    "    cypher_queries = []\n",
    "    for planet in planet_data:\n",
    "        for key, values in planet.items():\n",
    "            for planet, distance in values.items():\n",
    "                    \n",
    "                query = f\"\"\"\n",
    "                MATCH (p1:Pianeta {{nome: '{key}'}})\n",
    "                MATCH (p2:Pianeta {{nome: '{planet}'}})\n",
    "                CREATE (p1)-[:HA_DISTANZA_ANNI_LUCE {{distanza: {distance}}}]->(p2)\n",
    "                \"\"\"\n",
    "                cypher_queries.append(query)\n",
    "            \n",
    "\n",
    "    return cypher_queries\n",
    "\n",
    "\n",
    "queries = process_planet_data(distanze_pianeti)\n",
    "\n",
    "\n",
    "def submit_queries(driver, queries):\n",
    "    with driver.session() as session:\n",
    "        for query in queries:\n",
    "            session.run(query)\n",
    "\n",
    "submit_queries(driver, queries)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 205,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[\"\\n                MATCH (p1:Pianeta {nome: 'Tatooine'})\\n                MATCH (p2:Pianeta {nome: 'Asgard'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 695}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Tatooine'})\\n                MATCH (p2:Pianeta {nome: 'Namecc'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 641}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Tatooine'})\\n                MATCH (p2:Pianeta {nome: 'Arrakis'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 109}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Tatooine'})\\n                MATCH (p2:Pianeta {nome: 'Krypton'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 661}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Tatooine'})\\n                MATCH (p2:Pianeta {nome: 'Pandora'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 1130}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Tatooine'})\\n                MATCH (p2:Pianeta {nome: 'Cybertron'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 344}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Tatooine'})\\n                MATCH (p2:Pianeta {nome: 'Ego'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 835}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Tatooine'})\\n                MATCH (p2:Pianeta {nome: 'Montressosr'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 731}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Tatooine'})\\n                MATCH (p2:Pianeta {nome: 'Klyntar'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 530}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Asgard'})\\n                MATCH (p2:Pianeta {nome: 'Tatooine'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 695}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Asgard'})\\n                MATCH (p2:Pianeta {nome: 'Namecc'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 550}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Asgard'})\\n                MATCH (p2:Pianeta {nome: 'Arrakis'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 781}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Asgard'})\\n                MATCH (p2:Pianeta {nome: 'Krypton'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 188}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Asgard'})\\n                MATCH (p2:Pianeta {nome: 'Pandora'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 473}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Asgard'})\\n                MATCH (p2:Pianeta {nome: 'Cybertron'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 493}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Asgard'})\\n                MATCH (p2:Pianeta {nome: 'Ego'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 156}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Asgard'})\\n                MATCH (p2:Pianeta {nome: 'Montressosr'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 240}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Asgard'})\\n                MATCH (p2:Pianeta {nome: 'Klyntar'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 479}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Namecc'})\\n                MATCH (p2:Pianeta {nome: 'Tatooine'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 641}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Namecc'})\\n                MATCH (p2:Pianeta {nome: 'Asgard'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 550}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Namecc'})\\n                MATCH (p2:Pianeta {nome: 'Arrakis'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 651}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Namecc'})\\n                MATCH (p2:Pianeta {nome: 'Krypton'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 367}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Namecc'})\\n                MATCH (p2:Pianeta {nome: 'Pandora'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 987}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Namecc'})\\n                MATCH (p2:Pianeta {nome: 'Cybertron'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 728}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Namecc'})\\n                MATCH (p2:Pianeta {nome: 'Ego'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 688}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Namecc'})\\n                MATCH (p2:Pianeta {nome: 'Montressosr'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 767}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Namecc'})\\n                MATCH (p2:Pianeta {nome: 'Klyntar'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 845}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Arrakis'})\\n                MATCH (p2:Pianeta {nome: 'Tatooine'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 109}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Arrakis'})\\n                MATCH (p2:Pianeta {nome: 'Asgard'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 781}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Arrakis'})\\n                MATCH (p2:Pianeta {nome: 'Namecc'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 651}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Arrakis'})\\n                MATCH (p2:Pianeta {nome: 'Krypton'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 727}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Arrakis'})\\n                MATCH (p2:Pianeta {nome: 'Pandora'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 1227}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Arrakis'})\\n                MATCH (p2:Pianeta {nome: 'Cybertron'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 454}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Arrakis'})\\n                MATCH (p2:Pianeta {nome: 'Ego'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 926}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Arrakis'})\\n                MATCH (p2:Pianeta {nome: 'Montressosr'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 834}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Arrakis'})\\n                MATCH (p2:Pianeta {nome: 'Klyntar'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 640}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Krypton'})\\n                MATCH (p2:Pianeta {nome: 'Tatooine'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 661}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Krypton'})\\n                MATCH (p2:Pianeta {nome: 'Asgard'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 188}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Krypton'})\\n                MATCH (p2:Pianeta {nome: 'Namecc'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 367}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Krypton'})\\n                MATCH (p2:Pianeta {nome: 'Arrakis'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 727}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Krypton'})\\n                MATCH (p2:Pianeta {nome: 'Pandora'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 626}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Krypton'})\\n                MATCH (p2:Pianeta {nome: 'Cybertron'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 557}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Krypton'})\\n                MATCH (p2:Pianeta {nome: 'Ego'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 321}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Krypton'})\\n                MATCH (p2:Pianeta {nome: 'Montressosr'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 422}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Krypton'})\\n                MATCH (p2:Pianeta {nome: 'Klyntar'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 599}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Pandora'})\\n                MATCH (p2:Pianeta {nome: 'Tatooine'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 1130}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Pandora'})\\n                MATCH (p2:Pianeta {nome: 'Asgard'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 473}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Pandora'})\\n                MATCH (p2:Pianeta {nome: 'Namecc'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 987}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Pandora'})\\n                MATCH (p2:Pianeta {nome: 'Arrakis'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 1227}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Pandora'})\\n                MATCH (p2:Pianeta {nome: 'Krypton'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 626}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Pandora'})\\n                MATCH (p2:Pianeta {nome: 'Cybertron'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 847}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Pandora'})\\n                MATCH (p2:Pianeta {nome: 'Ego'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 317}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Pandora'})\\n                MATCH (p2:Pianeta {nome: 'Montressosr'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 413}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Pandora'})\\n                MATCH (p2:Pianeta {nome: 'Klyntar'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 731}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Cybertron'})\\n                MATCH (p2:Pianeta {nome: 'Tatooine'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 344}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Cybertron'})\\n                MATCH (p2:Pianeta {nome: 'Asgard'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 493}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Cybertron'})\\n                MATCH (p2:Pianeta {nome: 'Namecc'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 728}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Cybertron'})\\n                MATCH (p2:Pianeta {nome: 'Arrakis'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 454}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Cybertron'})\\n                MATCH (p2:Pianeta {nome: 'Krypton'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 557}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Cybertron'})\\n                MATCH (p2:Pianeta {nome: 'Pandora'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 847}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Cybertron'})\\n                MATCH (p2:Pianeta {nome: 'Ego'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 594}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Cybertron'})\\n                MATCH (p2:Pianeta {nome: 'Montressosr'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 434}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Cybertron'})\\n                MATCH (p2:Pianeta {nome: 'Klyntar'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 186}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Ego'})\\n                MATCH (p2:Pianeta {nome: 'Tatooine'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 835}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Ego'})\\n                MATCH (p2:Pianeta {nome: 'Asgard'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 156}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Ego'})\\n                MATCH (p2:Pianeta {nome: 'Namecc'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 688}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Ego'})\\n                MATCH (p2:Pianeta {nome: 'Arrakis'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 926}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Ego'})\\n                MATCH (p2:Pianeta {nome: 'Krypton'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 321}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Ego'})\\n                MATCH (p2:Pianeta {nome: 'Pandora'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 317}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Ego'})\\n                MATCH (p2:Pianeta {nome: 'Cybertron'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 594}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Ego'})\\n                MATCH (p2:Pianeta {nome: 'Montressosr'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 215}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Ego'})\\n                MATCH (p2:Pianeta {nome: 'Klyntar'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 532}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Montressosr'})\\n                MATCH (p2:Pianeta {nome: 'Tatooine'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 731}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Montressosr'})\\n                MATCH (p2:Pianeta {nome: 'Asgard'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 240}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Montressosr'})\\n                MATCH (p2:Pianeta {nome: 'Namecc'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 767}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Montressosr'})\\n                MATCH (p2:Pianeta {nome: 'Arrakis'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 834}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Montressosr'})\\n                MATCH (p2:Pianeta {nome: 'Krypton'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 422}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Montressosr'})\\n                MATCH (p2:Pianeta {nome: 'Pandora'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 413}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Montressosr'})\\n                MATCH (p2:Pianeta {nome: 'Cybertron'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 434}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Montressosr'})\\n                MATCH (p2:Pianeta {nome: 'Ego'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 215}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Montressosr'})\\n                MATCH (p2:Pianeta {nome: 'Klyntar'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 331}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Klyntar'})\\n                MATCH (p2:Pianeta {nome: 'Tatooine'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 530}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Klyntar'})\\n                MATCH (p2:Pianeta {nome: 'Asgard'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 479}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Klyntar'})\\n                MATCH (p2:Pianeta {nome: 'Namecc'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 845}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Klyntar'})\\n                MATCH (p2:Pianeta {nome: 'Arrakis'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 640}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Klyntar'})\\n                MATCH (p2:Pianeta {nome: 'Krypton'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 599}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Klyntar'})\\n                MATCH (p2:Pianeta {nome: 'Pandora'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 731}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Klyntar'})\\n                MATCH (p2:Pianeta {nome: 'Cybertron'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 186}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Klyntar'})\\n                MATCH (p2:Pianeta {nome: 'Ego'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 532}]->(p2)\\n                \",\n",
       " \"\\n                MATCH (p1:Pianeta {nome: 'Klyntar'})\\n                MATCH (p2:Pianeta {nome: 'Montressosr'})\\n                CREATE (p1)-[:HA_DISTANZA {valore: 331}]->(p2)\\n                \"]"
      ]
     },
     "execution_count": 205,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queries"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
