{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Main steps:\n",
    "1. testare connessione grafo \n",
    "2. creazione nodi Ristorante - Piatti - Ingredienti"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "OPENAI_API_KEY = \"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\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "from dotenv import load_dotenv\n",
    "import json"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "load_dotenv()\n",
    "\n",
    "os.environ[\"NEO4J_URI\"] = os.getenv(\"NEO4J_URI\")\n",
    "os.environ[\"NEO4J_USERNAME\"] = os.getenv(\"NEO4J_USERNAME\")\n",
    "os.environ[\"NEO4J_PASSWORD\"] = os.getenv(\"NEO4J_PASSWORD\")\n",
    "uri = os.environ[\"NEO4J_URI\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(uri, auth=(os.environ[\"NEO4J_USERNAME\"], os.environ[\"NEO4J_PASSWORD\"]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record nodes=[<Node element_id='-23' labels=frozenset({'Tecnica'}) properties={'name': 'Tecnica', 'indexes': [], 'constraints': [\"Constraint( id=12, name='constraint_7b990bc7', type='UNIQUENESS', schema=(:Tecnica {id}), ownedIndex=11 )\"]}>, <Node element_id='-22' labels=frozenset({'Ingrediente'}) properties={'name': 'Ingrediente', 'indexes': [], 'constraints': [\"Constraint( id=10, name='constraint_5c7a41c', type='UNIQUENESS', schema=(:Ingrediente {id}), ownedIndex=9 )\"]}>, <Node element_id='-24' labels=frozenset({'Pianeta'}) properties={'name': 'Pianeta', 'indexes': [], 'constraints': [\"Constraint( id=14, name='constraint_de0a272c', type='UNIQUENESS', schema=(:Pianeta {id}), ownedIndex=13 )\"]}>, <Node element_id='-19' labels=frozenset({'Ristorante'}) properties={'name': 'Ristorante', 'indexes': [], 'constraints': [\"Constraint( id=4, name='constraint_727b183b', type='UNIQUENESS', schema=(:Ristorante {id}), ownedIndex=3 )\"]}>, <Node element_id='-20' labels=frozenset({'Chef'}) properties={'name': 'Chef', 'indexes': [], 'constraints': [\"Constraint( id=6, name='constraint_204acb3d', type='UNIQUENESS', schema=(:Chef {id}), ownedIndex=5 )\"]}>, <Node element_id='-21' labels=frozenset({'Piatto'}) properties={'name': 'Piatto', 'indexes': [], 'constraints': [\"Constraint( id=8, name='constraint_471e6641', type='UNIQUENESS', schema=(:Piatto {id}), ownedIndex=7 )\"]}>, <Node element_id='-25' labels=frozenset({'Licenza'}) properties={'name': 'Licenza', 'indexes': [], 'constraints': []}>] relationships=[<Relationship element_id='-19' nodes=(<Node element_id='-19' labels=frozenset({'Ristorante'}) properties={'name': 'Ristorante', 'indexes': [], 'constraints': [\"Constraint( id=4, name='constraint_727b183b', type='UNIQUENESS', schema=(:Ristorante {id}), ownedIndex=3 )\"]}>, <Node element_id='-20' labels=frozenset({'Chef'}) properties={'name': 'Chef', 'indexes': [], 'constraints': [\"Constraint( id=6, name='constraint_204acb3d', type='UNIQUENESS', schema=(:Chef {id}), ownedIndex=5 )\"]}>) type='GESTITO_DA' properties={'name': 'GESTITO_DA'}>, <Relationship element_id='-21' nodes=(<Node element_id='-21' labels=frozenset({'Piatto'}) properties={'name': 'Piatto', 'indexes': [], 'constraints': [\"Constraint( id=8, name='constraint_471e6641', type='UNIQUENESS', schema=(:Piatto {id}), ownedIndex=7 )\"]}>, <Node element_id='-22' labels=frozenset({'Ingrediente'}) properties={'name': 'Ingrediente', 'indexes': [], 'constraints': [\"Constraint( id=10, name='constraint_5c7a41c', type='UNIQUENESS', schema=(:Ingrediente {id}), ownedIndex=9 )\"]}>) type='CONTIENE' properties={'name': 'CONTIENE'}>, <Relationship element_id='-24' nodes=(<Node element_id='-24' labels=frozenset({'Pianeta'}) properties={'name': 'Pianeta', 'indexes': [], 'constraints': [\"Constraint( id=14, name='constraint_de0a272c', type='UNIQUENESS', schema=(:Pianeta {id}), ownedIndex=13 )\"]}>, <Node element_id='-24' labels=frozenset({'Pianeta'}) properties={'name': 'Pianeta', 'indexes': [], 'constraints': [\"Constraint( id=14, name='constraint_de0a272c', type='UNIQUENESS', schema=(:Pianeta {id}), ownedIndex=13 )\"]}>) type='HA_DISTANZA_ANNI_LUCE' properties={'name': 'HA_DISTANZA_ANNI_LUCE'}>, <Relationship element_id='-20' nodes=(<Node element_id='-19' labels=frozenset({'Ristorante'}) properties={'name': 'Ristorante', 'indexes': [], 'constraints': [\"Constraint( id=4, name='constraint_727b183b', type='UNIQUENESS', schema=(:Ristorante {id}), ownedIndex=3 )\"]}>, <Node element_id='-21' labels=frozenset({'Piatto'}) properties={'name': 'Piatto', 'indexes': [], 'constraints': [\"Constraint( id=8, name='constraint_471e6641', type='UNIQUENESS', schema=(:Piatto {id}), ownedIndex=7 )\"]}>) type='OFFRE_IL_PIATTO' properties={'name': 'OFFRE_IL_PIATTO'}>, <Relationship element_id='-22' nodes=(<Node element_id='-21' labels=frozenset({'Piatto'}) properties={'name': 'Piatto', 'indexes': [], 'constraints': [\"Constraint( id=8, name='constraint_471e6641', type='UNIQUENESS', schema=(:Piatto {id}), ownedIndex=7 )\"]}>, <Node element_id='-23' labels=frozenset({'Tecnica'}) properties={'name': 'Tecnica', 'indexes': [], 'constraints': [\"Constraint( id=12, name='constraint_7b990bc7', type='UNIQUENESS', schema=(:Tecnica {id}), ownedIndex=11 )\"]}>) type='REALIZZATO_CON_LA_TECNICA' properties={'name': 'REALIZZATO_CON_LA_TECNICA'}>, <Relationship element_id='-23' nodes=(<Node element_id='-19' labels=frozenset({'Ristorante'}) properties={'name': 'Ristorante', 'indexes': [], 'constraints': [\"Constraint( id=4, name='constraint_727b183b', type='UNIQUENESS', schema=(:Ristorante {id}), ownedIndex=3 )\"]}>, <Node element_id='-24' labels=frozenset({'Pianeta'}) properties={'name': 'Pianeta', 'indexes': [], 'constraints': [\"Constraint( id=14, name='constraint_de0a272c', type='UNIQUENESS', schema=(:Pianeta {id}), ownedIndex=13 )\"]}>) type='SI_TROVA_SU' properties={'name': 'SI_TROVA_SU'}>, <Relationship element_id='-25' nodes=(<Node element_id='-20' labels=frozenset({'Chef'}) properties={'name': 'Chef', 'indexes': [], 'constraints': [\"Constraint( id=6, name='constraint_204acb3d', type='UNIQUENESS', schema=(:Chef {id}), ownedIndex=5 )\"]}>, <Node element_id='-25' labels=frozenset({'Licenza'}) properties={'name': 'Licenza', 'indexes': [], 'constraints': []}>) type='POSSIEDE_LICENZA' properties={'name': 'POSSIEDE_LICENZA'}>]>\n"
     ]
    }
   ],
   "source": [
    "def get_graph_schema(driver):\n",
    "    with driver.session() as session:\n",
    "        result = session.run(\"\"\"CALL db.schema.visualization()\n",
    "               \"\"\")\n",
    "        return result.single()\n",
    "    \n",
    "schema = get_graph_schema(driver)\n",
    "print(schema)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Aggiunta menu-ristoranti-piatti al grafo"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {},
   "outputs": [],
   "source": [
    "directory = 'menu_json'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_restaurant(restaurant_name):\n",
    "    query = \"\"\"\n",
    "    CREATE (r:Ristorante {nome: $nome})\n",
    "    RETURN r\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query, nome=restaurant_name)\n",
    "        return result.single()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 71,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_chef(chef, nome_ristorante):\n",
    "    query = \"\"\"\n",
    "    MERGE (c:Chef {nome: $chef})\n",
    "    WITH c\n",
    "    MATCH (r:Ristorante {nome: $nome_ristorante})\n",
    "    MERGE (r)-[:GESTITO_DA]->(c)\n",
    "    RETURN c\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query, chef=chef, nome_ristorante=nome_ristorante)\n",
    "        return result.single()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 70,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_piatto(piatto, nome_ristorante):\n",
    "    query = \"\"\"\n",
    "    MERGE (p:Piatto {nome: $piatto})\n",
    "    WITH p\n",
    "    MATCH (r:Ristorante {nome: $nome_ristorante})\n",
    "    MERGE (r)-[:OFFRE_IL_PIATTO]->(p)\n",
    "    RETURN p\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query, piatto=piatto, nome_ristorante=nome_ristorante)\n",
    "        return result.single()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 69,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_ingrediente(ingrediente, nome_piatto):\n",
    "    query = \"\"\"\n",
    "    MERGE (i:Ingrediente {nome: $ingrediente})\n",
    "    WITH i\n",
    "    MATCH (p:Piatto {nome: $nome_piatto})\n",
    "    MERGE (p)-[:CONTIENE]->(i)\n",
    "    RETURN i\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query, ingrediente=ingrediente, nome_piatto=nome_piatto)\n",
    "        return result.single()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_tecnica(tecnica, nome_piatto):\n",
    "    query = \"\"\"\n",
    "    MERGE (t:Tecnica {nome: $tecnica})\n",
    "    WITH t\n",
    "    MATCH (p:Piatto {nome: $nome_piatto})\n",
    "    MERGE (p)-[:REALIZZATO_CON_LA_TECNICA]->(t)\n",
    "    RETURN t\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query, tecnica=tecnica, nome_piatto=nome_piatto)\n",
    "        return result.single()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_menu(menu, nome_ristorante):\n",
    "    \"\"\"Riceva una lista di piatti, ogni piatto è un dizionario con chiavi:\n",
    "    nome_piatto: str,\n",
    "    ingredienti: list[str],\n",
    "    tecniche: list [str]\n",
    "    \"\"\"\n",
    "    \n",
    "    for piatto in menu:\n",
    "        nome_piatto = piatto['nome_piatto'] if 'nome_piatto' in piatto else ''\n",
    "        add_piatto(nome_piatto, nome_ristorante)\n",
    "                        \n",
    "        if 'ingredienti' in piatto:\n",
    "            ingredienti = piatto['ingredienti']\n",
    "            for ingrediente in ingredienti:\n",
    "                add_ingrediente(ingrediente, nome_piatto)\n",
    "\n",
    "        if 'tecniche' in piatto:\n",
    "            tecniche = piatto['tecniche']\n",
    "            for tecnica in tecniche:\n",
    "                add_tecnica(tecnica, nome_piatto)\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "metadata": {},
   "outputs": [],
   "source": [
    "for filename in os.listdir(directory):\n",
    "    if filename.endswith('.json'):\n",
    "        filepath = os.path.join(directory, filename)\n",
    "        with open(filepath, 'r', encoding='utf-8') as file:\n",
    "            data = json.load(file)\n",
    "            if 'nome_ristorante' in data:\n",
    "                add_restaurant(data['nome_ristorante'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "metadata": {},
   "outputs": [],
   "source": [
    "for filename in os.listdir(directory):\n",
    "    if filename.endswith('.json'):\n",
    "        filepath = os.path.join(directory, filename)\n",
    "        with open(filepath, 'r', encoding='utf-8') as file:\n",
    "            data = json.load(file)\n",
    "            if 'nome_ristorante' in data:\n",
    "                nome_ristorante = data['nome_ristorante']\n",
    "                \n",
    "                if 'nome_chef' in data:\n",
    "                    add_chef(data['nome_chef'], nome_ristorante)\n",
    "                if 'menu' in data:\n",
    "                    add_menu(data['menu'], nome_ristorante)\n",
    "                \n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Creazione indici (per migliori performance)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_indexes(driver):\n",
    "    with driver.session() as session:\n",
    "        for label in [\"Ristorante\", \"Chef\", \"Piatto\", \"Ingrediente\", \"Tecnica\", \"Pianeta\", \"Licenza\"]:\n",
    "            session.run(f\"CREATE CONSTRAINT IF NOT EXISTS FOR (n:{label}) REQUIRE n.id IS UNIQUE\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "metadata": {},
   "outputs": [],
   "source": [
    "create_indexes(driver)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Querying the Graph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Vanilla\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_neo4j import GraphCypherQAChain\n",
    "from langchain_openai import ChatOpenAI\n",
    "from langchain_neo4j import Neo4jGraph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "llm = ChatOpenAI(\n",
    "    model=\"gpt-4o\",\n",
    "    temperature=0,\n",
    "    max_tokens=None,\n",
    "    api_key=OPENAI_API_KEY\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties:\n",
      "- **Ristorante**\n",
      "  - `nome`: STRING Example: \"Anima Cosmica\"\n",
      "- **Chef**\n",
      "  - `nome`: STRING Example: \"Aurora Stellaris\"\n",
      "- **Piatto**\n",
      "  - `nome`: STRING Example: \"Nebulosa Celestiale alla Stellaris\"\n",
      "- **Ingrediente**\n",
      "  - `nome`: STRING Example: \"Shard di Materia Oscura\"\n",
      "- **Tecnica**\n",
      "  - `nome`: STRING Example: \"Cottura a Vapore con Flusso di Particelle Isoarmon\"\n",
      "- **Pianeta**\n",
      "  - `nome`: STRING Available options: ['Pandora', 'Tatooine', 'Ego', 'Klyntar', 'Cybertron', 'Arrakis', 'Asgard', 'Krypton', 'Namecc']\n",
      "- **Licenza**\n",
      "  - `sigla`: STRING Available options: ['P', 't', 'G', 'e+', 'Mx', 'Q', 'c', 'LTK']\n",
      "  - `nome`: STRING Available options: ['Psionica', 'Temporale', 'Gravitazionale', 'Antimateria', 'Magnetica', 'Quantistica', 'Luce', 'Livello di Sviluppo Tecnologico']\n",
      "Relationship properties:\n",
      "- **HA_DISTANZA_ANNI_LUCE**\n",
      "  - `distanza`: INTEGER Min: 0, Max: 1227\n",
      "- **POSSIEDE_LICENZA**\n",
      "  - `grado`: STRING Example: \"3\"\n",
      "The relationships:\n",
      "(:Ristorante)-[:SI_TROVA_SU]->(:Pianeta)\n",
      "(:Ristorante)-[:GESTITO_DA]->(:Chef)\n",
      "(:Ristorante)-[:OFFRE_IL_PIATTO]->(:Piatto)\n",
      "(:Chef)-[:POSSIEDE_LICENZA]->(:Licenza)\n",
      "(:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica)\n",
      "(:Piatto)-[:CONTIENE]->(:Ingrediente)\n",
      "(:Pianeta)-[:HA_DISTANZA_ANNI_LUCE]->(:Pianeta)\n"
     ]
    }
   ],
   "source": [
    "graph = Neo4jGraph(\n",
    "    url=uri, \n",
    "    username=os.environ[\"NEO4J_USERNAME\"], \n",
    "    password=os.environ[\"NEO4J_PASSWORD\"],\n",
    "    enhanced_schema=True\n",
    ")\n",
    "\n",
    "print(graph.schema)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_core.prompts.prompt import PromptTemplate"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "CYPHER_GENERATION_TEMPLATE = \"\"\"Task:Generate Cypher statement to query a graph database.\n",
    "The graph database contains restaurants and dishes from an alien galaxy.\n",
    "Each restaurant is located in a planet.\n",
    "Each planet has a given distance from the other ones expressed in light years. \n",
    "The distance between planets is specified as a property of the 'HA_DISTANZA_ANNI_LUCE' relationship. This property is named 'distanza'.\n",
    "\n",
    "\n",
    "Instructions:\n",
    "Use only the provided relationship types and properties in the schema.\n",
    "Do not use any other relationship types or properties that are not provided.\n",
    "Your goal is always to find a dish (Piatto) or a list of dishes starting from some filters.\n",
    "You will never be provided with a name of a dish in the initial question.\n",
    "\n",
    " \n",
    "Schema:\n",
    "{schema}\n",
    "Note: Do not include any explanations or apologies in your responses.\n",
    "Do not respond to any questions that might ask anything else than for you to construct a Cypher statement.\n",
    "Do not include any text except the generated Cypher statement.\n",
    "\n",
    "Examples: Here are a few examples of generated Cypher statements for particular questions:\n",
    "# Quali sono i piatti disponibili nei ristoranti entro 200 anni luce da Pandora?\n",
    "\n",
    "MATCH (p1:Pianeta {{nome: \"Pandora\"}})-[rel:HA_DISTANZA_ANNI_LUCE]->(p2:Pianeta),\n",
    "      (r:Ristorante)-[:SI_TROVA_SU]->(p2),\n",
    "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)\n",
    "WHERE rel.distanza <= 200\n",
    "RETURN DISTINCT piatto.nome\n",
    "\n",
    "\n",
    "The question is:\n",
    "{question}\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "CYPHER_GENERATION_TEMPLATE_LICENZE = \"\"\"Task:Generate Cypher statement to query a graph database.\n",
    "The graph database contains restaurants and dishes from an alien galaxy.\n",
    "Each restaurant is located in a planet.\n",
    "Each planet has a given distance from the other ones expressed in light years. \n",
    "The distance between planets is specified as a property of the 'HA_DISTANZA_ANNI_LUCE' relationship. This property is named 'distanza'.\n",
    "Each Chef can have one or more licenses with a specific grade/score. The score is specified as an attribute in the relationship POSSIEDE_LICENZA that connects the nodes Chef and Licenza.\n",
    "When you need to find a node Licenza, you must use his attributes 'nome' and 'sigla' in OR condition to find the match.\n",
    "\n",
    "\n",
    "Instructions:\n",
    "Use only the provided relationship types and properties in the schema.\n",
    "Do not use any other relationship types or properties that are not provided.\n",
    "Your goal is always to find a dish (Piatto) or a list of dishes starting from some filters.\n",
    "You will never be provided with a name of a dish in the initial question.\n",
    "\n",
    " \n",
    "Schema:\n",
    "{schema}\n",
    "Note: Do not include any explanations or apologies in your responses.\n",
    "Do not respond to any questions that might ask anything else than for you to construct a Cypher statement.\n",
    "Do not include any text except the generated Cypher statement.\n",
    "\n",
    "Examples: Here are a few examples of generated Cypher statements for particular questions:\n",
    "# Quali sono i piatti disponibili nei ristoranti entro 200 anni luce da Pandora?\n",
    "\n",
    "MATCH (p1:Pianeta {{nome: \"Pandora\"}})-[rel:HA_DISTANZA_ANNI_LUCE]->(p2:Pianeta),\n",
    "      (r:Ristorante)-[:SI_TROVA_SU]->(p2),\n",
    "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)\n",
    "WHERE rel.distanza <= 200\n",
    "RETURN DISTINCT piatto.nome\n",
    "\n",
    "\n",
    "The question is:\n",
    "{question}\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "CYPHER_GENERATION_TEMPLATE_FUZZY = \"\"\"Task:Generate Cypher statement to query a graph database.\n",
    "The graph database contains restaurants and dishes from an alien galaxy.\n",
    "Each restaurant is located in a planet.\n",
    "Each planet has a given distance from the other ones expressed in light years. \n",
    "The distance between planets is specified as a property of the 'HA_DISTANZA_ANNI_LUCE' relationship. This property is named 'distanza'.\n",
    "Each Chef can have one or more licenses with a specific grade/score. The score is specified as an attribute in the relationship POSSIEDE_LICENZA that connects the nodes Chef and Licenza.\n",
    "When you need to find a node Licenza, you must use his attributes 'nome' and 'sigla' in OR condition to find the match.\n",
    "\n",
    "\n",
    "Instructions:\n",
    "Use only the provided relationship types and properties in the schema.\n",
    "Do not use any other relationship types or properties that are not provided.\n",
    "Your goal is always to find a dish (Piatto) or a list of dishes starting from some filters.\n",
    "You will never be provided with a name of a dish in the initial question.\n",
    "In order to be resilient to possible mispelling, always use the Levenshtein Distance with a threshold of 3, after converting to lower case. \n",
    "\n",
    " \n",
    "Schema:\n",
    "{schema}\n",
    "Note: Do not include any explanations or apologies in your responses.\n",
    "Do not respond to any questions that might ask anything else than for you to construct a Cypher statement.\n",
    "Do not include any text except the generated Cypher statement.\n",
    "\n",
    "Examples: Here are a few examples of generated Cypher statements for particular questions:\n",
    "# Quali sono i piatti disponibili nei ristoranti entro 200 anni luce da Pandora?\n",
    "\n",
    "MATCH (p1:Pianeta {{nome: \"Pandora\"}})-[rel:HA_DISTANZA_ANNI_LUCE]->(p2:Pianeta),\n",
    "      (r:Ristorante)-[:SI_TROVA_SU]->(p2),\n",
    "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)\n",
    "WHERE rel.distanza <= 200\n",
    "RETURN DISTINCT piatto.nome\n",
    "\n",
    "\n",
    "The question is:\n",
    "{question}\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "CYPHER_GENERATION_PROMPT = PromptTemplate(\n",
    "    input_variables=[\"schema\", \"question\"], template=CYPHER_GENERATION_TEMPLATE_LICENZE\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [],
   "source": [
    "chain = GraphCypherQAChain.from_llm(\n",
    "    llm, \n",
    "    graph=graph, \n",
    "    verbose=True, \n",
    "    allow_dangerous_requests=True, \n",
    "    cypher_prompt=CYPHER_GENERATION_PROMPT,\n",
    "    return_direct=True,\n",
    "    top_k=50,\n",
    "    validate_cypher=True\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (c:Chef)-[pl:POSSIEDE_LICENZA]->(l:Licenza),\n",
      "      (c)-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(i:Ingrediente {nome: \"Spezie Melange\"})\n",
      "WHERE (l.sigla = \"LTK\" OR l.nome = \"LTK\") AND pl.grado >= \"7\"\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    }
   ],
   "source": [
    "answer = chain.invoke(\"Quali sono i piatti preparati da chef con licenza LTK di grado 7 o superiore che utilizzano le Spezie Melange come ingrediente?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 51,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "answer[\"result\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 298,
   "metadata": {},
   "outputs": [],
   "source": [
    "tmp=[]\n",
    "for piatto in answer[\"result\"]:\n",
    "    tmp.append(list(piatto.values())[0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 299,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Sinfonia Temporale al Tocco di Crono',\n",
       " 'Nebulosa di Fenice con Sinfonia Eterea',\n",
       " 'Sfogliare Galattico di Sogni Temporali',\n",
       " 'Viaggio dei Sensi: Bolla Temporale di Aromi Ancestrali',\n",
       " 'Sinfonia di Stagioni Stellari',\n",
       " 'Sinfonia di Crepuscolo Celestiale',\n",
       " 'Sinfonia Temporale nello Spaghi del Sole',\n",
       " 'Galassia Risvegliata',\n",
       " 'Cosmopolis delle Galassie Perdute',\n",
       " 'Sinfonia Tempolare Galattica']"
      ]
     },
     "execution_count": 299,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "tmp"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {},
   "outputs": [],
   "source": [
    "import csv\n",
    "\n",
    "def read_csv(file_path):\n",
    "    with open(file_path, mode='r', encoding='utf-8') as file:\n",
    "        lista_domande = []\n",
    "        csv_reader = csv.DictReader(file)\n",
    "        for row in csv_reader:\n",
    "            lista_domande.append(row['domanda'])\n",
    "        return lista_domande\n",
    "            \n",
    "\n",
    "# Example usage\n",
    "file_path = 'domande.csv'\n",
    "lista_domande = read_csv(file_path)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Chocobo Wings\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 1 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Cioccorane\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 2 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Latte+\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 3 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Ravioli al Vaporeon\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 4 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Sashimi di Magikarp\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 5 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Frutti del Diavolo\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 6 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Grigliatura a Energia Stellare DiV\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 7 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Sferificazione a Gravità Psionica Variabile\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 8 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t1:Tecnica {nome: \"Marinatura Temporale Sincronizzata\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t2:Tecnica {nome: \"Congelamento Bio-Luminiscente Sincronico\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 9 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t1:Tecnica {nome: \"Cottura Olografica Quantum Fluttuante\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t2:Tecnica {nome: \"Decostruzione Interdimensionale Lovecraftiana\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 10 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente {nome: \"Riso di Cassandra\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente {nome: \"Polvere di Crononite\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 11 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente {nome: \"Shard di Prisma Stellare\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente {nome: \"Sale Temporale\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 12 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Teste di Idra\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Cottura Sottovuoto Multirealità Collassante\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 13 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Fermentazione Quantico Biometrica\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Erba Pipa\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 14 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Sferificazione Filamentare a Molecole Vibrazionali\"})\n",
      "WHERE NOT (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Amalgamazione Sintetica Molecolare\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 15 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE tecnica.nome = \"Sferificazione Filamentare a Molecole Vibrazionali\"\n",
      "AND NOT EXISTS {\n",
      "  MATCH (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica2:Tecnica)\n",
      "  WHERE tecnica2.nome = \"Decostruzione Magnetica Risonante\"\n",
      "}\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 16 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Sferificazione con Campi Magnetici Entropici\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE NOT ingrediente.nome = \"Spezie Melange\"\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 17 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Surgelamento Antimaterico a Risonanza Inversa\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE NOT ingrediente.nome = \"Foglie di Mandragora\"\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 18 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente {nome: \"Foglie di Nebulosa\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente {nome: \"Amido di Stellarion\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente3:Ingrediente {nome: \"Uova di Fenice\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 19 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente {nome: \"Carne di Balena spaziale\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente {nome: \"Essenza di Tachioni\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente3:Ingrediente {nome: \"Alghe Bioluminescenti\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 20 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente {nome: \"Erba Pipa\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente {nome: \"Funghi Orbitali\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Bollitura Infrasonica Armonizzata\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 21 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Pianeta)<-[:SI_TROVA_SU]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Cottura a Vapore con Flusso di Particelle Isoarmoniche\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente1:Ingrediente {nome: \"Riso di Cassandra\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente {nome: \"Foglie di Nebulosa\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 22 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Carne di Balena spaziale\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Bollitura Entropica Sincronizzata\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Affettamento a Pulsazioni Quantistiche\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 23 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Lacrime di Unicorno\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica1:Tecnica {nome: \"Taglio Sinaptico Biomimetico\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica2:Tecnica {nome: \"Idro-Cristallizzazione Sonora Quantistica\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 24 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t1:Tecnica {nome: \"Cottura a Vapore Risonante Simbiotico\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t2:Tecnica {nome: \"doppia Fermentazione Quantico Biometrica\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 25 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica1:Tecnica {nome: \"Taglio a Risonanza Sonica Rigenerativa\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica2:Tecnica {nome: \"Cottura a Vapore Ecodinamico Bilanciato\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 26 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente {nome: \"Lattuga Namecciana\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente {nome: \"Carne di Mucca\"})\n",
      "WHERE NOT EXISTS {\n",
      "  MATCH (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Teste di Idra\"})\n",
      "}\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 27 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente {nome: \"Essenza di Tachioni\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente {nome: \"Carne di Mucca\"})\n",
      "WHERE NOT (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Muffa Lunare\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 28 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Funghi Orbitali\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Marinatura Psionica\"})\n",
      "WHERE NOT EXISTS {\n",
      "  MATCH (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Shard di Materia Oscura\"})\n",
      "}\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 29 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente {nome: \"Funghi dell’Etere\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Impasto Gravitazionale Vorticoso\"})\n",
      "WHERE NOT EXISTS {\n",
      "    MATCH (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Plasma Vitale\"})\n",
      "}\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 30 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente {nome: \"Funghi dell’Etere\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente {nome: \"Erba Pipa\"})\n",
      "WHERE NOT (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Decostruzione Magnetica Risonante\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 31 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente {nome: \"Salsa Szechuan\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente {nome: \"Granuli di Nebbia Arcobaleno\"})\n",
      "WHERE NOT EXISTS {\n",
      "  MATCH (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Affumicatura a Stratificazione Quantica\"})\n",
      "}\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 32 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Funghi Orbitali\"})\n",
      "WITH piatto\n",
      "MATCH (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica1:Tecnica {nome: \"Affumicatura tramite Big Bang Microcosmico\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica2:Tecnica {nome: \"Affettamento a Pulsazioni Quantistiche\"})\n",
      "WHERE NOT (piatto)-[:CONTIENE]->(ingrediente)\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "domanda 33 in errore\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica1:Tecnica {nome: \"Incisione Elettromagnetica Plasmica\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica2:Tecnica {nome: \"Bollitura Entropica Sincronizzata\"})\n",
      "WHERE NOT (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Cristalli di Memoria\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 34 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Polvere di Crononite\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Incisione Elettromagnetica Plasmica\"})\n",
      "WHERE NOT EXISTS {\n",
      "  MATCH (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Decostruzione Atomica a Strati Energetici\"})\n",
      "}\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 35 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Alghe Bioluminescenti\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Idro-Cristallizzazione Sonora Quantistica\"})\n",
      "WHERE NOT (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Marinatura Temporale Sincronizzata\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 36 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE NOT tecnica.nome = \"Cottura a Vapore Termocinetica Multipla\"\n",
      "WITH piatto\n",
      "MATCH (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica1:Tecnica {nome: \"Congelazione Iperdimensionalmente Stratificata\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica2:Tecnica {nome: \"Fermentazione Quantico Biometrica\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 37 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t1:Tecnica {nome: \"Affumicatura tramite Big Bang Microcosmico\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t2:Tecnica {nome: \"Cottura Sottovuoto Frugale Energeticamente Negativa\"})\n",
      "WHERE NOT (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Fermentazione Quantico Biometrica\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 38 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Marinatura tramite Reazioni d'Antimateria Diluite\"})\n",
      "WHERE NOT (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Cristalli di Nebulite\"})\n",
      "  AND NOT (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Funghi dell’Etere\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 39 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Congelazione Iperdimensionalmente Stratificata\"})\n",
      "WHERE NOT (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Fibra di Sintetex\"})\n",
      "  AND NOT (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Funghi Orbitali\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 40 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Grigliatura Psionica Dinamica Ritmica\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE NOT ingrediente.nome = \"Pane degli Abissi\"\n",
      "AND NOT (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Cottura Olografica Quantum Fluttuante\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 41 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Taglio Sinaptico Biomimetico\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE NOT ingrediente.nome = \"Lattuga Namecciana\"\n",
      "AND NOT EXISTS {\n",
      "  MATCH (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Cottura Sottovuoto Bioma Sintetico\"})\n",
      "}\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 42 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Decostruzione Ancestrale\"})\n",
      "WHERE NOT (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Cottura a Vapore Termocinetica Multipla\"})\n",
      "  AND NOT (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Marinatura a Infusione Gravitazionale\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 43 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Affumicatura Polarizzata a Freddo Iperbarico\"})\n",
      "WHERE NOT (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Fermentazione Psionica Energetica\"})\n",
      "  AND NOT (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Congelamento Bio-Luminiscente Sincronico\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 44 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE ingrediente.nome IN [\"Carne di Balena spaziale\", \"Teste di Idra\", \"Spaghi del Sole\", \"Carne di Xenodonte\"]\n",
      "WITH piatto, COLLECT(ingrediente.nome) AS ingredienti\n",
      "WHERE ALL(x IN [\"Carne di Balena spaziale\", \"Teste di Idra\", \"Spaghi del Sole\", \"Carne di Xenodonte\"] WHERE x IN ingredienti)\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 45 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente {nome: \"Cristalli di Memoria\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente {nome: \"Essenza di Tachioni\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente3:Ingrediente {nome: \"Carne di Kraken\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 46 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Vero Ghiaccio\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE tecnica.nome IN [\"Cottura Sottovuoto Frugale Energeticamente Negativa\", \"Cottura Sottovuoto Bioma Sintetico\"]\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 47 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente {nome: \"Shard di Materia Oscura\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente {nome: \"Uova di Fenice\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica1:Tecnica {nome: \"Affumicatura Polarizzata a Freddo Iperbarico\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica2:Tecnica {nome: \"Cottura a Vapore Ecodinamico Bilanciato\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 48 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (r:Ristorante)-[:SI_TROVA_SU]->(p:Pianeta {nome: \"Asgard\"}),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Essenza di Speziaria\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 49 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Pianeta {nome: \"Asgard\"})<-[:SI_TROVA_SU]-(r:Ristorante),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Pane di Luce\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 50 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Pianeta {nome: \"Krypton\"})<-[:SI_TROVA_SU]-(r:Ristorante),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: \"Cryo-Tessitura Energetica Polarizzata\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 51 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Pianeta {nome: \"Krypton\"})<-[:SI_TROVA_SU]-(r:Ristorante),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: \"Cottura Sottovuoto Bioma Sintetico\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 52 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante {nome: \"L'Etere del Gusto\"})-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: \"Decostruzione Atomica a Strati Energetici\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 53 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante {nome: \"Stelle dell'Infinito Celestiale\"})-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: \"Congelamento Bio-Luminiscente Sincronico\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 54 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante {nome: \"L'Universo in Cucina\"})-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Funghi Orbitali\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 55 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (r:Ristorante {nome: \"L'Oasi delle Dune Stellari\"})-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Lattuga Namecciana\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 56 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (chef:Chef)-[pl:POSSIEDE_LICENZA]->(licenza:Licenza),\n",
      "      (r:Ristorante)-[:GESTITO_DA]->(chef),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Spezie Melange\"})\n",
      "WHERE (licenza.sigla = \"LTK\" OR licenza.nome = \"LTK\") AND pl.grado >= \"7\"\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 57 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (chef:Chef)-[pl:POSSIEDE_LICENZA]->(licenza:Licenza),\n",
      "      (r:Ristorante)-[:GESTITO_DA]->(chef),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto),\n",
      "      (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Nduja Fritta Tanto\"})\n",
      "WHERE (licenza.sigla = \"Q\" OR licenza.nome = \"Q\") AND pl.grado = \"15\"\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 58 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (c:Chef)-[pl:POSSIEDE_LICENZA]->(l:Licenza),\n",
      "      (c)<-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: \"Cottura Idrodinamica Autoregolante\"})\n",
      "WHERE (l.sigla = \"t\" OR l.nome = \"t\") AND pl.grado = \"2\"\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 59 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (chef:Chef)-[pl:POSSIEDE_LICENZA]->(licenza:Licenza),\n",
      "      (r:Ristorante)-[:GESTITO_DA]->(chef),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Cottura Sottovuoto Multirealità Collassante\"})\n",
      "WHERE (licenza.nome = \"Luce\" OR licenza.sigla = \"Luce\") AND pl.grado = \"3\"\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 60 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante {nome: \"L'Essenza dell'Infinito\"})-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE ingrediente.nome IN [\"Fibra di Sintetex\", \"Essenza di Vuoto\"]\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 61 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante {nome: \"Le Dimensioni del Gusto\"})-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE ingrediente.nome IN [\"Petali di Eco\", \"Uova di Fenice\"]\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 62 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante {nome: \"L'Universo in Cucina\"})-[:OFFRE_IL_PIATTO]->(piatto:Piatto)\n",
      "OPTIONAL MATCH (piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Frammenti di Supernova\"})\n",
      "OPTIONAL MATCH (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Fermentazione Psionica Energetica\"})\n",
      "WHERE ingrediente IS NOT NULL OR tecnica IS NOT NULL\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 63 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante {nome: \"Cosmica Essenza\"})-[:OFFRE_IL_PIATTO]->(piatto:Piatto)\n",
      "MATCH (piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Funghi dell’Etere\"})\n",
      "OPTIONAL MATCH (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Marinatura Temporale Sincronizzata\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 64 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (r:Ristorante)-[:SI_TROVA_SU]->(:Pianeta {nome: \"Klyntar\"}),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE ingrediente.nome IN [\"Alghe Bioluminescenti\", \"Amido di Stellarion\"]\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 65 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante)-[:SI_TROVA_SU]->(p:Pianeta {nome: \"Asgard\"}),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE ingrediente.nome IN [\"Essenza di Vuoto\", \"Carne di Xenodonte\"]\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 66 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante)-[:SI_TROVA_SU]->(:Pianeta {nome: \"Pandora\"}),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE tecnica.nome IN [\"Surgelamento Antimaterico a Risonanza Inversa\", \"Cottura a Vapore con Flusso di Particelle Isoarmoniche\"]\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 67 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Pianeta {nome: \"Namecc\"})<-[:SI_TROVA_SU]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica)\n",
      "WHERE t.nome IN [\"Grigliatura Plasma Sintetico Risonante\", \"Affumicatura Polarizzata a Freddo Iperbarico\"]\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 68 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)<-[:OFFRE_IL_PIATTO]-(r:Ristorante)-[:GESTITO_DA]->(chef:Chef)-[:POSSIEDE_LICENZA]->(licenza:Licenza),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente:Ingrediente),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE (licenza.sigla = \"P\" OR licenza.nome = \"P\") AND licenza.grado >= \"5\"\n",
      "  AND (ingrediente.nome = \"Teste di Idra\" OR tecnica.nome = \"Bollitura Entropica Sincronizzata\")\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 69 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (chef:Chef)-[pl:POSSIEDE_LICENZA]->(lic:Licenza),\n",
      "      (r:Ristorante)-[:GESTITO_DA]->(chef),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)\n",
      "WHERE (lic.sigla = \"LTK\" OR lic.nome = \"LTK\") AND pl.grado >= \"6\"\n",
      "MATCH (piatto)-[:CONTIENE]->(ing:Ingrediente {nome: \"Polvere di Pulsar\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "UNION\n",
      "MATCH (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tec:Tecnica {nome: \"Cottura al Forno con Paradosso Temporale Cronospeculare\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 70 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (chef:Chef)-[pl:POSSIEDE_LICENZA]->(licenza:Licenza),\n",
      "      (r:Ristorante)-[:GESTITO_DA]->(chef),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE (licenza.sigla = \"Q\" OR licenza.nome = \"Q\") AND pl.grado >= \"9\"\n",
      "      AND (tecnica.nome = \"Affumicatura Psionica Sensoriale\" OR tecnica.nome = \"Cottura Sottovuoto Multirealità Collassante\")\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 71 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (c:Chef)-[:POSSIEDE_LICENZA]->(l:Licenza),\n",
      "      (c)<-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica)\n",
      "WHERE (l.sigla = \"Mx\" OR l.nome = \"Mx\") AND l.grado = \"1\" AND \n",
      "      (t.nome = \"Congelazione Iperdimensionalmente Stratificata\" OR t.nome = \"Cristallizzazione Temporale Reversiva\")\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 72 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE ingrediente.nome IN [\"Spore Quantiche\", \"Latte+\", \"Radici di Singolarità\"]\n",
      "WITH piatto, COUNT(DISTINCT ingrediente) AS ingredientCount\n",
      "WHERE ingredientCount >= 2\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 73 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE ingrediente.nome IN [\"Ravioli al Vaporeon\", \"Spaghi del Sole\", \"Nettare di Sirena\"]\n",
      "WITH piatto, COUNT(DISTINCT ingrediente) AS ingredientCount\n",
      "WHERE ingredientCount >= 2\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 74 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE ingrediente.nome IN [\"Polvere di Crononite\", \"Nduja Fritta Tanto\", \"Spezie di Melange\", \"Polvere di Stelle\"]\n",
      "WITH piatto, COUNT(DISTINCT ingrediente) AS ingredientCount\n",
      "WHERE ingredientCount >= 2\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 75 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE ingrediente.nome IN [\"Carne di Drago\", \"Chocobo Wings\", \"Foglie di Mandragora\", \"Burrobirra\"]\n",
      "WITH piatto, COUNT(DISTINCT ingrediente) AS ingredientCount\n",
      "WHERE ingredientCount >= 2\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 76 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Spaghi del Sole\"}),\n",
      "      (p)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: \"Surgelamento del di Sirius Cosmo\"})\n",
      "RETURN DISTINCT p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 77 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (t:Tecnica {nome: \"taglio\"}), \n",
      "      (p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t),\n",
      "      (p)-[:CONTIENE]->(:Ingrediente {nome: \"Fusilli del Vento\"})\n",
      "RETURN DISTINCT p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 78 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante)-[:SI_TROVA_SU]->(:Pianeta {nome: \"Asgard\"}),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Farina di Nettuno\"}),\n",
      "      (r)-[:GESTITO_DA]->(chef:Chef)-[pl:POSSIEDE_LICENZA]->(licenza:Licenza)\n",
      "WHERE pl.grado > 0 AND (licenza.nome = \"temporale\" OR licenza.sigla = \"temporale\")\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 79 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (r:Ristorante)-[:SI_TROVA_SU]->(p:Pianeta {nome: \"Asgard\"}),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Carne di Xenodonte\"}),\n",
      "      (r)-[:GESTITO_DA]->(chef:Chef)-[:POSSIEDE_LICENZA {grado: \"non base\"}]->(licenza:Licenza)\n",
      "WHERE licenza.nome = \"LTK\" OR licenza.sigla = \"LTK\"\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 80 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (pianeta:Pianeta {nome: \"Pandora\"})<-[:SI_TROVA_SU]-(ristorante:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Spore Quantiche\"}),\n",
      "      (ristorante)-[:GESTITO_DA]->(chef:Chef)-[:POSSIEDE_LICENZA {grado: \"2\"}]->(licenza:Licenza)\n",
      "WHERE licenza.sigla = \"P\" OR licenza.nome = \"P\"\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 81 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante)-[:SI_TROVA_SU]->(:Pianeta {nome: \"Arrakis\"}),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Riso di Cassandra\"}),\n",
      "      (r)-[:GESTITO_DA]->(chef:Chef)-[:POSSIEDE_LICENZA]->(licenza:Licenza)\n",
      "WHERE (licenza.nome = \"e+\" OR licenza.sigla = \"e+\") AND licenza.grado >= 1\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 82 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (t1:Tecnica {nome: \"taglio\"}), (t2:Tecnica {nome: \"surgelamento\"}),\n",
      "      (p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t1),\n",
      "      (p)-[:REALIZZATO_CON_LA_TECNICA]->(t2),\n",
      "      (p)-[:CONTIENE]->(i:Ingrediente)\n",
      "WHERE NOT i.nome = \"Polvere di Crononite\"\n",
      "RETURN DISTINCT p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 83 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica1:Tecnica {nome: \"impasto\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica2:Tecnica {nome: \"taglio\"})\n",
      "WHERE NOT EXISTS {\n",
      "  MATCH (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Shard di Prisma Stellare\"})\n",
      "}\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 84 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"taglio\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE NOT ingrediente.nome = \"Fusilli del Vento\"\n",
      "MATCH (chef:Chef)-[:POSSIEDE_LICENZA]->(licenza:Licenza)\n",
      "WHERE (licenza.nome = \"Manuale di Cucina di Sirius Cosmo\" OR licenza.sigla = \"t\") AND licenza.grado <> \"base\"\n",
      "MATCH (r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto)\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 85 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante)-[:GESTITO_DA]->(c:Chef)-[:POSSIEDE_LICENZA]->(l:Licenza),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: \"surgelamento\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE c.nome = \"Sirius Cosmo\" \n",
      "  AND l.grado <> \"base\" \n",
      "  AND NOT ingrediente.nome = \"Melange\"\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 86 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (t:Tecnica {nome: \"taglio del di Sirius Cosmo\"})<-[:REALIZZATO_CON_LA_TECNICA]-(piatto:Piatto),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE NOT ingrediente.nome = \"Gnocchi del Crepuscolo\"\n",
      "MATCH (r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto),\n",
      "      (r)-[:GESTITO_DA]->(chef:Chef),\n",
      "      (chef)-[licenzaRel:POSSIEDE_LICENZA]->(licenza:Licenza)\n",
      "WHERE (licenza.nome = \"G\" OR licenza.sigla = \"G\") AND licenzaRel.grado >= \"2\"\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 87 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica),\n",
      "      (r)-[:GESTITO_DA]->(chef:Chef)-[:POSSIEDE_LICENZA {grado: \"2\"}]->(licenza:Licenza),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE (tecnica.nome CONTAINS \"taglio\") \n",
      "  AND (licenza.sigla = \"G\" OR licenza.nome = \"G\")\n",
      "  AND NOT ingrediente.nome = \"Farina di Nettuno\"\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 88 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p1:Pianeta {nome: \"Namecc\"})-[rel:HA_DISTANZA_ANNI_LUCE]->(p2:Pianeta),\n",
      "      (r:Ristorante)-[:SI_TROVA_SU]->(p2),\n",
      "      (r)-[:GESTITO_DA]->(c:Chef)-[pl:POSSIEDE_LICENZA]->(l:Licenza),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)\n",
      "WHERE rel.distanza <= 659 AND toInteger(pl.grado) >= 3\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 89 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p1:Pianeta {nome: \"Arrakis\"})-[rel:HA_DISTANZA_ANNI_LUCE]->(p2:Pianeta),\n",
      "      (r:Ristorante)-[:SI_TROVA_SU]->(p2),\n",
      "      (r)-[:GESTITO_DA]->(c:Chef)-[pl:POSSIEDE_LICENZA]->(l:Licenza),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)\n",
      "WHERE (p1 = p2 OR rel.distanza <= 176) AND l.sigla = \"Psionica\" AND pl.grado >= \"4\"\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 90 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p1:Pianeta {nome: \"Krypton\"})-[rel:HA_DISTANZA_ANNI_LUCE]->(p2:Pianeta),\n",
      "      (r:Ristorante)-[:SI_TROVA_SU]->(p2),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"surgelamento\"}),\n",
      "      (r)-[:GESTITO_DA]->(chef:Chef {nome: \"Sirius Cosmo\"})\n",
      "WHERE rel.distanza <= 317 OR p2.nome = \"Krypton\"\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 91 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p1:Pianeta {nome: \"Krypton\"})-[rel:HA_DISTANZA_ANNI_LUCE]->(p2:Pianeta),\n",
      "      (r:Ristorante)-[:SI_TROVA_SU]->(p2),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"impasto del di Sirius Cosmo\"})\n",
      "WHERE rel.distanza <= 21\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 92 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p1:Pianeta {nome: \"Cybertron\"})-[rel:HA_DISTANZA_ANNI_LUCE]->(p2:Pianeta),\n",
      "      (r:Ristorante)-[:SI_TROVA_SU]->(p2),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)\n",
      "WHERE rel.distanza <= 126\n",
      "AND NOT EXISTS {\n",
      "  MATCH (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Funghi dell'Etere\"})\n",
      "}\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 93 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p1:Pianeta {nome: \"Cybertron\"})-[rel:HA_DISTANZA_ANNI_LUCE]->(p2:Pianeta),\n",
      "      (r:Ristorante)-[:SI_TROVA_SU]->(p2),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)\n",
      "WHERE rel.distanza <= 83\n",
      "AND NOT EXISTS {\n",
      "  MATCH (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Farina di Nettuno\"})\n",
      "}\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 94 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (c:Chef)-[pl:POSSIEDE_LICENZA]->(l:Licenza),\n",
      "      (r:Ristorante)-[:GESTITO_DA]->(c),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(p:Piatto)\n",
      "WHERE l.nome = \"Ordine degli Armonisti\" OR l.sigla = \"Ordine degli Armonisti\"\n",
      "RETURN DISTINCT p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 95 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (licenza:Licenza)\n",
      "WHERE licenza.nome = \"Ordine della Galassia di Andromeda\" OR licenza.sigla = \"Ordine della Galassia di Andromeda\"\n",
      "MATCH (chef:Chef)-[:POSSIEDE_LICENZA]->(licenza),\n",
      "      (r:Ristorante)-[:GESTITO_DA]->(chef),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 96 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente {nome: \"Essenza di Tachioni\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Cottura a Vapore Ecodinamico Bilanciato\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 97 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente {nome: \"Petali di Eco\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente {nome: \"Foglie di Mandragora\"})\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 98 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Fusilli del Vento\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Marinatura a Infusione Gravitazionale\"}),\n",
      "      (r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto),\n",
      "      (r)-[:GESTITO_DA]->(chef:Chef)-[:POSSIEDE_LICENZA]->(licenza:Licenza)\n",
      "WHERE licenza.nome = \"Codice di Galattico\" OR licenza.sigla = \"Codice di Galattico\"\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 99 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Teste di Idra\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Marinatura a Infusione Gravitazionale\"}),\n",
      "      (r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto),\n",
      "      (r)-[:GESTITO_DA]->(chef:Chef),\n",
      "      (chef)-[:POSSIEDE_LICENZA]->(licenza:Licenza)\n",
      "WHERE licenza.nome = \"Codice di Galattico\" OR licenza.sigla = \"Codice di Galattico\"\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 100 ok!\n"
     ]
    }
   ],
   "source": [
    "lista_risposte = {}\n",
    "\n",
    "with open('lista_risposte.txt', 'w') as file:\n",
    "    for indice, domanda in enumerate(lista_domande):\n",
    "        try:\n",
    "            answer = chain.invoke(domanda)\n",
    "            lista_piatti = []\n",
    "            for piatto in answer[\"result\"]:\n",
    "                lista_piatti.append(list(piatto.values())[0])\n",
    "            lista_risposte[indice+1] = lista_piatti\n",
    "            file.write(f\"{indice+1}: {lista_piatti}\\n\")\n",
    "            print(f\"domanda {indice+1} ok!\")\n",
    "        except:\n",
    "            lista_risposte[indice+1] = []\n",
    "            file.write(f\"{indice+1}: []\\n\")\n",
    "            print(f\"domanda {indice+1} in errore\")\n",
    "            pass\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "def answer_question(answers_txt_path: str='lista_risposte.txt') -> None:\n",
    "\n",
    "    chain_licenze = GraphCypherQAChain.from_llm(\n",
    "        llm, \n",
    "        graph=graph, \n",
    "        verbose=True, \n",
    "        allow_dangerous_requests=True, \n",
    "        cypher_prompt=PromptTemplate(input_variables=[\"schema\", \"question\"], template=CYPHER_GENERATION_TEMPLATE_LICENZE),\n",
    "        return_direct=True,\n",
    "        top_k=50,\n",
    "        validate_cypher=True\n",
    "    )\n",
    "\n",
    "    chain_licenze_fuzzy = GraphCypherQAChain.from_llm(\n",
    "        llm, \n",
    "        graph=graph, \n",
    "        verbose=True, \n",
    "        allow_dangerous_requests=True, \n",
    "        cypher_prompt=PromptTemplate(input_variables=[\"schema\", \"question\"], template=CYPHER_GENERATION_TEMPLATE_FUZZY),\n",
    "        return_direct=True,\n",
    "        top_k=50,\n",
    "        validate_cypher=True\n",
    "    )\n",
    "\n",
    "    lista_risposte = {}\n",
    "\n",
    "    with open(answers_txt_path, 'w') as file:\n",
    "        for indice, domanda in enumerate(lista_domande):\n",
    "            try:\n",
    "                answer = chain_licenze.invoke(domanda)\n",
    "            except:\n",
    "                answer = {\"result\":[]}\n",
    "            if not answer[\"result\"]:\n",
    "                try:\n",
    "                    answer = chain_licenze_fuzzy.invoke(domanda)\n",
    "                except:\n",
    "                    pass\n",
    "            lista_piatti = []\n",
    "            for piatto in answer[\"result\"]:\n",
    "                lista_piatti.append(list(piatto.values())[0])\n",
    "            lista_risposte[indice+1] = lista_piatti\n",
    "            file.write(f\"{indice+1}: {lista_risposte[indice+1]}\\n\")\n",
    "    return"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "answer_question(answers_txt_path='lista_risposte.txt')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (i:Ingrediente), (p:Piatto)-[:CONTIENE]->(i)\n",
      "WHERE toLower(i.nome) = toLower(\"Chocobo Wings\")\n",
      "RETURN DISTINCT p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 1 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE toLower(ingrediente.nome) = \"cioccorane\"\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 2 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(ingrediente.nome), \"latte+\") <= 1\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 3 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(ingrediente.nome), \"ravioli al vaporeon\") <= 2\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 4 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(ingrediente.nome), toLower(\"Sashimi di Magikarp\")) <= 2\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 5 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(ingrediente.nome), toLower(\"Frutti del Diavolo\")) <= 3\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 6 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE toLower(tecnica.nome) = \"grigliatura a energia stellare div\"\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 7 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE toLower(tecnica.nome) = toLower(\"Sferificazione a Gravità Psionica Variabile\")\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 8 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t1:Tecnica), \n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t2:Tecnica)\n",
      "WHERE toLower(t1.nome) = toLower(\"Marinatura Temporale Sincronizzata\") \n",
      "  AND toLower(t2.nome) = toLower(\"Congelamento Bio-Luminiscente Sincronico\")\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 9 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica1:Tecnica), \n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica2:Tecnica)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(tecnica1.nome), \"cottura olografica quantum fluttuante\") <= 2 \n",
      "  AND apoc.text.levenshteinDistance(toLower(tecnica2.nome), \"decostruzione interdimensionale lovecraftiana\") <= 2\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 10 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente), \n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(ingrediente1.nome), \"riso di cassandra\") <= 3 \n",
      "  AND apoc.text.levenshteinDistance(toLower(ingrediente2.nome), \"polvere di crononite\") <= 3\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 11 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente), \n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(ingrediente1.nome), \"shard di prisma stellare\") <= 3\n",
      "  AND apoc.text.levenshteinDistance(toLower(ingrediente2.nome), \"sale temporale\") <= 3\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 12 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(ingrediente.nome), \"teste di idra\") <= 2\n",
      "  AND apoc.text.levenshteinDistance(toLower(tecnica.nome), \"cottura sottovuoto multirealità collassante\") <= 2\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 13 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(tecnica.nome), toLower(\"Fermentazione Quantico Biometrica\")) <= 2\n",
      "  AND apoc.text.levenshteinDistance(toLower(ingrediente.nome), toLower(\"Erba Pipa\")) <= 2\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 14 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(tecnica.nome), toLower(\"Sferificazione Filamentare a Molecole Vibrazionali\")) = 0\n",
      "AND NOT (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica2:Tecnica)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(tecnica2.nome), toLower(\"Amalgamazione Sintetica Molecolare\")) = 0\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "domanda 15 in errore\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(tecnica.nome), toLower(\"Sferificazione Filamentare a Molecole Vibrazionali\")) <= 3\n",
      "AND NOT (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Decostruzione Magnetica Risonante\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 16 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(tecnica.nome), toLower(\"Sferificazione con Campi Magnetici Entropici\")) = 0\n",
      "  AND NOT apoc.text.levenshteinDistance(toLower(ingrediente.nome), toLower(\"Spezie Melange\")) = 0\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 17 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(tecnica.nome), toLower(\"Surgelamento Antimaterico a Risonanza Inversa\")) = 0\n",
      "  AND NOT apoc.text.levenshteinDistance(toLower(ingrediente.nome), toLower(\"Foglie di Mandragora\")) = 0\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 18 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente), \n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente), \n",
      "      (piatto)-[:CONTIENE]->(ingrediente3:Ingrediente)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(ingrediente1.nome), \"foglie di nebulosa\") <= 2\n",
      "  AND apoc.text.levenshteinDistance(toLower(ingrediente2.nome), \"amido di stellarion\") <= 2\n",
      "  AND apoc.text.levenshteinDistance(toLower(ingrediente3.nome), \"uova di fenice\") <= 2\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 19 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente), \n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente), \n",
      "      (piatto)-[:CONTIENE]->(ingrediente3:Ingrediente)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(ingrediente1.nome), \"carne di balena spaziale\") <= 2\n",
      "  AND apoc.text.levenshteinDistance(toLower(ingrediente2.nome), \"essenza di tachioni\") <= 2\n",
      "  AND apoc.text.levenshteinDistance(toLower(ingrediente3.nome), \"alghe bioluminescenti\") <= 2\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 20 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente), \n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente), \n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE toLower(ingrediente1.nome) = \"erba pipa\" \n",
      "  AND toLower(ingrediente2.nome) = \"funghi orbitali\" \n",
      "  AND toLower(tecnica.nome) = \"bollitura infrasonica armonizzata\"\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 21 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Pianeta)<-[:SI_TROVA_SU]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente1:Ingrediente),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente)\n",
      "WHERE toLower(tecnica.nome) = toLower(\"Cottura a Vapore con Flusso di Particelle Isoarmoniche\")\n",
      "  AND toLower(ingrediente1.nome) = toLower(\"Riso di Cassandra\")\n",
      "  AND toLower(ingrediente2.nome) = toLower(\"Foglie di Nebulosa\")\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 22 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente), \n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica1:Tecnica),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica2:Tecnica)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(ingrediente1.nome), \"carne di balena spaziale\") <= 2\n",
      "  AND apoc.text.levenshteinDistance(toLower(tecnica1.nome), \"bollitura entropica sincronizzata\") <= 2\n",
      "  AND apoc.text.levenshteinDistance(toLower(tecnica2.nome), \"affettamento a pulsazioni quantistiche\") <= 2\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 23 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica1:Tecnica),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica2:Tecnica)\n",
      "WHERE toLower(ingrediente.nome) = \"lacrime di unicorno\" \n",
      "  AND toLower(tecnica1.nome) = \"taglio sinaptico biomimetico\"\n",
      "  AND toLower(tecnica2.nome) = \"idro-cristallizzazione sonora quantistica\"\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 24 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica1:Tecnica), \n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica2:Tecnica)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(tecnica1.nome), \"cottura a vapore risonante simbiotico\") = 0 \n",
      "  AND apoc.text.levenshteinDistance(toLower(tecnica2.nome), \"doppia fermentazione quantico biometrica\") = 0\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 25 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica1:Tecnica), \n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica2:Tecnica)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(tecnica1.nome), \"taglio a risonanza sonica rigenerativa\") <= 3\n",
      "  AND apoc.text.levenshteinDistance(toLower(tecnica2.nome), \"doppia applicazione della cottura a vapore ecodinamico bilanciato\") <= 3\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 26 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente), \n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente)\n",
      "WHERE toLower(ingrediente1.nome) = toLower(\"Lattuga Namecciana\") \n",
      "  AND toLower(ingrediente2.nome) = toLower(\"Carne di Mucca\")\n",
      "  AND NOT EXISTS {\n",
      "    MATCH (piatto)-[:CONTIENE]->(ingrediente3:Ingrediente)\n",
      "    WHERE toLower(ingrediente3.nome) = toLower(\"Teste di Idra\")\n",
      "  }\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 27 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente), \n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(ingrediente1.nome), \"essenza di tachioni\") <= 2 \n",
      "  AND apoc.text.levenshteinDistance(toLower(ingrediente2.nome), \"carne di mucca\") <= 2\n",
      "  AND NOT (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"muffa lunare\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 28 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente), \n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE toLower(ingrediente1.nome) = \"funghi orbitali\" \n",
      "  AND toLower(tecnica.nome) = \"marinatura psionica\"\n",
      "  AND NOT EXISTS {\n",
      "    MATCH (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente)\n",
      "    WHERE toLower(ingrediente2.nome) = \"shard di materia oscura\"\n",
      "  }\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 29 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente {nome: \"Funghi dell’Etere\"}),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica {nome: \"Impasto Gravitazionale Vorticoso\"})\n",
      "WHERE NOT EXISTS {\n",
      "  MATCH (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Plasma Vitale\"})\n",
      "}\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 30 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente), \n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(ingrediente1.nome), \"funghi dell’etere\") <= 2 \n",
      "  AND apoc.text.levenshteinDistance(toLower(ingrediente2.nome), \"erba pipa\") <= 2\n",
      "  AND NOT apoc.text.levenshteinDistance(toLower(tecnica.nome), \"decostruzione magnetica risonante\") <= 2\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 31 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente), \n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(ingrediente1.nome), \"salsa szechuan\") <= 3\n",
      "  AND apoc.text.levenshteinDistance(toLower(ingrediente2.nome), \"granuli di nebbia arcobaleno\") <= 3\n",
      "  AND apoc.text.levenshteinDistance(toLower(tecnica.nome), \"affumicatura a stratificazione quantica\") > 3\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 32 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica1:Tecnica),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica2:Tecnica)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(ingrediente.nome), \"funghi orbitali\") > 0\n",
      "  AND apoc.text.levenshteinDistance(toLower(tecnica1.nome), \"affumicatura tramite big bang microcosmico\") = 0\n",
      "  AND apoc.text.levenshteinDistance(toLower(tecnica2.nome), \"affettamento a pulsazioni quantistiche\") = 0\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 33 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica1:Tecnica), \n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica2:Tecnica)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(tecnica1.nome), \"incisione elettromagnetica plasmica\") = 0 \n",
      "  AND apoc.text.levenshteinDistance(toLower(tecnica2.nome), \"bollitura entropica sincronizzata\") = 0\n",
      "  AND NOT EXISTS {\n",
      "    MATCH (piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "    WHERE apoc.text.levenshteinDistance(toLower(ingrediente.nome), \"cristalli di memoria\") = 0\n",
      "  }\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 34 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE toLower(ingrediente.nome) = \"polvere di crononite\" \n",
      "  AND toLower(tecnica.nome) = \"incisione elettromagnetica plasmica\"\n",
      "  AND NOT EXISTS {\n",
      "    MATCH (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica2:Tecnica)\n",
      "    WHERE toLower(tecnica2.nome) = \"decostruzione atomica a strati energetici\"\n",
      "  }\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 35 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(ingrediente.nome), \"alghe bioluminescenti\") <= 2\n",
      "  AND apoc.text.levenshteinDistance(toLower(tecnica.nome), \"idro-cristallizzazione sonora quantistica\") <= 2\n",
      "  AND NOT (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"marinatura temporale sincronizzata\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 36 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(tecnica.nome), toLower(\"Congelazione Iperdimensionalmente Stratificata\")) = 0\n",
      "   OR apoc.text.levenshteinDistance(toLower(tecnica.nome), toLower(\"Fermentazione Quantico Biometrica\")) = 0\n",
      "WITH piatto\n",
      "MATCH (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE NOT apoc.text.levenshteinDistance(toLower(tecnica.nome), toLower(\"Cottura a Vapore Termocinetica Multipla\")) = 0\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 37 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(tecnica.nome), \"fermentazione quantico biometrica\") > 0\n",
      "WITH piatto\n",
      "MATCH (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica1:Tecnica), (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica2:Tecnica)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(tecnica1.nome), \"affumicatura tramite big bang microcosmico\") = 0\n",
      "  AND apoc.text.levenshteinDistance(toLower(tecnica2.nome), \"cottura sottovuoto frugale energeticamente negativa\") = 0\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 38 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(tecnica.nome), toLower(\"Marinatura tramite Reazioni d'Antimateria Diluite\")) = 0\n",
      "AND NOT apoc.text.levenshteinDistance(toLower(ingrediente.nome), toLower(\"Cristalli di Nebulite\")) = 0\n",
      "AND NOT apoc.text.levenshteinDistance(toLower(ingrediente.nome), toLower(\"Funghi dell’Etere\")) = 0\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 39 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(tecnica.nome), toLower(\"Congelazione Iperdimensionalmente Stratificata\")) <= 3\n",
      "AND NOT (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Fibra di Sintetex\"})\n",
      "AND NOT (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Funghi Orbitali\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 40 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(tecnica.nome), toLower(\"Grigliatura Psionica Dinamica Ritmica\")) <= 3\n",
      "AND NOT (piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Pane degli Abissi\"})\n",
      "AND NOT (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Cottura Olografica Quantum Fluttuante\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 41 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE toLower(tecnica.nome) = toLower(\"Taglio Sinaptico Biomimetico\")\n",
      "  AND NOT toLower(ingrediente.nome) = toLower(\"Lattuga Namecciana\")\n",
      "  AND NOT (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Cottura Sottovuoto Bioma Sintetico\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 42 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(tecnica.nome), \"decostruzione ancestrale\") = 0\n",
      "AND NOT (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica WHERE apoc.text.levenshteinDistance(toLower(nome), \"cottura a vapore termocinetica multipla\") = 0)\n",
      "AND NOT (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica WHERE apoc.text.levenshteinDistance(toLower(nome), \"marinatura a infusione gravitazionale\") = 0)\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "domanda 43 in errore\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(tecnica.nome), \"affumicatura polarizzata a freddo iperbarico\") = 0\n",
      "AND NOT (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"fermentazione psionica energetica\"})\n",
      "AND NOT (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"congelamento bio-luminiscente sincronico\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 44 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE toLower(ingrediente.nome) IN [\"carne di balena spaziale\", \"teste di idra\", \"spaghi del sole\", \"carne di xenodonte\"]\n",
      "WITH piatto, COUNT(DISTINCT ingrediente) AS ingredientCount\n",
      "WHERE ingredientCount = 4\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 45 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente {nome: \"cristalli di memoria\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente {nome: \"essenza di tachioni\"}),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente3:Ingrediente {nome: \"carne di kraken\"})\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 46 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(ingrediente.nome), toLower(\"Vero Ghiaccio\")) <= 2\n",
      "  AND (apoc.text.levenshteinDistance(toLower(tecnica.nome), toLower(\"Cottura Sottovuoto Frugale Energeticamente Negativa\")) <= 2\n",
      "       OR apoc.text.levenshteinDistance(toLower(tecnica.nome), toLower(\"Cottura Sottovuoto Bioma Sintetico\")) <= 2)\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 47 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (piatto:Piatto)-[:CONTIENE]->(ingrediente1:Ingrediente), \n",
      "      (piatto)-[:CONTIENE]->(ingrediente2:Ingrediente),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica1:Tecnica),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica2:Tecnica)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(ingrediente1.nome), \"shard di materia oscura\") <= 2\n",
      "  AND apoc.text.levenshteinDistance(toLower(ingrediente2.nome), \"uova di fenice\") <= 2\n",
      "  AND apoc.text.levenshteinDistance(toLower(tecnica1.nome), \"affumicatura polarizzata a freddo iperbarico\") <= 2\n",
      "  AND apoc.text.levenshteinDistance(toLower(tecnica2.nome), \"cottura a vapore ecodinamico bilanciato\") <= 2\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 48 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante)-[:SI_TROVA_SU]->(p:Pianeta {nome: \"Asgard\"}),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(ingrediente.nome), toLower(\"Essenza di Speziaria\")) <= 2\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 49 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante)-[:SI_TROVA_SU]->(p:Pianeta {nome: \"Asgard\"}),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE toLower(ingrediente.nome) = toLower(\"Pane di Luce\")\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 50 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Pianeta {nome: \"Krypton\"}),\n",
      "      (r:Ristorante)-[:SI_TROVA_SU]->(p),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica)\n",
      "WHERE toLower(t.nome) = toLower(\"Cryo-Tessitura Energetica Polarizzata\")\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 51 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante)-[:SI_TROVA_SU]->(p:Pianeta {nome: \"Krypton\"}),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica)\n",
      "WHERE toLower(t.nome) = toLower(\"Cottura Sottovuoto Bioma Sintetico\")\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 52 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante), (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(r.nome), toLower(\"L'Etere del Gusto\")) <= 2\n",
      "  AND apoc.text.levenshteinDistance(toLower(tecnica.nome), toLower(\"Decostruzione Atomica a Strati Energetici\")) <= 2\n",
      "  AND (r)-[:OFFRE_IL_PIATTO]->(piatto)\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 53 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante), (t:Tecnica), (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(r.nome), toLower(\"Stelle dell'Infinito Celestiale\")) <= 2\n",
      "  AND apoc.text.levenshteinDistance(toLower(t.nome), toLower(\"Congelamento Bio-Luminiscente Sincronico\")) <= 2\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 54 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante), (piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(r.nome), toLower(\"L'Universo in Cucina\")) <= 2\n",
      "  AND apoc.text.levenshteinDistance(toLower(ingrediente.nome), toLower(\"Funghi Orbitali\")) <= 2\n",
      "  AND (r)-[:OFFRE_IL_PIATTO]->(piatto)\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 55 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE toLower(r.nome) = toLower(\"L'Oasi delle Dune Stellari\") AND apoc.text.levenshteinDistance(toLower(ingrediente.nome), toLower(\"Lattuga Namecciana\")) <= 2\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 56 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: licenza)} {position: line: 4, column: 7, offset: 210} for query: 'cypher\\nMATCH (c:Chef)-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(i:Ingrediente)\\nWHERE apoc.text.levenshteinSimilarity(toLower(i.nome), toLower(\"Spezie Melange\")) > 0.8\\nAND c.licenza = \"LTK\" AND c.grado >= 7\\nRETURN DISTINCT piatto.nome\\n'\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: grado)} {position: line: 4, column: 29, offset: 232} for query: 'cypher\\nMATCH (c:Chef)-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(i:Ingrediente)\\nWHERE apoc.text.levenshteinSimilarity(toLower(i.nome), toLower(\"Spezie Melange\")) > 0.8\\nAND c.licenza = \"LTK\" AND c.grado >= 7\\nRETURN DISTINCT piatto.nome\\n'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (c:Chef)-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(i:Ingrediente)\n",
      "WHERE apoc.text.levenshteinSimilarity(toLower(i.nome), toLower(\"Spezie Melange\")) > 0.8\n",
      "AND c.licenza = \"LTK\" AND c.grado >= 7\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 57 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (chef:Chef)-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE toLower(chef.nome) CONTAINS \"licenza q di grado 15\"\n",
      "  AND apoc.text.levenshteinDistance(toLower(ingrediente.nome), toLower(\"Nduja Fritta Tanto\")) <= 3\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 58 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: licenza)} {position: line: 5, column: 68, offset: 220} for query: 'cypher\\nMATCH (c:Chef), \\n      (r:Ristorante)-[:GESTITO_DA]->(c),\\n      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica)\\nWHERE toLower(t.nome) = \"cottura idrodinamica autoregolante\" AND c.licenza = \"t\" AND c.grado = 2\\nRETURN DISTINCT piatto.nome\\n'\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: grado)} {position: line: 5, column: 88, offset: 240} for query: 'cypher\\nMATCH (c:Chef), \\n      (r:Ristorante)-[:GESTITO_DA]->(c),\\n      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica)\\nWHERE toLower(t.nome) = \"cottura idrodinamica autoregolante\" AND c.licenza = \"t\" AND c.grado = 2\\nRETURN DISTINCT piatto.nome\\n'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (c:Chef), \n",
      "      (r:Ristorante)-[:GESTITO_DA]->(c),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica)\n",
      "WHERE toLower(t.nome) = \"cottura idrodinamica autoregolante\" AND c.licenza = \"t\" AND c.grado = 2\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 59 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: licenze)} {position: line: 3, column: 25, offset: 240} for query: 'MATCH (chef:Chef)-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\\nWHERE toLower(tecnica.nome) = toLower(\"Cottura Sottovuoto Multirealità Collassante\")\\nAND any(licenza IN chef.licenze WHERE licenza.grado >= 3 AND toLower(licenza.tipo) = toLower(\"Luce\"))\\nRETURN DISTINCT piatto.nome'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (chef:Chef)-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE toLower(tecnica.nome) = toLower(\"Cottura Sottovuoto Multirealità Collassante\")\n",
      "AND any(licenza IN chef.licenze WHERE licenza.grado >= 3 AND toLower(licenza.tipo) = toLower(\"Luce\"))\n",
      "RETURN DISTINCT piatto.nome\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 60 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE apoc.text.levenshteinSimilarity(toLower(r.nome), toLower(\"L'Essenza dell'Infinito\")) > 0.8\n",
      "  AND (apoc.text.levenshteinSimilarity(toLower(ingrediente.nome), toLower(\"Fibra di Sintetex\")) > 0.8 \n",
      "       OR apoc.text.levenshteinSimilarity(toLower(ingrediente.nome), toLower(\"Essenza di Vuoto\")) > 0.8)\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 61 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante), \n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto),\n",
      "      (piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(r.nome), toLower(\"Le Dimensioni del Gusto\")) <= 2\n",
      "  AND (apoc.text.levenshteinDistance(toLower(ingrediente.nome), toLower(\"Petali di Eco\")) <= 2 \n",
      "       OR apoc.text.levenshteinDistance(toLower(ingrediente.nome), toLower(\"Uova di Fenice\")) <= 2)\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 62 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "domanda 63 in errore\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante), (piatto:Piatto)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(r.nome), toLower(\"Cosmica Essenza\")) <= 2\n",
      "AND ( (piatto)-[:CONTIENE]->(ingrediente:Ingrediente) WHERE apoc.text.levenshteinDistance(toLower(ingrediente.nome), toLower(\"Funghi dell’Etere\")) <= 2\n",
      "OR (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica) WHERE apoc.text.levenshteinDistance(toLower(tecnica.nome), toLower(\"Marinatura Temporale Sincronizzata\")) <= 2 )\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "domanda 64 in errore\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante)-[:SI_TROVA_SU]->(p:Pianeta {nome: \"Klyntar\"}),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE toLower(ingrediente.nome) = \"alghe bioluminescenti\" OR toLower(ingrediente.nome) = \"amido di stellarion\"\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 65 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante)-[:SI_TROVA_SU]->(p:Pianeta {nome: \"Asgard\"}),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE toLower(ingrediente.nome) IN [\"essenza di vuoto\", \"carne di xenodonte\"]\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 66 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Pianeta {nome: \"Pandora\"})<-[:SI_TROVA_SU]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica)\n",
      "WHERE (apoc.text.levenshteinDistance(toLower(t.nome), toLower(\"Surgelamento Antimaterico a Risonanza Inversa\")) <= 3 OR \n",
      "       apoc.text.levenshteinDistance(toLower(t.nome), toLower(\"Cottura a Vapore con Flusso di Particelle Isoarmoniche\")) <= 3)\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 67 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Pianeta {nome: \"Namecc\"})<-[:SI_TROVA_SU]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica)\n",
      "WHERE toLower(t.nome) = \"grigliatura plasma sintetico risonante\" OR toLower(t.nome) = \"affumicatura polarizzata a freddo iperbarico\"\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 68 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: licenza_grado)} {position: line: 4, column: 9, offset: 107} for query: 'cypher\\nMATCH (r:Ristorante)-[:GESTITO_DA]->(c:Chef),\\n      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)\\nWHERE c.licenza_grado >= 5\\nMATCH (piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\\nWHERE apoc.text.levenshteinDistance(toLower(ingrediente.nome), \"teste di idra\") <= 2\\nRETURN DISTINCT piatto.nome\\nUNION\\nMATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\\nWHERE apoc.text.levenshteinDistance(toLower(tecnica.nome), \"bollitura entropica sincronizzata\") <= 2\\nRETURN DISTINCT piatto.nome\\n'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante)-[:GESTITO_DA]->(c:Chef),\n",
      "      (r)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)\n",
      "WHERE c.licenza_grado >= 5\n",
      "MATCH (piatto)-[:CONTIENE]->(ingrediente:Ingrediente)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(ingrediente.nome), \"teste di idra\") <= 2\n",
      "RETURN DISTINCT piatto.nome\n",
      "UNION\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(tecnica.nome), \"bollitura entropica sincronizzata\") <= 2\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 69 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: grado)} {position: line: 3, column: 31, offset: 117} for query: 'cypher\\nMATCH (c:Chef)-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)\\nWHERE c.licenza = \"LTK\" AND c.grado >= 6\\nMATCH (piatto)-[:CONTIENE]->(i:Ingrediente)\\nWHERE apoc.text.levenshteinDistance(toLower(i.nome), toLower(\"Polvere di Pulsar\")) <= 2\\nRETURN DISTINCT piatto.nome\\nUNION\\nMATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica)\\nWHERE apoc.text.levenshteinDistance(toLower(t.nome), toLower(\"Cottura al Forno con Paradosso Temporale Cronospeculare\")) <= 2\\nRETURN DISTINCT piatto.nome\\n'\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: licenza)} {position: line: 3, column: 9, offset: 95} for query: 'cypher\\nMATCH (c:Chef)-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)\\nWHERE c.licenza = \"LTK\" AND c.grado >= 6\\nMATCH (piatto)-[:CONTIENE]->(i:Ingrediente)\\nWHERE apoc.text.levenshteinDistance(toLower(i.nome), toLower(\"Polvere di Pulsar\")) <= 2\\nRETURN DISTINCT piatto.nome\\nUNION\\nMATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica)\\nWHERE apoc.text.levenshteinDistance(toLower(t.nome), toLower(\"Cottura al Forno con Paradosso Temporale Cronospeculare\")) <= 2\\nRETURN DISTINCT piatto.nome\\n'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (c:Chef)-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto)\n",
      "WHERE c.licenza = \"LTK\" AND c.grado >= 6\n",
      "MATCH (piatto)-[:CONTIENE]->(i:Ingrediente)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(i.nome), toLower(\"Polvere di Pulsar\")) <= 2\n",
      "RETURN DISTINCT piatto.nome\n",
      "UNION\n",
      "MATCH (piatto:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica)\n",
      "WHERE apoc.text.levenshteinDistance(toLower(t.nome), toLower(\"Cottura al Forno con Paradosso Temporale Cronospeculare\")) <= 2\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 70 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (chef:Chef)-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(piatto:Piatto),\n",
      "      (piatto)-[:REALIZZATO_CON_LA_TECNICA]->(tecnica:Tecnica)\n",
      "WHERE (apoc.text.levenshteinDistance(toLower(tecnica.nome), \"affumicatura psionica sensoriale\") <= 3 OR \n",
      "       apoc.text.levenshteinDistance(toLower(tecnica.nome), \"cottura sottovuoto multirealità collassante\") <= 3)\n",
      "RETURN DISTINCT piatto.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "domanda 71 ok!\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n"
     ]
    }
   ],
   "source": [
    "lista_risposte = {}\n",
    "\n",
    "for indice, domanda in enumerate(lista_domande):\n",
    "    try:\n",
    "        answer = chain.invoke(domanda)\n",
    "        lista_piatti = []\n",
    "        for piatto in answer[\"result\"]:\n",
    "            lista_piatti.append(list(piatto.values())[0])\n",
    "        lista_risposte[indice+1] = lista_piatti\n",
    "        print(f\"domanda {indice+1} ok!\")\n",
    "    except:\n",
    "        lista_risposte[indice+1] = []\n",
    "        print(f\"domanda {indice+1} in errore\")\n",
    "        pass\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{1: ['Galassia di Sapori: Il Viaggio Senza Tempo'],\n",
       " 2: ['Sinfonia Cosmica: Versione Pizza'],\n",
       " 3: [\"Pizza Cosmica all'Essenza di Drago con Nebbia Arcobaleno e Funghi Orbitali\"],\n",
       " 4: ['Sinfonia Cosmica di Sapore'],\n",
       " 5: [],\n",
       " 6: ['Rinascita Cosmica'],\n",
       " 7: ['Portale del Cosmo: Sinfonia di Sapori Multidimensionali',\n",
       "  'Stella Nova',\n",
       "  'Rivisitazione del Kraken sotto Molecole'],\n",
       " 8: ['Cosmic Synchrony: Il Destino di Pulsar',\n",
       "  'Nebulosa Galattica',\n",
       "  'Cosmic Serenade',\n",
       "  'Aurora del Cosmo',\n",
       "  'Sinfonia Cosmica di Andromeda',\n",
       "  'Fusione Celeste'],\n",
       " 9: ['Galassia di Sapori Sublimi', 'Sinfonia Cosmica del Multiverso'],\n",
       " 10: [\"La Mucca Che Stordisce l'Universo\", 'Sogni di Abisso Cosmico'],\n",
       " 11: ['Il Viaggio delle Dimensioni Confluenti'],\n",
       " 12: ['Sinfonia Quantistica delle Stelle', 'Risveglio Cosmico'],\n",
       " 13: ['Nebulare Asteroideo con Crepuscolo di Mucca'],\n",
       " 14: ['Galassia di Sogni Cosmogastronomici', 'Il Viaggio Celeste'],\n",
       " 15: ['Tris di Carne con Pane',\n",
       "  'Panetto di Carne',\n",
       "  'Pizza Gio',\n",
       "  'Eclissi Quantica: Viaggio nei Reami del Gusto',\n",
       "  'Cosmic Harmony Infusion',\n",
       "  'Nebulare Asteroideo con Crepuscolo di Mucca',\n",
       "  'Viaggio Cosmico nel Multiverso',\n",
       "  'Serenata del Multiverso'],\n",
       " 16: ['Panetto di Carne',\n",
       "  'Pizza Gio',\n",
       "  'Eclissi Quantica: Viaggio nei Reami del Gusto',\n",
       "  'Cosmic Harmony Infusion',\n",
       "  'Nebulare Asteroideo con Crepuscolo di Mucca',\n",
       "  'Viaggio Cosmico nel Multiverso',\n",
       "  'Sinfonia Cosmica di Terracotta',\n",
       "  'Serenata del Multiverso'],\n",
       " 17: ['Sassi e Sassolini',\n",
       "  'La Balena Sputafuoco',\n",
       "  'Sinfonia di Gusti del Multiverso',\n",
       "  'Universo in Un Boccone',\n",
       "  'Pizza Cri',\n",
       "  'Portale Interdimensionale di Sapori',\n",
       "  'Cosmo Sferico di Sogni Rigenerativi',\n",
       "  'Sinfonia Cosmica in Otto Movimenti',\n",
       "  'Sinfonia Cosmica di Sapore'],\n",
       " 18: ['Nebulosa di Confini Sfondati',\n",
       "  'Nebulosa Celestiale di Sogni Quantici',\n",
       "  'Ecosistema Celeste',\n",
       "  'Portale Interdimensionale di Sapori',\n",
       "  'Euforia Cosmica',\n",
       "  'Galaxia Rinasciata'],\n",
       " 19: [],\n",
       " 20: [\"Il Viaggio dell'Etereo Risveglio\", 'Galassia Commovente di Stellari'],\n",
       " 21: ['Portale Cosmico del Kraken', 'Sinfonia Tempolare Galattica'],\n",
       " 22: ['Galassia di Sapori Eterei'],\n",
       " 23: ['Piccola Odissea Cosmica'],\n",
       " 24: ['Luce e Ombra di Nomea Spaziale'],\n",
       " 25: [],\n",
       " 26: [\"Sinfonia Cosmica all'Alba di Fenice\"],\n",
       " 27: ['Il Banchetto delle Galassie',\n",
       "  'Cosmofantasia di Terra e Mare nel Vortice delle Stelle',\n",
       "  \"La Mucca Che Stordisce l'Universo\",\n",
       "  'Cosmos Culinary Symphony',\n",
       "  'Sinfonia Temporale al Tocco di Crono',\n",
       "  'Risveglio Cosmico: Una Sinfonia di Sapori Universali'],\n",
       " 28: ['Cosmofantasia di Terra e Mare nel Vortice delle Stelle',\n",
       "  \"Sinfonia Cosmica all'Alba di Fenice\",\n",
       "  'Odissea Temporale',\n",
       "  'Il Risveglio del Drago Celeste',\n",
       "  'Sinfonia Temporale al Tocco di Crono',\n",
       "  'Galassia Suprema'],\n",
       " 29: ['Sinfonia Galattica di Sapori con Sorpresa di Drago Fiammante'],\n",
       " 30: [\"Sinfonia Cosmica all'Alba di Fenice\",\n",
       "  'Sassi e Sassolini',\n",
       "  'La Balena Sputafuoco',\n",
       "  \"L'Eternità al Crepuscolo\",\n",
       "  'Rintocchi del Cosmo',\n",
       "  'Galassia di Sapori di Aurora'],\n",
       " 31: ['Porta Celestiale alle Stelle', 'Sinfonia Cosmica ma Fatta Male'],\n",
       " 32: ['Sinfonia Cosmica alla Szechuan',\n",
       "  'Nebulosa Celestiale di Sogni Quantici',\n",
       "  'Nebulae Di-Cedri Risvegliati'],\n",
       " 33: [],\n",
       " 34: ['Universo Cosmico nel Piatto'],\n",
       " 35: ['Melodia del Multiverso Parallelo', 'Sinfonia Cosmica di Terracotta'],\n",
       " 36: ['Galassia di Sapore Quantum',\n",
       "  'Universo in Un Boccone',\n",
       "  'Sinfonia Temporale nello Spaghi del Sole'],\n",
       " 37: ['Nebulose della Fenice su Vento Lunare'],\n",
       " 38: ['Rivelazione del Multiverso'],\n",
       " 39: ['Sinfonia Temporale nello Spaghi del Sole',\n",
       "  'Etereo Crepuscolare',\n",
       "  'Il Risveglio delle Stelle',\n",
       "  'Galassie Infiammate: Sinfonia Cosmica in Sei Dimensioni',\n",
       "  'Astro-Risotto alle Onde Temporali'],\n",
       " 40: ['Fenice Galattica',\n",
       "  'Eterea Sinfonia di Gravità',\n",
       "  'Pizza Baby Daniele',\n",
       "  'Pizza Cri',\n",
       "  'Pizza Emma',\n",
       "  'Sinfonia Astrale - Risotto Multiversale con Risacca Celeste',\n",
       "  \"Fenice sull'Orizzonte degli Eventi\",\n",
       "  'Sinfonia Interstellare di Fusilli del Vento con Nettare di Sirena',\n",
       "  'Nebulose della Fenice su Vento Lunare'],\n",
       " 41: ['Sinfonia Celestiale',\n",
       "  'Serenata del Multiverso',\n",
       "  \"Galassia Incantata: Un Viaggio Attraverso l'Infinito\",\n",
       "  'Risveglio Cosmico: Una Sinfonia di Sapori Universali'],\n",
       " 42: ['Luce e Ombra di Nomea Spaziale',\n",
       "  \"Falso Risotto dell'Infinito Multiverso\",\n",
       "  'Rinascita Cosmica'],\n",
       " 43: ['Sinfonia Cosmica del Multiverso',\n",
       "  'Ecosistema Celeste',\n",
       "  'Universo in Fusilli - Variazione Celestiale',\n",
       "  'Mycoflora con Polvere di Stelle Sbagliato',\n",
       "  'Sinfonia di Stagioni Stellari',\n",
       "  'Galassia Risvegliata'],\n",
       " 44: ['Panetto di Carne',\n",
       "  'Galassia Speculare',\n",
       "  'Ode al Crepuscolo del Multiverso',\n",
       "  'Viaggio Cosmico nel Multiverso',\n",
       "  'Portale Cosmico: Sinfonia di Gnocchi del Crepuscolo con Essenza di Tachioni e Sfumature di Fenice'],\n",
       " 45: [\"Galassie in Epifania: Risotto Celestiale con Preziosi dell'Universo\"],\n",
       " 46: ['Viaggio dei Sensi: Bolla Temporale di Aromi Ancestrali'],\n",
       " 47: ['Portale delle Meraviglie',\n",
       "  'Cosmos Culinary Symphony',\n",
       "  'Porta Celestiale alle Stelle'],\n",
       " 48: ['Portale Cosmico: Sinfonia di Gnocchi del Crepuscolo con Essenza di Tachioni e Sfumature di Fenice'],\n",
       " 49: ['Una Mucca e una Balena nella Singolarità', \"L'Ascensione Siderale\"],\n",
       " 50: ['Risotto Interdimensionale alla Carne di Drago e Balena Spaziale con Biscotti della Galassia Croccanti',\n",
       "  'Pane e Carne Rivisitato',\n",
       "  \"Fenice sull'Orizzonte degli Eventi\",\n",
       "  'Sinfonia Cosmica di Terre e Stelle',\n",
       "  'Quadrifonia Cosmica: Sinfonia di Sapori e Dimensioni'],\n",
       " 51: ['Sinfonia Galattica Agentica', 'Il Viaggio Cosmico di Marinetti'],\n",
       " 52: [],\n",
       " 53: [\"Sinfonia dell'Universo Morente\"],\n",
       " 54: ['Nebulosa di Confini Sfondati', 'Galassia Ardente'],\n",
       " 55: ['Stellar Fusion'],\n",
       " 56: ['Universo Cosmico nel Piatto', 'La Creazione di Nova'],\n",
       " 57: [],\n",
       " 58: [],\n",
       " 59: ['Sinfonia del Multiverso Calante',\n",
       "  'Eterna Sinfonia del Cosmo',\n",
       "  'Galassia Infinita: Viaggio tra Memorie e Stelle'],\n",
       " 60: ['Danza Cosmica al Crepuscolo',\n",
       "  'Sinfonia Astrale - Risotto Multiversale con Risacca Celeste',\n",
       "  'Universo in Fluttuazione',\n",
       "  'Nebulare Asteroideo con Crepuscolo di Mucca'],\n",
       " 61: ['Tris di Verdure con Xenodonte',\n",
       "  'Galassia di Sapori: Il Viaggio Senza Tempo',\n",
       "  'Il Rapsodo Celestiale'],\n",
       " 62: ['Galassia di Sapori di Aurora', 'Evanescenza Cosmica'],\n",
       " 63: ['Sogni di Abisso Cosmico',\n",
       "  'Portale delle Stelle',\n",
       "  'Stellar Fusion',\n",
       "  'Galassia di Sapori',\n",
       "  'Sinfonia Cosmica della Rinascita',\n",
       "  'Rivelazione del Multiverso',\n",
       "  \"Galassia di Sapori: L'Eterno Ritorno\",\n",
       "  'Galassia Aurorale',\n",
       "  'Galassia di Sapori Interstellari'],\n",
       " 64: [\"Sinfonia Celeste dell'Equilibrio Temporale\",\n",
       "  'Porta Celestiale alle Stelle'],\n",
       " 65: ['Galassia Aurorale',\n",
       "  'Galassia di Sapori Interstellari',\n",
       "  'Cosmic Rhapsody'],\n",
       " 66: [\"Plasma Celestiale al Risotto di Kraken nell'Aura del Sole\",\n",
       "  'Più-dimensionale Sinfonia di Sapori: La Carne del Cosmo',\n",
       "  'Sinfonia del Cosmo e della Leggenda',\n",
       "  'Risotto Cosmico Multiversale',\n",
       "  \"Fenice sull'Orizzonte degli Eventi\",\n",
       "  'Sinfonia Cosmica di Terre e Stelle'],\n",
       " 67: ['Abbraccio del Cosmo',\n",
       "  'Galassia di Sapori Eterei',\n",
       "  'Euforia Cosmica',\n",
       "  'Portale Cosmico: Sinfonia di Gnocchi del Crepuscolo con Essenza di Tachioni e Sfumature di Fenice',\n",
       "  'Sinfonia Cosmica: Versione Pizza',\n",
       "  'Nebulosa Celestiale alla Stellaris'],\n",
       " 68: ['Panetto di Carne', 'Galassia Ardente', 'Sassi e Sassolini'],\n",
       " 69: [],\n",
       " 70: ['Piccola Odissea Cosmica',\n",
       "  'Sinfonia Astrale - Risotto Multiversale con Risacca Celeste',\n",
       "  'Lumière Cosmica',\n",
       "  'Galassie Riflesse: Sinfonia del Multiverso',\n",
       "  'Eterea Sinfonia di Gravità',\n",
       "  'Sfogliare Galattico di Sogni Temporali',\n",
       "  'Galassia a Tavola: Sinfonia di Tempeste Cosmiche'],\n",
       " 71: [],\n",
       " 72: [],\n",
       " 73: ['Galassia di Sapori Interstellari',\n",
       "  'Il Risveglio del Drago Celeste',\n",
       "  'Una Mucca e una Balena nella Singolarità',\n",
       "  'Crescendo Cosmico',\n",
       "  'Fusione Celeste'],\n",
       " 74: ['Galassia Sensoriale',\n",
       "  'Ode Cosmica di Terra e Stelle',\n",
       "  'Galassia di Sogni Cosmogastronomici',\n",
       "  \"La Sinfonia dell'Universo\",\n",
       "  'Universo Incantato: Sinfonia dei Gusti Cosmogonici',\n",
       "  \"Nebulosa dell'Infinito: Un Viaggio attraverso il Cosmo del Gusto\",\n",
       "  'Sinfonia Cosmica'],\n",
       " 75: ['Galassia di Sapore Quantico',\n",
       "  'Ethereal Temporal Elixir',\n",
       "  'Pizza Baby Simone e Alessandro',\n",
       "  'Melodia del Multiverso Parallelo',\n",
       "  'Mandragora e Radici'],\n",
       " 76: ['Odissea Temporale', 'Galassia di Sapori: Il Viaggio Senza Tempo'],\n",
       " 77: [],\n",
       " 78: [],\n",
       " 79: [],\n",
       " 80: [],\n",
       " 81: [],\n",
       " 82: [],\n",
       " 83: [],\n",
       " 84: [],\n",
       " 85: [],\n",
       " 86: [],\n",
       " 87: [],\n",
       " 88: [],\n",
       " 89: ['Sinfonia Galattica Agentica',\n",
       "  'Sinfonia Quantica Galattica',\n",
       "  \"Eclissi del Drago nell'Abbraccio del Kraken\",\n",
       "  'Cosmos in Tavola',\n",
       "  'Sinfonia Celeste di Granuli Arcobaleno e Riso di Cassandra',\n",
       "  'Piastrella Celestiale di Gnocchi del Crepuscolo con Nebulosa di Riso di Cassandra, Lacrime di Unicorno e Velo di Materia Oscura',\n",
       "  'Il Viaggio Cosmico di Marinetti',\n",
       "  \"Nebulosa di Dragone all'Essenza di Vuoto\",\n",
       "  'Viaggio Cosmico tra Mare e Stelle',\n",
       "  'Luce e Ombra di Nomea Spaziale',\n",
       "  'Il Viaggio Celeste',\n",
       "  \"Il Risveglio della Fenice sull'Arcobaleno d'Oceano\",\n",
       "  'Galassia di Sapore',\n",
       "  'Il Crepuscolo dell’Unicorno',\n",
       "  'Cosmic Synchrony: Il Destino di Pulsar',\n",
       "  'Viaggio Galattico: Sinfonia dei Sensi',\n",
       "  \"L'Estasi Cosmica di Nova\",\n",
       "  'Sinfonia Cosmica di Proteine Interstellari',\n",
       "  'Nebulosa Galattica',\n",
       "  'Portale delle Meraviglie',\n",
       "  'Cosmos Culinary Symphony',\n",
       "  'Dimensioni di Sapori Infusi',\n",
       "  'Sinfonia Astrale',\n",
       "  'Danza Cosmica al Crepuscolo',\n",
       "  'Sinfonia Cosmica',\n",
       "  'Sinfonia del Multiverso di Gusto',\n",
       "  'Sinfonia Temporale Galattica',\n",
       "  'Sinfonia Astrale - Risotto Multiversale con Risacca Celeste',\n",
       "  'Universo in Fluttuazione',\n",
       "  'Sinfonia Galattica ai Cristalli di Nebulite',\n",
       "  'Portale del Cosmo: Sinfonia di Sapori Multidimensionali',\n",
       "  'Sinfonia di Gusti del Multiverso',\n",
       "  'Viaggio Celeste nel Multiverso',\n",
       "  'Sinfonia Cosmica del Multiverso',\n",
       "  'Più Lontano delle Stelle',\n",
       "  'Sinfonia di Multiverso: La Danza degli Elementi',\n",
       "  'Sinfonia del Multiverso',\n",
       "  'Stella Nova',\n",
       "  'Sinfonia di Cristalli e Rigenerazione',\n",
       "  'Sfere del Ricordo Astrale',\n",
       "  'Sinfonia Celestiale dei Ricordi',\n",
       "  'Sinfonia Crepuscolare',\n",
       "  'Viaggio dei Ricordi Stellari',\n",
       "  'Il Simposio degli Infiniti Ricordi',\n",
       "  'Rapsodia dei Ricordi Celesti',\n",
       "  'Sinfonia del Cosmo',\n",
       "  'Sinfonia dei Ricordi Celesti',\n",
       "  'Il Ricordo del Fuoco Celeste',\n",
       "  'Alternate Realities Risotto',\n",
       "  'Risotto Interdimensionale alla Carne di Drago e Balena Spaziale con Biscotti della Galassia Croccanti'],\n",
       " 90: [],\n",
       " 91: [],\n",
       " 92: [],\n",
       " 93: ['Sinfonia Temporale al Tocco di Crono',\n",
       "  'Nebulosa di Fenice con Sinfonia Eterea',\n",
       "  'Sfogliare Galattico di Sogni Temporali',\n",
       "  'Viaggio dei Sensi: Bolla Temporale di Aromi Ancestrali',\n",
       "  'Sinfonia di Stagioni Stellari',\n",
       "  'Sinfonia di Crepuscolo Celestiale',\n",
       "  'Sinfonia Temporale nello Spaghi del Sole',\n",
       "  'Galassia Risvegliata',\n",
       "  'Cosmopolis delle Galassie Perdute',\n",
       "  'Sinfonia Tempolare Galattica'],\n",
       " 94: ['Sinfonia Temporale al Tocco di Crono',\n",
       "  'Nebulosa di Fenice con Sinfonia Eterea',\n",
       "  'Sfogliare Galattico di Sogni Temporali',\n",
       "  'Viaggio dei Sensi: Bolla Temporale di Aromi Ancestrali',\n",
       "  'Sinfonia di Stagioni Stellari',\n",
       "  'Sinfonia Temporale nello Spaghi del Sole',\n",
       "  'Galassia Risvegliata',\n",
       "  'Sinfonia Tempolare Galattica'],\n",
       " 95: [],\n",
       " 96: [],\n",
       " 97: [\"Sinfonia Cosmica all'Alba di Fenice\",\n",
       "  'Sinfonia di Cristalli e Rigenerazione',\n",
       "  'Il Risveglio del Drago Celeste',\n",
       "  'Sinfonia Temporale al Tocco di Crono',\n",
       "  'Portale Cosmico: Sinfonia di Gnocchi del Crepuscolo con Essenza di Tachioni e Sfumature di Fenice'],\n",
       " 98: ['La Balena incontra la Mandragora',\n",
       "  'Nebulosa di Confini Sfondati',\n",
       "  'Sinfonia di Galassie Riflesse',\n",
       "  'Cosmic Harmony',\n",
       "  'Sinfonia Cosmica di Andromeda'],\n",
       " 99: [],\n",
       " 100: []}"
      ]
     },
     "execution_count": 55,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "lista_risposte"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "metadata": {},
   "outputs": [],
   "source": [
    "with open('submission9.txt', 'w') as convert_file: \n",
    "     convert_file.write(json.dumps(lista_risposte))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {},
   "outputs": [],
   "source": [
    "from format_submission import json_txt_to_submission\n",
    "json_txt_to_submission(\"dish_mapping.json\", \"submission9.txt\", \"output9.csv\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 156,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{1: [78], 2: [225], 3: [156], 4: [215], 5: [], 6: [179], 7: [171, 267, 189], 8: [15, 130, 13, 6, 209, 51], 9: [76, 207], 10: [115, 266], 11: [104], 12: [240, 185], 13: [125], 14: [81, 101], 15: [269, 147, 160, 35, 10, 125, 281, 191], 16: [147, 160, 35, 10, 125, 281, 217, 191], 17: [112, 263, 276, 157, 170, 16, 215], 18: [128, 37, 45, 91], 19: [], 20: [103, 54], 21: [168, 241], 22: [74], 23: [149], 24: [118], 25: [], 26: [205], 27: [92, 17, 115, 21, 243, 187], 28: [17, 205, 145, 96, 243, 62], 29: [234], 30: [205, 190, 112, 110, 180, 77], 31: [166, 221], 32: [206, 128, 124], 33: [], 34: [272], 35: [121, 217], 36: [72, 276, 247], 37: [140], 38: [188], 39: [247, 42, 99, 85, 5], 40: [49, 153, 157, 158, 197, 50, 235, 140], 41: [191, 187], 42: [48, 179], 43: [207, 37, 275, 123, 265, 59], 44: [147, 61, 142, 281, 169], 45: [89], 46: [286], 47: [], 48: [169], 49: [], 50: [], 51: [], 52: [], 53: [258], 54: [132, 52], 55: [268], 56: [272, 114], 57: [], 58: [], 59: [], 60: [], 61: [270, 78, 94], 62: [77, 46], 63: [174], 64: [198, 166], 65: [], 66: [], 67: [], 68: [], 69: [], 70: [], 71: [], 72: [], 73: [75, 96, 271, 26, 51], 74: [60, 141, 81, 116, 273, 131, 204], 75: [71, 44, 155, 121], 76: [145, 78], 77: [], 78: [], 79: [], 80: [], 81: [], 82: [], 83: [], 84: [], 85: [], 86: [], 87: [], 88: [], 89: [], 90: []}\n"
     ]
    }
   ],
   "source": [
    "import json\n",
    "\n",
    "def load_mapping(mapping_file):\n",
    "    with open(mapping_file, 'r', encoding='utf-8') as file:\n",
    "        mapping = json.load(file)\n",
    "    return mapping\n",
    "\n",
    "def map_dishes(dishes_dict, mapping):\n",
    "    mapped_dict = {}\n",
    "    for key, dishes in dishes_dict.items():\n",
    "        mapped_dishes = [mapping[dish] for dish in dishes if dish in mapping]\n",
    "        mapped_dict[key] = mapped_dishes\n",
    "    return mapped_dict\n",
    "\n",
    "# Esempio di utilizzo\n",
    "\n",
    "mapping_file = 'dish_mapping.json'\n",
    "mapping = load_mapping(mapping_file)\n",
    "mapped_dishes_dict = map_dishes(lista_risposte, mapping)\n",
    "\n",
    "print(mapped_dishes_dict)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 162,
   "metadata": {},
   "outputs": [],
   "source": [
    "import csv\n",
    "\n",
    "def dict_to_csv(data_dict, csv_filename):\n",
    "    with open(csv_filename, mode='w', newline='', encoding='utf-8') as file:\n",
    "        writer = csv.writer(file)\n",
    "        writer.writerow(['row_id', 'result'])  # Scrivi l'intestazione\n",
    "\n",
    "        for key, values in data_dict.items():\n",
    "            result = \",\".join(map(str, values))  # Converte la lista in stringa separata da virgole\n",
    "            writer.writerow([key, f'{result}'])  # Aggiungi manualmente le virgolette attorno alla stringa result\n",
    "            \n",
    "\n",
    "\n",
    "csv_filename = 'outputDaSottomettere.csv'\n",
    "dict_to_csv(mapped_dishes_dict, csv_filename)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Pianeti"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 168,
   "metadata": {},
   "outputs": [],
   "source": [
    "planet_directory = 'restaurant_planet_json'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 169,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_planet(pianeta, nome_ristorante):\n",
    "    query = \"\"\"\n",
    "    MERGE (p:Pianeta {nome: $pianeta})\n",
    "    WITH p\n",
    "    MATCH (r:Ristorante {nome: $nome_ristorante})\n",
    "    MERGE (r)-[:SI_TROVA_SU]->(p)\n",
    "    RETURN p\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query, pianeta=pianeta, nome_ristorante=nome_ristorante)\n",
    "        return result.single()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 175,
   "metadata": {},
   "outputs": [],
   "source": [
    "for filename in os.listdir(planet_directory):\n",
    "    if filename.endswith('.json'):\n",
    "        filepath = os.path.join(directory, filename)\n",
    "        with open(filepath, 'r', encoding='utf-8') as file:\n",
    "            data = json.load(file)\n",
    "            if 'nome_ristorante' in data:\n",
    "                nome_ristorante = data['nome_ristorante']\n",
    "\n",
    "                if 'nome_pianeta' in data:\n",
    "                    add_planet(data['nome_pianeta'], nome_ristorante)\n",
    "                "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 193,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'Tatooine': {'Asgard': 695, 'Namecc': 641, 'Arrakis': 109, 'Krypton': 661, 'Pandora': 1130, 'Cybertron': 344, 'Ego': 835, 'Montressosr': 731, 'Klyntar': 530}}, {'Asgard': {'Tatooine': 695, 'Namecc': 550, 'Arrakis': 781, 'Krypton': 188, 'Pandora': 473, 'Cybertron': 493, 'Ego': 156, 'Montressosr': 240, 'Klyntar': 479}}, {'Namecc': {'Tatooine': 641, 'Asgard': 550, 'Arrakis': 651, 'Krypton': 367, 'Pandora': 987, 'Cybertron': 728, 'Ego': 688, 'Montressosr': 767, 'Klyntar': 845}}, {'Arrakis': {'Tatooine': 109, 'Asgard': 781, 'Namecc': 651, 'Krypton': 727, 'Pandora': 1227, 'Cybertron': 454, 'Ego': 926, 'Montressosr': 834, 'Klyntar': 640}}, {'Krypton': {'Tatooine': 661, 'Asgard': 188, 'Namecc': 367, 'Arrakis': 727, 'Pandora': 626, 'Cybertron': 557, 'Ego': 321, 'Montressosr': 422, 'Klyntar': 599}}, {'Pandora': {'Tatooine': 1130, 'Asgard': 473, 'Namecc': 987, 'Arrakis': 1227, 'Krypton': 626, 'Cybertron': 847, 'Ego': 317, 'Montressosr': 413, 'Klyntar': 731}}, {'Cybertron': {'Tatooine': 344, 'Asgard': 493, 'Namecc': 728, 'Arrakis': 454, 'Krypton': 557, 'Pandora': 847, 'Ego': 594, 'Montressosr': 434, 'Klyntar': 186}}, {'Ego': {'Tatooine': 835, 'Asgard': 156, 'Namecc': 688, 'Arrakis': 926, 'Krypton': 321, 'Pandora': 317, 'Cybertron': 594, 'Montressosr': 215, 'Klyntar': 532}}, {'Montressosr': {'Tatooine': 731, 'Asgard': 240, 'Namecc': 767, 'Arrakis': 834, 'Krypton': 422, 'Pandora': 413, 'Cybertron': 434, 'Ego': 215, 'Klyntar': 331}}, {'Klyntar': {'Tatooine': 530, 'Asgard': 479, 'Namecc': 845, 'Arrakis': 640, 'Krypton': 599, 'Pandora': 731, 'Cybertron': 186, 'Ego': 532, 'Montressosr': 331}}]\n"
     ]
    }
   ],
   "source": [
    "import pandas as pd\n",
    "\n",
    "# Carica il file CSV in un DataFrame\n",
    "df = pd.read_csv('Distanze.csv', index_col=0, delimiter=',')\n",
    "\n",
    "# Crea la struttura dati desiderata\n",
    "distanze = {}\n",
    "for pianeta in df.index:\n",
    "    distanze[pianeta] = df.loc[pianeta].to_dict()\n",
    "\n",
    "# Rimuovi le distanze verso se stessi (0)\n",
    "for pianeta, distanze_pianeta in distanze.items():\n",
    "    if pianeta in distanze_pianeta:\n",
    "        del distanze_pianeta[pianeta]\n",
    "\n",
    "# Converti il dizionario in una lista di dizionari\n",
    "distanze_pianeti = [{pianeta: distanze_pianeta} for pianeta, distanze_pianeta in distanze.items()]\n",
    "\n",
    "print(distanze_pianeti)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 233,
   "metadata": {},
   "outputs": [],
   "source": [
    "def process_planet_data(planet_data):\n",
    "    cypher_queries = []\n",
    "    for planet in planet_data:\n",
    "        for key, values in planet.items():\n",
    "            for planet, distance in values.items():\n",
    "                    \n",
    "                query = f\"\"\"\n",
    "                MATCH (p1:Pianeta {{nome: '{key}'}})\n",
    "                MATCH (p2:Pianeta {{nome: '{planet}'}})\n",
    "                CREATE (p1)-[:HA_DISTANZA_ANNI_LUCE {{distanza: {distance}}}]->(p2)\n",
    "                \"\"\"\n",
    "                cypher_queries.append(query)\n",
    "            \n",
    "\n",
    "    return cypher_queries\n",
    "\n",
    "\n",
    "queries = process_planet_data(distanze_pianeti)\n",
    "\n",
    "\n",
    "def submit_queries(driver, queries):\n",
    "    with driver.session() as session:\n",
    "        for query in queries:\n",
    "            session.run(query)\n",
    "\n",
    "submit_queries(driver, queries)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Licenze"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_licenza():\n",
    "    pass"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [],
   "source": [
    "def process_and_insert_licenses(json_file_path):\n",
    "    # Carica il file JSON\n",
    "    with open(json_file_path, 'r', encoding='utf-8') as file:\n",
    "        data = json.load(file)\n",
    "    \n",
    "    # Connessione al database Neo4j\n",
    "    #driver = GraphDatabase.driver(neo4j_uri, auth=(user, password))\n",
    "    \n",
    "    def insert_license(tx, nome_licenza, sigla_licenza):\n",
    "        query = (\n",
    "            \"CREATE (l:Licenza {nome: $nome_licenza, sigla: $sigla_licenza})\"\n",
    "        )\n",
    "        tx.run(query, nome_licenza=nome_licenza, sigla_licenza=sigla_licenza)\n",
    "    \n",
    "    with driver.session() as session:\n",
    "        for licenza in data:\n",
    "            nome_licenza = licenza['nome_licenza']\n",
    "            sigla_licenza = licenza['sigla_licenza']\n",
    "            session.execute_write(insert_license, nome_licenza, sigla_licenza)\n",
    "    \n",
    "    driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [],
   "source": [
    "process_and_insert_licenses(\"licenze.json\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### link ristorante-licenze"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [],
   "source": [
    "licenses_directory = \"licenze_json\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [],
   "source": [
    "def roman_to_int(roman):\n",
    "    # Se l'input è già un intero, restituiscilo come stringa\n",
    "    if isinstance(roman, int):\n",
    "        return str(roman)\n",
    "    \n",
    "    # Se l'input è una stringa che rappresenta un intero, restituiscila direttamente\n",
    "    if isinstance(roman, str) and roman.isdigit():\n",
    "        return roman\n",
    "    \n",
    "    # Dizionario di mappatura dei numeri romani ai loro valori interi\n",
    "    roman_to_int_map = {\n",
    "        'I': '1',\n",
    "        'II': '2',\n",
    "        'III': '3',\n",
    "        'IV': '4',\n",
    "        'V': '5',\n",
    "        'VI': '6',\n",
    "        'VI+': '6+'\n",
    "    }\n",
    "    \n",
    "    # Restituisce il valore intero corrispondente al numero romano come stringa, o None se non trovato\n",
    "    return roman_to_int_map.get(roman, \"0\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [],
   "source": [
    "def process_licenses(directory):\n",
    "    #driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "    \n",
    "    def create_relationship(tx, ristorante, licenza, grado):\n",
    "        query = (\n",
    "            \"MATCH (r:Ristorante {nome: $ristorante})-[:GESTITO_DA]->(c:Chef), \"\n",
    "            \"(l:Licenza {nome: $licenza}) \"\n",
    "            \"MERGE (c)-[rel:POSSIEDE_LICENZA {grado: $grado}]->(l)\"\n",
    "        )\n",
    "        tx.run(query, ristorante=ristorante, licenza=licenza, grado=grado)\n",
    "    \n",
    "    for filename in os.listdir(directory):\n",
    "        if filename.endswith(\".json\"):\n",
    "            filepath = os.path.join(directory, filename)\n",
    "            with open(filepath, 'r', encoding='utf-8') as file:\n",
    "                data = json.load(file)\n",
    "                ristorante = data['nome_ristorante']\n",
    "                for licenza in data['licenze']:\n",
    "                    nome_licenza = licenza['nome_licenza']\n",
    "                    grado_licenza = roman_to_int(licenza['grado_licenza'])\n",
    "                    print(grado_licenza)\n",
    "                    with driver.session() as session:\n",
    "                        session.execute_write(create_relationship, ristorante, nome_licenza, grado_licenza)\n",
    "    \n",
    "    driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "process_licenses(licenses_directory)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "hp",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "name": "python",
   "version": "3.11.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
