{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Main steps:\n",
    "1. testare connessione grafo \n",
    "2. creazione nodi Ristorante - Piatti - Ingredienti"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 84,
   "metadata": {},
   "outputs": [],
   "source": [
    "OPENAI_API_KEY = \"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\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "from dotenv import load_dotenv\n",
    "import json"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "load_dotenv()\n",
    "\n",
    "os.environ[\"NEO4J_URI\"] = os.getenv(\"NEO4J_URI\")\n",
    "os.environ[\"NEO4J_USERNAME\"] = os.getenv(\"NEO4J_USERNAME\")\n",
    "os.environ[\"NEO4J_PASSWORD\"] = os.getenv(\"NEO4J_PASSWORD\")\n",
    "uri = os.environ[\"NEO4J_URI\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(uri, auth=(os.environ[\"NEO4J_USERNAME\"], os.environ[\"NEO4J_PASSWORD\"]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 76,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record nodes=[<Node element_id='-5' labels=frozenset({'Tecnica'}) properties={'name': 'Tecnica', 'indexes': [], 'constraints': [\"Constraint( id=12, name='constraint_7b990bc7', type='UNIQUENESS', schema=(:Tecnica {id}), ownedIndex=11 )\"]}>, <Node element_id='-4' labels=frozenset({'Ingrediente'}) properties={'name': 'Ingrediente', 'indexes': [], 'constraints': [\"Constraint( id=10, name='constraint_5c7a41c', type='UNIQUENESS', schema=(:Ingrediente {id}), ownedIndex=9 )\"]}>, <Node element_id='-1' labels=frozenset({'Ristorante'}) properties={'name': 'Ristorante', 'indexes': [], 'constraints': [\"Constraint( id=4, name='constraint_727b183b', type='UNIQUENESS', schema=(:Ristorante {id}), ownedIndex=3 )\"]}>, <Node element_id='-2' labels=frozenset({'Chef'}) properties={'name': 'Chef', 'indexes': [], 'constraints': [\"Constraint( id=6, name='constraint_204acb3d', type='UNIQUENESS', schema=(:Chef {id}), ownedIndex=5 )\"]}>, <Node element_id='-3' labels=frozenset({'Piatto'}) properties={'name': 'Piatto', 'indexes': [], 'constraints': [\"Constraint( id=8, name='constraint_471e6641', type='UNIQUENESS', schema=(:Piatto {id}), ownedIndex=7 )\"]}>] relationships=[<Relationship element_id='-1' nodes=(<Node element_id='-1' labels=frozenset({'Ristorante'}) properties={'name': 'Ristorante', 'indexes': [], 'constraints': [\"Constraint( id=4, name='constraint_727b183b', type='UNIQUENESS', schema=(:Ristorante {id}), ownedIndex=3 )\"]}>, <Node element_id='-2' labels=frozenset({'Chef'}) properties={'name': 'Chef', 'indexes': [], 'constraints': [\"Constraint( id=6, name='constraint_204acb3d', type='UNIQUENESS', schema=(:Chef {id}), ownedIndex=5 )\"]}>) type='GESTITO_DA' properties={'name': 'GESTITO_DA'}>, <Relationship element_id='-3' nodes=(<Node element_id='-3' labels=frozenset({'Piatto'}) properties={'name': 'Piatto', 'indexes': [], 'constraints': [\"Constraint( id=8, name='constraint_471e6641', type='UNIQUENESS', schema=(:Piatto {id}), ownedIndex=7 )\"]}>, <Node element_id='-4' labels=frozenset({'Ingrediente'}) properties={'name': 'Ingrediente', 'indexes': [], 'constraints': [\"Constraint( id=10, name='constraint_5c7a41c', type='UNIQUENESS', schema=(:Ingrediente {id}), ownedIndex=9 )\"]}>) type='CONTIENE' properties={'name': 'CONTIENE'}>, <Relationship element_id='-2' nodes=(<Node element_id='-1' labels=frozenset({'Ristorante'}) properties={'name': 'Ristorante', 'indexes': [], 'constraints': [\"Constraint( id=4, name='constraint_727b183b', type='UNIQUENESS', schema=(:Ristorante {id}), ownedIndex=3 )\"]}>, <Node element_id='-3' labels=frozenset({'Piatto'}) properties={'name': 'Piatto', 'indexes': [], 'constraints': [\"Constraint( id=8, name='constraint_471e6641', type='UNIQUENESS', schema=(:Piatto {id}), ownedIndex=7 )\"]}>) type='OFFRE_IL_PIATTO' properties={'name': 'OFFRE_IL_PIATTO'}>, <Relationship element_id='-4' nodes=(<Node element_id='-3' labels=frozenset({'Piatto'}) properties={'name': 'Piatto', 'indexes': [], 'constraints': [\"Constraint( id=8, name='constraint_471e6641', type='UNIQUENESS', schema=(:Piatto {id}), ownedIndex=7 )\"]}>, <Node element_id='-5' labels=frozenset({'Tecnica'}) properties={'name': 'Tecnica', 'indexes': [], 'constraints': [\"Constraint( id=12, name='constraint_7b990bc7', type='UNIQUENESS', schema=(:Tecnica {id}), ownedIndex=11 )\"]}>) type='REALIZZATO_CON_LA_TECNICA' properties={'name': 'REALIZZATO_CON_LA_TECNICA'}>]>\n"
     ]
    }
   ],
   "source": [
    "def get_graph_schema(driver):\n",
    "    with driver.session() as session:\n",
    "        result = session.run(\"\"\"CALL db.schema.visualization()\n",
    "               \"\"\")\n",
    "        return result.single()\n",
    "    \n",
    "schema = get_graph_schema(driver)\n",
    "print(schema)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Aggiunta menu-ristoranti-piatti al grafo"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {},
   "outputs": [],
   "source": [
    "directory = 'menu_json'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_restaurant(restaurant_name):\n",
    "    query = \"\"\"\n",
    "    CREATE (r:Ristorante {nome: $nome})\n",
    "    RETURN r\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query, nome=restaurant_name)\n",
    "        return result.single()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 71,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_chef(chef, nome_ristorante):\n",
    "    query = \"\"\"\n",
    "    MERGE (c:Chef {nome: $chef})\n",
    "    WITH c\n",
    "    MATCH (r:Ristorante {nome: $nome_ristorante})\n",
    "    MERGE (r)-[:GESTITO_DA]->(c)\n",
    "    RETURN c\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query, chef=chef, nome_ristorante=nome_ristorante)\n",
    "        return result.single()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 70,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_piatto(piatto, nome_ristorante):\n",
    "    query = \"\"\"\n",
    "    MERGE (p:Piatto {nome: $piatto})\n",
    "    WITH p\n",
    "    MATCH (r:Ristorante {nome: $nome_ristorante})\n",
    "    MERGE (r)-[:OFFRE_IL_PIATTO]->(p)\n",
    "    RETURN p\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query, piatto=piatto, nome_ristorante=nome_ristorante)\n",
    "        return result.single()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 69,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_ingrediente(ingrediente, nome_piatto):\n",
    "    query = \"\"\"\n",
    "    MERGE (i:Ingrediente {nome: $ingrediente})\n",
    "    WITH i\n",
    "    MATCH (p:Piatto {nome: $nome_piatto})\n",
    "    MERGE (p)-[:CONTIENE]->(i)\n",
    "    RETURN i\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query, ingrediente=ingrediente, nome_piatto=nome_piatto)\n",
    "        return result.single()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_tecnica(tecnica, nome_piatto):\n",
    "    query = \"\"\"\n",
    "    MERGE (t:Tecnica {nome: $tecnica})\n",
    "    WITH t\n",
    "    MATCH (p:Piatto {nome: $nome_piatto})\n",
    "    MERGE (p)-[:REALIZZATO_CON_LA_TECNICA]->(t)\n",
    "    RETURN t\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query, tecnica=tecnica, nome_piatto=nome_piatto)\n",
    "        return result.single()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_menu(menu, nome_ristorante):\n",
    "    \"\"\"Riceva una lista di piatti, ogni piatto è un dizionario con chiavi:\n",
    "    nome_piatto: str,\n",
    "    ingredienti: list[str],\n",
    "    tecniche: list [str]\n",
    "    \"\"\"\n",
    "    \n",
    "    for piatto in menu:\n",
    "        nome_piatto = piatto['nome_piatto'] if 'nome_piatto' in piatto else ''\n",
    "        add_piatto(nome_piatto, nome_ristorante)\n",
    "                        \n",
    "        if 'ingredienti' in piatto:\n",
    "            ingredienti = piatto['ingredienti']\n",
    "            for ingrediente in ingredienti:\n",
    "                add_ingrediente(ingrediente, nome_piatto)\n",
    "\n",
    "        if 'tecniche' in piatto:\n",
    "            tecniche = piatto['tecniche']\n",
    "            for tecnica in tecniche:\n",
    "                add_tecnica(tecnica, nome_piatto)\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "metadata": {},
   "outputs": [],
   "source": [
    "for filename in os.listdir(directory):\n",
    "    if filename.endswith('.json'):\n",
    "        filepath = os.path.join(directory, filename)\n",
    "        with open(filepath, 'r', encoding='utf-8') as file:\n",
    "            data = json.load(file)\n",
    "            if 'nome_ristorante' in data:\n",
    "                add_restaurant(data['nome_ristorante'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "metadata": {},
   "outputs": [],
   "source": [
    "for filename in os.listdir(directory):\n",
    "    if filename.endswith('.json'):\n",
    "        filepath = os.path.join(directory, filename)\n",
    "        with open(filepath, 'r', encoding='utf-8') as file:\n",
    "            data = json.load(file)\n",
    "            if 'nome_ristorante' in data:\n",
    "                nome_ristorante = data['nome_ristorante']\n",
    "                \n",
    "                if 'nome_chef' in data:\n",
    "                    add_chef(data['nome_chef'], nome_ristorante)\n",
    "                if 'menu' in data:\n",
    "                    add_menu(data['menu'], nome_ristorante)\n",
    "                \n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Creazione indici (per migliori performance)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 74,
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_indexes(driver):\n",
    "    with driver.session() as session:\n",
    "        for label in [\"Ristorante\", \"Chef\", \"Piatto\", \"Ingrediente\", \"Tecnica\"]:\n",
    "            session.run(f\"CREATE CONSTRAINT IF NOT EXISTS FOR (n:{label}) REQUIRE n.id IS UNIQUE\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 75,
   "metadata": {},
   "outputs": [],
   "source": [
    "create_indexes(driver)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Querying the Graph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Vanilla\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 87,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_neo4j import GraphCypherQAChain\n",
    "from langchain_openai import ChatOpenAI\n",
    "from langchain_neo4j import Neo4jGraph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 85,
   "metadata": {},
   "outputs": [],
   "source": [
    "llm = ChatOpenAI(\n",
    "    model=\"gpt-4o\",\n",
    "    temperature=0,\n",
    "    max_tokens=None,\n",
    "    api_key=OPENAI_API_KEY\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 95,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties:\n",
      "- **Ristorante**\n",
      "  - `nome`: STRING Example: \"Anima Cosmica\"\n",
      "- **Chef**\n",
      "  - `nome`: STRING Example: \"Aurora Stellaris\"\n",
      "- **Piatto**\n",
      "  - `nome`: STRING Example: \"Nebulosa Celestiale alla Stellaris\"\n",
      "- **Ingrediente**\n",
      "  - `nome`: STRING Example: \"Shard di Materia Oscura\"\n",
      "- **Tecnica**\n",
      "  - `nome`: STRING Example: \"Cottura a Vapore con Flusso di Particelle Isoarmon\"\n",
      "Relationship properties:\n",
      "\n",
      "The relationships:\n",
      "(:Ristorante)-[:OFFRE_IL_PIATTO]->(:Piatto)\n",
      "(:Ristorante)-[:GESTITO_DA]->(:Chef)\n",
      "(:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica)\n",
      "(:Piatto)-[:CONTIENE]->(:Ingrediente)\n"
     ]
    }
   ],
   "source": [
    "graph = Neo4jGraph(\n",
    "    url=uri, \n",
    "    username=os.environ[\"NEO4J_USERNAME\"], \n",
    "    password=os.environ[\"NEO4J_PASSWORD\"],\n",
    "    enhanced_schema=True\n",
    ")\n",
    "\n",
    "print(graph.schema)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 96,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_core.prompts.prompt import PromptTemplate"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 101,
   "metadata": {},
   "outputs": [],
   "source": [
    "CYPHER_GENERATION_TEMPLATE = \"\"\"Task:Generate Cypher statement to query a graph database.\n",
    "The graph database contains restaurants and dishes from an alien galaxy.\n",
    "Instructions:\n",
    "Use only the provided relationship types and properties in the schema.\n",
    "Do not use any other relationship types or properties that are not provided.\n",
    "Schema:\n",
    "{schema}\n",
    "Note: Do not include any explanations or apologies in your responses.\n",
    "Do not respond to any questions that might ask anything else than for you to construct a Cypher statement.\n",
    "Do not include any text except the generated Cypher statement.\n",
    "\n",
    "\n",
    "The question is:\n",
    "{question}\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 102,
   "metadata": {},
   "outputs": [],
   "source": [
    "CYPHER_GENERATION_PROMPT = PromptTemplate(\n",
    "    input_variables=[\"schema\", \"question\"], template=CYPHER_GENERATION_TEMPLATE\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 114,
   "metadata": {},
   "outputs": [],
   "source": [
    "chain = GraphCypherQAChain.from_llm(\n",
    "    llm, \n",
    "    graph=graph, \n",
    "    verbose=True, \n",
    "    allow_dangerous_requests=True, \n",
    "    cypher_prompt=CYPHER_GENERATION_PROMPT,\n",
    "    return_direct=True,\n",
    "    top_k=50\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 117,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(i:Ingrediente {nome: 'Latte+'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    }
   ],
   "source": [
    "answer = chain.invoke(\"Quali sono i piatti della galassia che contengono Latte+?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 118,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "dict"
      ]
     },
     "execution_count": 118,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "type(answer)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 123,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\"Pizza Cosmica all'Essenza di Drago con Nebbia Arcobaleno e Funghi Orbitali\""
      ]
     },
     "execution_count": 123,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "answer[\"result\"][0][\"p.nome\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 146,
   "metadata": {},
   "outputs": [],
   "source": [
    "import csv\n",
    "\n",
    "def read_csv(file_path):\n",
    "    with open(file_path, mode='r', encoding='utf-8') as file:\n",
    "        lista_domande = []\n",
    "        csv_reader = csv.DictReader(file)\n",
    "        for row in csv_reader:\n",
    "            lista_domande.append(row['domanda'])\n",
    "        return lista_domande\n",
    "            \n",
    "\n",
    "# Example usage\n",
    "file_path = 'domande.csv'\n",
    "lista_domande = read_csv(file_path)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 147,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(i:Ingrediente {nome: 'Chocobo Wings'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(i:Ingrediente {nome: 'Cioccorane'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(i:Ingrediente {nome: 'Latte+'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(i:Ingrediente {nome: \"Ravioli al Vaporeon\"})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(i:Ingrediente {nome: \"Sashimi di Magikarp\"})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(i:Ingrediente {nome: \"Frutti del Diavolo\"})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: 'Grigliatura a Energia Stellare DiV'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: 'Sferificazione a Gravità Psionica Variabile'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t1:Tecnica {nome: 'Marinatura Temporale Sincronizzata'}),\n",
      "      (p)-[:REALIZZATO_CON_LA_TECNICA]->(t2:Tecnica {nome: 'Congelamento Bio-Luminiscente Sincronico'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t1:Tecnica {nome: 'Cottura Olografica Quantum Fluttuante'}),\n",
      "      (p)-[:REALIZZATO_CON_LA_TECNICA]->(t2:Tecnica {nome: 'Decostruzione Interdimensionale Lovecraftiana'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(i1:Ingrediente {nome: \"Riso di Cassandra\"}), \n",
      "      (p)-[:CONTIENE]->(i2:Ingrediente {nome: \"Polvere di Crononite\"})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(i1:Ingrediente {nome: \"Shard di Prisma Stellare\"}), (p)-[:CONTIENE]->(i2:Ingrediente {nome: \"Sale Temporale\"})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Teste di Idra\"}), \n",
      "      (p)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Cottura Sottovuoto Multirealità Collassante\"})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: 'Fermentazione Quantico Biometrica'}), \n",
      "      (p)-[:CONTIENE]->(i:Ingrediente {nome: 'Erba Pipa'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: 'Sferificazione Filamentare a Molecole Vibrazionali'})\n",
      "WHERE NOT EXISTS {\n",
      "  MATCH (p)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: 'Amalgamazione Sintetica Molecolare'})\n",
      "}\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: 'Sferificazione Filamentare a Molecole Vibrazionali'})\n",
      "WHERE NOT EXISTS {\n",
      "  MATCH (p)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: 'Decostruzione Magnetica Risonante'})\n",
      "}\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: 'Sferificazione con Campi Magnetici Entropici'})\n",
      "WHERE NOT (p)-[:CONTIENE]->(:Ingrediente {nome: 'Spezie Melange'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: 'Surgelamento Antimaterico a Risonanza Inversa'})\n",
      "WHERE NOT (p)-[:CONTIENE]->(:Ingrediente {nome: 'Foglie di Mandragora'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(i1:Ingrediente {nome: 'Foglie di Nebulosa'}),\n",
      "      (p)-[:CONTIENE]->(i2:Ingrediente {nome: 'Amido di Stellarion'}),\n",
      "      (p)-[:CONTIENE]->(i3:Ingrediente {nome: 'Uova di Fenice'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(i1:Ingrediente {nome: 'Carne di Balena spaziale'}),\n",
      "      (p)-[:CONTIENE]->(i2:Ingrediente {nome: 'Essenza di Tachioni'}),\n",
      "      (p)-[:CONTIENE]->(i3:Ingrediente {nome: 'Alghe Bioluminescenti'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(i1:Ingrediente {nome: 'Erba Pipa'}),\n",
      "      (p)-[:CONTIENE]->(i2:Ingrediente {nome: 'Funghi Orbitali'}),\n",
      "      (p)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: 'Bollitura Infrasonica Armonizzata'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: \"Cottura a Vapore con Flusso di Particelle Isoarmoniche\"}),\n",
      "      (p)-[:CONTIENE]->(i1:Ingrediente {nome: \"Riso di Cassandra\"}),\n",
      "      (p)-[:CONTIENE]->(i2:Ingrediente {nome: \"Foglie di Nebulosa\"})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(:Ingrediente {nome: 'Carne di Balena spaziale'}),\n",
      "      (p)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: 'Bollitura Entropica Sincronizzata'}),\n",
      "      (p)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: 'Affettamento a Pulsazioni Quantistiche'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(:Ingrediente {nome: 'Lacrime di Unicorno'}),\n",
      "      (p)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: 'Taglio Sinaptico Biomimetico'}),\n",
      "      (p)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: 'Idro-Cristallizzazione Sonora Quantistica'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t1:Tecnica {nome: 'Cottura a Vapore Risonante Simbiotico'}),\n",
      "      (p)-[:REALIZZATO_CON_LA_TECNICA]->(t2:Tecnica {nome: 'doppia Fermentazione Quantico Biometrica'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t1:Tecnica {nome: \"Taglio a Risonanza Sonica Rigenerativa\"}), \n",
      "      (p)-[:REALIZZATO_CON_LA_TECNICA]->(t2:Tecnica {nome: \"Cottura a Vapore Ecodinamico Bilanciato\"})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(i1:Ingrediente {nome: 'Lattuga Namecciana'}),\n",
      "      (p)-[:CONTIENE]->(i2:Ingrediente {nome: 'Carne di Mucca'})\n",
      "WHERE NOT EXISTS {\n",
      "  MATCH (p)-[:CONTIENE]->(:Ingrediente {nome: 'Teste di Idra'})\n",
      "}\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(:Ingrediente {nome: 'Essenza di Tachioni'}),\n",
      "      (p)-[:CONTIENE]->(:Ingrediente {nome: 'Carne di Mucca'})\n",
      "WHERE NOT EXISTS {\n",
      "  MATCH (p)-[:CONTIENE]->(:Ingrediente {nome: 'Muffa Lunare'})\n",
      "}\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(i:Ingrediente {nome: 'Funghi Orbitali'}),\n",
      "      (p)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: 'Marinatura Psionica'})\n",
      "WHERE NOT (p)-[:CONTIENE]->(:Ingrediente {nome: 'Shard di Materia Oscura'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(i:Ingrediente {nome: 'Funghi dell’Etere'}),\n",
      "      (p)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: \"Impasto Gravitazionale Vorticoso\"})\n",
      "WHERE NOT (p)-[:CONTIENE]->(:Ingrediente {nome: 'Plasma Vitale'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(i1:Ingrediente {nome: 'Funghi dell’Etere'}),\n",
      "      (p)-[:CONTIENE]->(i2:Ingrediente {nome: 'Erba Pipa'})\n",
      "WHERE NOT (p)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: 'Decostruzione Magnetica Risonante'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(:Ingrediente {nome: 'Salsa Szechuan'}),\n",
      "      (p)-[:CONTIENE]->(:Ingrediente {nome: 'Granuli di Nebbia Arcobaleno'})\n",
      "WHERE NOT (p)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: 'Affumicatura a Stratificazione Quantica'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t1:Tecnica {nome: 'Affumicatura tramite Big Bang Microcosmico'}),\n",
      "      (p)-[:REALIZZATO_CON_LA_TECNICA]->(t2:Tecnica {nome: 'Affettamento a Pulsazioni Quantistiche'})\n",
      "WHERE NOT (p)-[:CONTIENE]->(:Ingrediente {nome: 'Funghi Orbitali'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t1:Tecnica {nome: 'Incisione Elettromagnetica Plasmica'}),\n",
      "      (p)-[:REALIZZATO_CON_LA_TECNICA]->(t2:Tecnica {nome: 'Bollitura Entropica Sincronizzata'})\n",
      "WHERE NOT (p)-[:CONTIENE]->(:Ingrediente {nome: 'Cristalli di Memoria'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(:Ingrediente {nome: 'Polvere di Crononite'}),\n",
      "      (p)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: 'Incisione Elettromagnetica Plasmica'})\n",
      "WHERE NOT EXISTS {\n",
      "  MATCH (p)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: 'Decostruzione Atomica a Strati Energetici'})\n",
      "}\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(:Ingrediente {nome: 'Alghe Bioluminescenti'}),\n",
      "      (p)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: 'Idro-Cristallizzazione Sonora Quantistica'})\n",
      "WHERE NOT EXISTS {\n",
      "  MATCH (p)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: 'Marinatura Temporale Sincronizzata'})\n",
      "}\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)\n",
      "WHERE NOT (p)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Cottura a Vapore Termocinetica Multipla\"})\n",
      "AND (p)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Congelazione Iperdimensionalmente Stratificata\"})\n",
      "AND (p)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Fermentazione Quantico Biometrica\"})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t1:Tecnica {nome: 'Affumicatura tramite Big Bang Microcosmico'}),\n",
      "      (p)-[:REALIZZATO_CON_LA_TECNICA]->(t2:Tecnica {nome: 'Cottura Sottovuoto Frugale Energeticamente Negativa'})\n",
      "WHERE NOT (p)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: 'Fermentazione Quantico Biometrica'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: 'Marinatura tramite Reazioni d\\'Antimateria Diluite'})\n",
      "WHERE NOT (p)-[:CONTIENE]->(:Ingrediente {nome: 'Cristalli di Nebulite'})\n",
      "  AND NOT (p)-[:CONTIENE]->(:Ingrediente {nome: 'Funghi dell’Etere'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: 'Congelazione Iperdimensionalmente Stratificata'})\n",
      "WHERE NOT (p)-[:CONTIENE]->(:Ingrediente {nome: 'Fibra di Sintetex'}) AND NOT (p)-[:CONTIENE]->(:Ingrediente {nome: 'Funghi Orbitali'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: 'Grigliatura Psionica Dinamica Ritmica'})\n",
      "WHERE NOT (p)-[:CONTIENE]->(:Ingrediente {nome: 'Pane degli Abissi'})\n",
      "AND NOT (p)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: 'Cottura Olografica Quantum Fluttuante'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: 'Taglio Sinaptico Biomimetico'})\n",
      "WHERE NOT (p)-[:CONTIENE]->(:Ingrediente {nome: 'Lattuga Namecciana'})\n",
      "AND NOT (p)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: 'Cottura Sottovuoto Bioma Sintetico'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: \"Decostruzione Ancestrale\"})\n",
      "WHERE NOT (p)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Cottura a Vapore Termocinetica Multipla\"})\n",
      "  AND NOT (p)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Marinatura a Infusione Gravitazionale\"})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: \"Affumicatura Polarizzata a Freddo Iperbarico\"})\n",
      "WHERE NOT (p)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Fermentazione Psionica Energetica\"})\n",
      "  AND NOT (p)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Congelamento Bio-Luminiscente Sincronico\"})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(i:Ingrediente)\n",
      "WHERE i.nome IN ['Carne di Balena spaziale', 'Teste di Idra', 'Spaghi del Sole', 'Carne di Xenodonte']\n",
      "WITH p, COLLECT(i.nome) AS ingredienti\n",
      "WHERE ALL(x IN ['Carne di Balena spaziale', 'Teste di Idra', 'Spaghi del Sole', 'Carne di Xenodonte'] WHERE x IN ingredienti)\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(i1:Ingrediente {nome: 'Cristalli di Memoria'}),\n",
      "      (p)-[:CONTIENE]->(i2:Ingrediente {nome: 'Essenza di Tachioni'}),\n",
      "      (p)-[:CONTIENE]->(i3:Ingrediente {nome: 'Carne di Kraken'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(:Ingrediente {nome: 'Vero Ghiaccio'}),\n",
      "      (p)-[:REALIZZATO_CON_LA_TECNICA]->(t1:Tecnica {nome: 'Cottura Sottovuoto Frugale Energeticamente Negativa'}),\n",
      "      (p)-[:REALIZZATO_CON_LA_TECNICA]->(t2:Tecnica {nome: 'Cottura Sottovuoto Bioma Sintetico'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(:Ingrediente {nome: \"Shard di Materia Oscura\"}), \n",
      "      (p)-[:CONTIENE]->(:Ingrediente {nome: \"Uova di Fenice\"}), \n",
      "      (p)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Affumicatura Polarizzata a Freddo Iperbarico\"}), \n",
      "      (p)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Cottura a Vapore Ecodinamico Bilanciato\"})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante {nome: 'Asgard'})-[:OFFRE_IL_PIATTO]->(p:Piatto)-[:CONTIENE]->(i:Ingrediente {nome: 'Essenza di Speziaria'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante {nome: \"Asgard\"})-[:OFFRE_IL_PIATTO]->(p:Piatto)-[:CONTIENE]->(i:Ingrediente {nome: \"Pane di Luce\"})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante {nome: 'Krypton'})-[:OFFRE_IL_PIATTO]->(p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: 'Cryo-Tessitura Energetica Polarizzata'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante {nome: 'Krypton'})-[:OFFRE_IL_PIATTO]->(p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: 'Cottura Sottovuoto Bioma Sintetico'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante {nome: \"L'Etere del Gusto\"})-[:OFFRE_IL_PIATTO]->(p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: \"Decostruzione Atomica a Strati Energetici\"})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante {nome: 'Stelle dell\\'Infinito Celestiale'})-[:OFFRE_IL_PIATTO]->(p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: 'Congelamento Bio-Luminiscente Sincronico'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante {nome: \"L'Universo in Cucina\"})-[:OFFRE_IL_PIATTO]->(p:Piatto)-[:CONTIENE]->(i:Ingrediente {nome: \"Funghi Orbitali\"})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante {nome: \"L'Oasi delle Dune Stellari\"})-[:OFFRE_IL_PIATTO]->(p:Piatto)-[:CONTIENE]->(i:Ingrediente {nome: \"Lattuga Namecciana\"})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (c:Chef)-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(p:Piatto)-[:CONTIENE]->(i:Ingrediente {nome: 'Spezie Melange'})\n",
      "WHERE c.nome CONTAINS 'LTK' AND c.nome CONTAINS 'grado 7' OR c.nome CONTAINS 'grado 8' OR c.nome CONTAINS 'grado 9' OR c.nome CONTAINS 'grado 10'\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (c:Chef)-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(p:Piatto)-[:CONTIENE]->(i:Ingrediente {nome: \"Nduja Fritta Tanto\"})\n",
      "WHERE c.nome CONTAINS \"Q di grado 15\"\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (c:Chef)-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: \"Cottura Idrodinamica Autoregolante\"})\n",
      "WHERE c.nome CONTAINS \"licenza t di grado 2\"\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (c:Chef)-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: \"Cottura Sottovuoto Multirealità Collassante\"})\n",
      "WHERE c.nome CONTAINS \"Luce di grado 3\"\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante {nome: \"L'Essenza dell'Infinito\"})-[:OFFRE_IL_PIATTO]->(p:Piatto)-[:CONTIENE]->(i:Ingrediente)\n",
      "WHERE i.nome IN [\"Fibra di Sintetex\", \"Essenza di Vuoto\"]\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante {nome: 'Le Dimensioni del Gusto'})-[:OFFRE_IL_PIATTO]->(p:Piatto)-[:CONTIENE]->(i:Ingrediente)\n",
      "WHERE i.nome IN ['Petali di Eco', 'Uova di Fenice']\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante {nome: \"L'Universo in Cucina\"})-[:OFFRE_IL_PIATTO]->(p:Piatto)\n",
      "WHERE (p)-[:CONTIENE]->(:Ingrediente {nome: \"Frammenti di Supernova\"}) OR (p)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Fermentazione Psionica Energetica\"})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante {nome: 'Cosmica Essenza'})-[:OFFRE_IL_PIATTO]->(p:Piatto)\n",
      "WHERE (p)-[:CONTIENE]->(:Ingrediente {nome: 'Funghi dell’Etere'}) OR (p)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: 'Marinatura Temporale Sincronizzata'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante)-[:OFFRE_IL_PIATTO]->(p:Piatto)-[:CONTIENE]->(i:Ingrediente)\n",
      "WHERE r.nome CONTAINS \"Klyntar\" AND (i.nome = \"Alghe Bioluminescenti\" OR i.nome = \"Amido di Stellarion\")\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante {nome: 'Asgard'})-[:OFFRE_IL_PIATTO]->(p:Piatto)-[:CONTIENE]->(i:Ingrediente)\n",
      "WHERE i.nome IN ['Essenza di Vuoto', 'Carne di Xenodonte']\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante {nome: 'Pandora'})-[:OFFRE_IL_PIATTO]->(p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica)\n",
      "WHERE t.nome IN ['Surgelamento Antimaterico a Risonanza Inversa', 'Cottura a Vapore con Flusso di Particelle Isoarmoniche']\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante {nome: 'Namecc'})-[:OFFRE_IL_PIATTO]->(p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica)\n",
      "WHERE t.nome IN ['Grigliatura Plasma Sintetico Risonante', 'Affumicatura Polarizzata a Freddo Iperbarico']\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante)-[:OFFRE_IL_PIATTO]->(p:Piatto)\n",
      "MATCH (r)-[:GESTITO_DA]->(c:Chef)\n",
      "WHERE c.licenzaP >= 5\n",
      "AND ((p)-[:CONTIENE]->(:Ingrediente {nome: \"Teste di Idra\"}) OR (p)-[:REALIZZATO_CON_LA_TECNICA]->(:Tecnica {nome: \"Bollitura Entropica Sincronizzata\"}))\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante)-[:GESTITO_DA]->(c:Chef), \n",
      "      (r)-[:OFFRE_IL_PIATTO]->(p:Piatto)-[:CONTIENE]->(i:Ingrediente), \n",
      "      (p)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica)\n",
      "WHERE c.nome CONTAINS \"LTK di grado 6\" AND \n",
      "      (i.nome = \"Polvere di Pulsar\" OR t.nome = \"Cottura al Forno con Paradosso Temporale Cronospeculare\")\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (c:Chef)-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica)\n",
      "WHERE c.licenza = 'Q' AND c.grado >= 9 AND (t.nome = 'Affumicatura Psionica Sensoriale' OR t.nome = 'Cottura Sottovuoto Multirealità Collassante')\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (c:Chef)-[:GESTITO_DA]-(r:Ristorante)-[:OFFRE_IL_PIATTO]->(p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica)\n",
      "WHERE (t.nome = 'Congelazione Iperdimensionalmente Stratificata' OR t.nome = 'Cristallizzazione Temporale Reversiva') \n",
      "AND c.licenzaMxGrado = 1\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(i:Ingrediente)\n",
      "WHERE i.nome IN ['Spore Quantiche', 'Latte+', 'Radici di Singolarità']\n",
      "WITH p, COUNT(i) AS ingredientCount\n",
      "WHERE ingredientCount >= 2\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(i:Ingrediente)\n",
      "WHERE i.nome IN ['Ravioli al Vaporeon', 'Spaghi del Sole', 'Nettare di Sirena']\n",
      "WITH p, COUNT(i) AS ingredientCount\n",
      "WHERE ingredientCount >= 2\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(i:Ingrediente)\n",
      "WHERE i.nome IN ['Polvere di Crononite', 'Nduja Fritta Tanto', 'Spezie di Melange', 'Polvere di Stelle']\n",
      "WITH p, COUNT(i) AS ingredientCount\n",
      "WHERE ingredientCount >= 2\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(i:Ingrediente)\n",
      "WHERE i.nome IN ['Carne di Drago', 'Chocobo Wings', 'Foglie di Mandragora', 'Burrobirra']\n",
      "WITH p, COUNT(i) AS ingredientCount\n",
      "WHERE ingredientCount >= 2\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:CONTIENE]->(i:Ingrediente {nome: 'Spaghi del Sole'}),\n",
      "      (p)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: 'Surgelamento del di Sirius Cosmo'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica), (p)-[:CONTIENE]->(i:Ingrediente)\n",
      "WHERE t.nome CONTAINS 'taglio' AND i.nome = 'Fusilli del Vento'\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante {nome: 'Asgard'})-[:OFFRE_IL_PIATTO]->(p:Piatto)-[:CONTIENE]->(i:Ingrediente {nome: 'Farina di Nettuno'})\n",
      "WHERE p.licenza_temporale > 0\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante {nome: \"Asgard\"})-[:OFFRE_IL_PIATTO]->(p:Piatto)-[:CONTIENE]->(i:Ingrediente {nome: \"Carne di Xenodonte\"}), \n",
      "      (p)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: \"Licenza LTK non base\"})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante)-[:OFFRE_IL_PIATTO]->(p:Piatto)-[:CONTIENE]->(i:Ingrediente {nome: 'Spore Quantiche'})\n",
      "WHERE r.nome CONTAINS 'Pandora' AND p.nome CONTAINS 'licenza P di grado 2'\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante {nome: 'Arrakis'})-[:OFFRE_IL_PIATTO]->(p:Piatto)-[:CONTIENE]->(i:Ingrediente {nome: 'Riso di Cassandra'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante)-[:OFFRE_IL_PIATTO]->(p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t1:Tecnica {nome: 'taglio'}),\n",
      "      (p)-[:REALIZZATO_CON_LA_TECNICA]->(t2:Tecnica {nome: 'surgelamento'}),\n",
      "      (r)-[:GESTITO_DA]->(c:Chef {nome: 'Sirius Cosmo'})\n",
      "WHERE NOT (p)-[:CONTIENE]->(:Ingrediente {nome: 'Polvere di Crononite'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t1:Tecnica {nome: 'Impasto'}),\n",
      "      (p)-[:REALIZZATO_CON_LA_TECNICA]->(t2:Tecnica {nome: 'Taglio'})\n",
      "WHERE NOT (p)-[:CONTIENE]->(:Ingrediente {nome: 'Shard di Prisma Stellare'})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica)\n",
      "WHERE t.nome CONTAINS \"taglio\" AND NOT (p)-[:CONTIENE]->(:Ingrediente {nome: \"Fusilli del Vento\"})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: \"surgelamento\"}),\n",
      "      (r:Ristorante)-[:OFFRE_IL_PIATTO]->(p),\n",
      "      (r)-[:GESTITO_DA]->(c:Chef {nome: \"Sirius Cosmo\"})\n",
      "WHERE NOT (p)-[:CONTIENE]->(:Ingrediente {nome: \"spezie Melange\"})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica {nome: \"taglio del di Sirius Cosmo\"})\n",
      "WHERE NOT (p)-[:CONTIENE]->(:Ingrediente {nome: \"Gnocchi del Crepuscolo\"})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica)\n",
      "WHERE t.nome CONTAINS \"taglio\" AND p.nome CONTAINS \"licenza G grado 2\"\n",
      "AND NOT (p)-[:CONTIENE]->(:Ingrediente {nome: \"Farina di Nettuno\"})\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante)-[:OFFRE_IL_PIATTO]->(p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica)\n",
      "WHERE t.nome CONTAINS \"licenza di grado 3\" AND r.nome CONTAINS \"entro 659 anni luce da Namecc\"\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante)-[:OFFRE_IL_PIATTO]->(p:Piatto)\n",
      "WHERE r.nome IN [\"Ristorante1\", \"Ristorante2\", \"Ristorante3\"] // Replace with actual restaurant names within 176 light-years from Arrakis\n",
      "AND p.nome IN [\"Piatto1\", \"Piatto2\", \"Piatto3\"] // Replace with actual dish names requiring Psionica license grade 4\n",
      "RETURN p.nome\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (r:Ristorante)-[:OFFRE_IL_PIATTO]->(p:Piatto)-[:REALIZZATO_CON_LA_TECNICA]->(t:Tecnica)\n",
      "WHERE t.nome CONTAINS \"surgelamento\" AND distance(r.location, point({x: 0, y: 0, z: 0})) <= 317\n",
      "RETURN p.nome\n",
      "\u001b[0m\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Failed to write data to connection ResolvedIPv4Address(('127.0.0.1', 7687)) (ResolvedIPv4Address(('127.0.0.1', 7687)))\n",
      "Failed to write data to connection IPv4Address(('localhost', 7687)) (ResolvedIPv4Address(('127.0.0.1', 7687)))\n"
     ]
    },
    {
     "ename": "CypherSyntaxError",
     "evalue": "{code: Neo.ClientError.Statement.SyntaxError} {message: 'distance' has been replaced by 'point.distance' (line 3, column 42 (offset: 142))\r\n\"WHERE t.nome CONTAINS \"surgelamento\" AND distance(r.location, point({x: 0, y: 0, z: 0})) <= 317\"\r\n                                          ^}",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mCypherSyntaxError\u001b[0m                         Traceback (most recent call last)",
      "Cell \u001b[1;32mIn[147], line 4\u001b[0m\n\u001b[0;32m      1\u001b[0m lista_risposte \u001b[38;5;241m=\u001b[39m {}\n\u001b[0;32m      3\u001b[0m \u001b[38;5;28;01mfor\u001b[39;00m indice, domanda \u001b[38;5;129;01min\u001b[39;00m \u001b[38;5;28menumerate\u001b[39m(lista_domande):\n\u001b[1;32m----> 4\u001b[0m     answer \u001b[38;5;241m=\u001b[39m \u001b[43mchain\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43minvoke\u001b[49m\u001b[43m(\u001b[49m\u001b[43mdomanda\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m      5\u001b[0m     lista_piatti \u001b[38;5;241m=\u001b[39m []\n\u001b[0;32m      6\u001b[0m     \u001b[38;5;28;01mfor\u001b[39;00m piatto \u001b[38;5;129;01min\u001b[39;00m answer[\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mresult\u001b[39m\u001b[38;5;124m\"\u001b[39m]:\n",
      "File \u001b[1;32mc:\\Users\\Manass4\\Downloads\\Workspace VSCode\\HackaPizza\\.venv\\lib\\site-packages\\langchain\\chains\\base.py:170\u001b[0m, in \u001b[0;36mChain.invoke\u001b[1;34m(self, input, config, **kwargs)\u001b[0m\n\u001b[0;32m    168\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m \u001b[38;5;167;01mBaseException\u001b[39;00m \u001b[38;5;28;01mas\u001b[39;00m e:\n\u001b[0;32m    169\u001b[0m     run_manager\u001b[38;5;241m.\u001b[39mon_chain_error(e)\n\u001b[1;32m--> 170\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m e\n\u001b[0;32m    171\u001b[0m run_manager\u001b[38;5;241m.\u001b[39mon_chain_end(outputs)\n\u001b[0;32m    173\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m include_run_info:\n",
      "File \u001b[1;32mc:\\Users\\Manass4\\Downloads\\Workspace VSCode\\HackaPizza\\.venv\\lib\\site-packages\\langchain\\chains\\base.py:160\u001b[0m, in \u001b[0;36mChain.invoke\u001b[1;34m(self, input, config, **kwargs)\u001b[0m\n\u001b[0;32m    157\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m    158\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_validate_inputs(inputs)\n\u001b[0;32m    159\u001b[0m     outputs \u001b[38;5;241m=\u001b[39m (\n\u001b[1;32m--> 160\u001b[0m         \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_call\u001b[49m\u001b[43m(\u001b[49m\u001b[43minputs\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mrun_manager\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mrun_manager\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    161\u001b[0m         \u001b[38;5;28;01mif\u001b[39;00m new_arg_supported\n\u001b[0;32m    162\u001b[0m         \u001b[38;5;28;01melse\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_call(inputs)\n\u001b[0;32m    163\u001b[0m     )\n\u001b[0;32m    165\u001b[0m     final_outputs: Dict[\u001b[38;5;28mstr\u001b[39m, Any] \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mprep_outputs(\n\u001b[0;32m    166\u001b[0m         inputs, outputs, return_only_outputs\n\u001b[0;32m    167\u001b[0m     )\n\u001b[0;32m    168\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m \u001b[38;5;167;01mBaseException\u001b[39;00m \u001b[38;5;28;01mas\u001b[39;00m e:\n",
      "File \u001b[1;32mc:\\Users\\Manass4\\Downloads\\Workspace VSCode\\HackaPizza\\.venv\\lib\\site-packages\\langchain_neo4j\\chains\\graph_qa\\cypher.py:400\u001b[0m, in \u001b[0;36mGraphCypherQAChain._call\u001b[1;34m(self, inputs, run_manager)\u001b[0m\n\u001b[0;32m    397\u001b[0m \u001b[38;5;66;03m# Retrieve and limit the number of results\u001b[39;00m\n\u001b[0;32m    398\u001b[0m \u001b[38;5;66;03m# Generated Cypher be null if query corrector identifies invalid schema\u001b[39;00m\n\u001b[0;32m    399\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m generated_cypher:\n\u001b[1;32m--> 400\u001b[0m     context \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mgraph\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mquery\u001b[49m\u001b[43m(\u001b[49m\u001b[43mgenerated_cypher\u001b[49m\u001b[43m)\u001b[49m[: \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mtop_k]\n\u001b[0;32m    401\u001b[0m \u001b[38;5;28;01melse\u001b[39;00m:\n\u001b[0;32m    402\u001b[0m     context \u001b[38;5;241m=\u001b[39m []\n",
      "File \u001b[1;32mc:\\Users\\Manass4\\Downloads\\Workspace VSCode\\HackaPizza\\.venv\\lib\\site-packages\\langchain_neo4j\\graphs\\neo4j_graph.py:447\u001b[0m, in \u001b[0;36mNeo4jGraph.query\u001b[1;34m(self, query, params)\u001b[0m\n\u001b[0;32m    444\u001b[0m \u001b[38;5;28;01mfrom\u001b[39;00m\u001b[38;5;250m \u001b[39m\u001b[38;5;21;01mneo4j\u001b[39;00m\u001b[38;5;21;01m.\u001b[39;00m\u001b[38;5;21;01mexceptions\u001b[39;00m\u001b[38;5;250m \u001b[39m\u001b[38;5;28;01mimport\u001b[39;00m Neo4jError\n\u001b[0;32m    446\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m--> 447\u001b[0m     data, _, _ \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_driver\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mexecute_query\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m    448\u001b[0m \u001b[43m        \u001b[49m\u001b[43mQuery\u001b[49m\u001b[43m(\u001b[49m\u001b[43mtext\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mquery\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mtimeout\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mtimeout\u001b[49m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    449\u001b[0m \u001b[43m        \u001b[49m\u001b[43mdatabase_\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_database\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    450\u001b[0m \u001b[43m        \u001b[49m\u001b[43mparameters_\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mparams\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    451\u001b[0m \u001b[43m    \u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    452\u001b[0m     json_data \u001b[38;5;241m=\u001b[39m [r\u001b[38;5;241m.\u001b[39mdata() \u001b[38;5;28;01mfor\u001b[39;00m r \u001b[38;5;129;01min\u001b[39;00m data]\n\u001b[0;32m    453\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39msanitize:\n",
      "File \u001b[1;32mc:\\Users\\Manass4\\Downloads\\Workspace VSCode\\HackaPizza\\.venv\\lib\\site-packages\\neo4j\\_sync\\driver.py:927\u001b[0m, in \u001b[0;36mDriver.execute_query\u001b[1;34m(self, query_, parameters_, routing_, database_, impersonated_user_, bookmark_manager_, auth_, result_transformer_, **kwargs)\u001b[0m\n\u001b[0;32m    924\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mValueError\u001b[39;00m(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mInvalid routing control value: \u001b[39m\u001b[38;5;132;01m%r\u001b[39;00m\u001b[38;5;124m\"\u001b[39m\n\u001b[0;32m    925\u001b[0m                      \u001b[38;5;241m%\u001b[39m routing_)\n\u001b[0;32m    926\u001b[0m \u001b[38;5;28;01mwith\u001b[39;00m session\u001b[38;5;241m.\u001b[39m_pipelined_begin:\n\u001b[1;32m--> 927\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[43msession\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_run_transaction\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m    928\u001b[0m \u001b[43m        \u001b[49m\u001b[43maccess_mode\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mTelemetryAPI\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mDRIVER\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    929\u001b[0m \u001b[43m        \u001b[49m\u001b[43mwork\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43m(\u001b[49m\u001b[43mquery_str\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mparameters\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mresult_transformer_\u001b[49m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43m{\u001b[49m\u001b[43m}\u001b[49m\n\u001b[0;32m    930\u001b[0m \u001b[43m    \u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32mc:\\Users\\Manass4\\Downloads\\Workspace VSCode\\HackaPizza\\.venv\\lib\\site-packages\\neo4j\\_sync\\work\\session.py:552\u001b[0m, in \u001b[0;36mSession._run_transaction\u001b[1;34m(self, access_mode, api, transaction_function, args, kwargs)\u001b[0m\n\u001b[0;32m    550\u001b[0m tx \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_transaction\n\u001b[0;32m    551\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m--> 552\u001b[0m     result \u001b[38;5;241m=\u001b[39m transaction_function(tx, \u001b[38;5;241m*\u001b[39margs, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs)\n\u001b[0;32m    553\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m asyncio\u001b[38;5;241m.\u001b[39mCancelledError:\n\u001b[0;32m    554\u001b[0m     \u001b[38;5;66;03m# if cancellation callback has not been called yet:\u001b[39;00m\n\u001b[0;32m    555\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_transaction \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m \u001b[38;5;28;01mNone\u001b[39;00m:\n",
      "File \u001b[1;32mc:\\Users\\Manass4\\Downloads\\Workspace VSCode\\HackaPizza\\.venv\\lib\\site-packages\\neo4j\\_work\\query.py:142\u001b[0m, in \u001b[0;36munit_of_work.<locals>.wrapper.<locals>.wrapped\u001b[1;34m(*args, **kwargs)\u001b[0m\n\u001b[0;32m    141\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m\u001b[38;5;250m \u001b[39m\u001b[38;5;21mwrapped\u001b[39m(\u001b[38;5;241m*\u001b[39margs, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs):\n\u001b[1;32m--> 142\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m f(\u001b[38;5;241m*\u001b[39margs, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs)\n",
      "File \u001b[1;32mc:\\Users\\Manass4\\Downloads\\Workspace VSCode\\HackaPizza\\.venv\\lib\\site-packages\\neo4j\\_sync\\driver.py:1252\u001b[0m, in \u001b[0;36m_work\u001b[1;34m(tx, query, parameters, transformer)\u001b[0m\n\u001b[0;32m   1246\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m\u001b[38;5;250m \u001b[39m\u001b[38;5;21m_work\u001b[39m(\n\u001b[0;32m   1247\u001b[0m     tx: ManagedTransaction,\n\u001b[0;32m   1248\u001b[0m     query: te\u001b[38;5;241m.\u001b[39mLiteralString,\n\u001b[0;32m   1249\u001b[0m     parameters: t\u001b[38;5;241m.\u001b[39mDict[\u001b[38;5;28mstr\u001b[39m, t\u001b[38;5;241m.\u001b[39mAny],\n\u001b[0;32m   1250\u001b[0m     transformer: t\u001b[38;5;241m.\u001b[39mCallable[[Result], t\u001b[38;5;241m.\u001b[39mUnion[_T]]\n\u001b[0;32m   1251\u001b[0m ) \u001b[38;5;241m-\u001b[39m\u001b[38;5;241m>\u001b[39m _T:\n\u001b[1;32m-> 1252\u001b[0m     res \u001b[38;5;241m=\u001b[39m \u001b[43mtx\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mrun\u001b[49m\u001b[43m(\u001b[49m\u001b[43mquery\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mparameters\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m   1253\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m transformer(res)\n",
      "File \u001b[1;32mc:\\Users\\Manass4\\Downloads\\Workspace VSCode\\HackaPizza\\.venv\\lib\\site-packages\\neo4j\\_sync\\work\\transaction.py:168\u001b[0m, in \u001b[0;36mTransactionBase.run\u001b[1;34m(self, query, parameters, **kwparameters)\u001b[0m\n\u001b[0;32m    165\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_results\u001b[38;5;241m.\u001b[39mappend(result)\n\u001b[0;32m    167\u001b[0m parameters \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mdict\u001b[39m(parameters \u001b[38;5;129;01mor\u001b[39;00m {}, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwparameters)\n\u001b[1;32m--> 168\u001b[0m \u001b[43mresult\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_tx_ready_run\u001b[49m\u001b[43m(\u001b[49m\u001b[43mquery\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mparameters\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    170\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m result\n",
      "File \u001b[1;32mc:\\Users\\Manass4\\Downloads\\Workspace VSCode\\HackaPizza\\.venv\\lib\\site-packages\\neo4j\\_sync\\work\\result.py:131\u001b[0m, in \u001b[0;36mResult._tx_ready_run\u001b[1;34m(self, query, parameters)\u001b[0m\n\u001b[0;32m    127\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m\u001b[38;5;250m \u001b[39m\u001b[38;5;21m_tx_ready_run\u001b[39m(\u001b[38;5;28mself\u001b[39m, query, parameters):\n\u001b[0;32m    128\u001b[0m     \u001b[38;5;66;03m# BEGIN+RUN does not carry any extra on the RUN message.\u001b[39;00m\n\u001b[0;32m    129\u001b[0m     \u001b[38;5;66;03m# BEGIN {extra}\u001b[39;00m\n\u001b[0;32m    130\u001b[0m     \u001b[38;5;66;03m# RUN \"query\" {parameters} {extra}\u001b[39;00m\n\u001b[1;32m--> 131\u001b[0m     \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_run\u001b[49m\u001b[43m(\u001b[49m\u001b[43mquery\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mparameters\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43;01mNone\u001b[39;49;00m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43;01mNone\u001b[39;49;00m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43;01mNone\u001b[39;49;00m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43;01mNone\u001b[39;49;00m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43;01mNone\u001b[39;49;00m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43;01mNone\u001b[39;49;00m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32mc:\\Users\\Manass4\\Downloads\\Workspace VSCode\\HackaPizza\\.venv\\lib\\site-packages\\neo4j\\_sync\\work\\result.py:181\u001b[0m, in \u001b[0;36mResult._run\u001b[1;34m(self, query, parameters, db, imp_user, access_mode, bookmarks, notifications_min_severity, notifications_disabled_categories)\u001b[0m\n\u001b[0;32m    179\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_pull()\n\u001b[0;32m    180\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_connection\u001b[38;5;241m.\u001b[39msend_all()\n\u001b[1;32m--> 181\u001b[0m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_attach\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32mc:\\Users\\Manass4\\Downloads\\Workspace VSCode\\HackaPizza\\.venv\\lib\\site-packages\\neo4j\\_sync\\work\\result.py:301\u001b[0m, in \u001b[0;36mResult._attach\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    299\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_exhausted \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mFalse\u001b[39;00m:\n\u001b[0;32m    300\u001b[0m     \u001b[38;5;28;01mwhile\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_attached \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mFalse\u001b[39;00m:\n\u001b[1;32m--> 301\u001b[0m         \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_connection\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mfetch_message\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32mc:\\Users\\Manass4\\Downloads\\Workspace VSCode\\HackaPizza\\.venv\\lib\\site-packages\\neo4j\\_sync\\io\\_common.py:178\u001b[0m, in \u001b[0;36mConnectionErrorHandler.__getattr__.<locals>.outer.<locals>.inner\u001b[1;34m(*args, **kwargs)\u001b[0m\n\u001b[0;32m    176\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m\u001b[38;5;250m \u001b[39m\u001b[38;5;21minner\u001b[39m(\u001b[38;5;241m*\u001b[39margs, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs):\n\u001b[0;32m    177\u001b[0m     \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m--> 178\u001b[0m         func(\u001b[38;5;241m*\u001b[39margs, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs)\n\u001b[0;32m    179\u001b[0m     \u001b[38;5;28;01mexcept\u001b[39;00m (Neo4jError, ServiceUnavailable, SessionExpired) \u001b[38;5;28;01mas\u001b[39;00m exc:\n\u001b[0;32m    180\u001b[0m         \u001b[38;5;28;01massert\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m asyncio\u001b[38;5;241m.\u001b[39miscoroutinefunction(\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m__on_error)\n",
      "File \u001b[1;32mc:\\Users\\Manass4\\Downloads\\Workspace VSCode\\HackaPizza\\.venv\\lib\\site-packages\\neo4j\\_sync\\io\\_bolt.py:850\u001b[0m, in \u001b[0;36mBolt.fetch_message\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    846\u001b[0m \u001b[38;5;66;03m# Receive exactly one message\u001b[39;00m\n\u001b[0;32m    847\u001b[0m tag, fields \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39minbox\u001b[38;5;241m.\u001b[39mpop(\n\u001b[0;32m    848\u001b[0m     hydration_hooks\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mresponses[\u001b[38;5;241m0\u001b[39m]\u001b[38;5;241m.\u001b[39mhydration_hooks\n\u001b[0;32m    849\u001b[0m )\n\u001b[1;32m--> 850\u001b[0m res \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_process_message\u001b[49m\u001b[43m(\u001b[49m\u001b[43mtag\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mfields\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    851\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39midle_since \u001b[38;5;241m=\u001b[39m monotonic()\n\u001b[0;32m    852\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m res\n",
      "File \u001b[1;32mc:\\Users\\Manass4\\Downloads\\Workspace VSCode\\HackaPizza\\.venv\\lib\\site-packages\\neo4j\\_sync\\io\\_bolt5.py:369\u001b[0m, in \u001b[0;36mBolt5x0._process_message\u001b[1;34m(self, tag, fields)\u001b[0m\n\u001b[0;32m    367\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_server_state_manager\u001b[38;5;241m.\u001b[39mstate \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mbolt_states\u001b[38;5;241m.\u001b[39mFAILED\n\u001b[0;32m    368\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m--> 369\u001b[0m     \u001b[43mresponse\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mon_failure\u001b[49m\u001b[43m(\u001b[49m\u001b[43msummary_metadata\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;129;43;01mor\u001b[39;49;00m\u001b[43m \u001b[49m\u001b[43m{\u001b[49m\u001b[43m}\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    370\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m (ServiceUnavailable, DatabaseUnavailable):\n\u001b[0;32m    371\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mpool:\n",
      "File \u001b[1;32mc:\\Users\\Manass4\\Downloads\\Workspace VSCode\\HackaPizza\\.venv\\lib\\site-packages\\neo4j\\_sync\\io\\_common.py:245\u001b[0m, in \u001b[0;36mResponse.on_failure\u001b[1;34m(self, metadata)\u001b[0m\n\u001b[0;32m    243\u001b[0m handler \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mhandlers\u001b[38;5;241m.\u001b[39mget(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mon_summary\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[0;32m    244\u001b[0m Util\u001b[38;5;241m.\u001b[39mcallback(handler)\n\u001b[1;32m--> 245\u001b[0m \u001b[38;5;28;01mraise\u001b[39;00m Neo4jError\u001b[38;5;241m.\u001b[39mhydrate(\u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mmetadata)\n",
      "\u001b[1;31mCypherSyntaxError\u001b[0m: {code: Neo.ClientError.Statement.SyntaxError} {message: 'distance' has been replaced by 'point.distance' (line 3, column 42 (offset: 142))\r\n\"WHERE t.nome CONTAINS \"surgelamento\" AND distance(r.location, point({x: 0, y: 0, z: 0})) <= 317\"\r\n                                          ^}"
     ]
    }
   ],
   "source": [
    "lista_risposte = {}\n",
    "\n",
    "for indice, domanda in enumerate(lista_domande):\n",
    "    answer = chain.invoke(domanda)\n",
    "    lista_piatti = []\n",
    "    for piatto in answer[\"result\"]:\n",
    "        lista_piatti.append(piatto[\"p.nome\"])\n",
    "    lista_risposte[indice+1] = lista_piatti\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 148,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{1: ['Galassia di Sapori: Il Viaggio Senza Tempo'],\n",
       " 2: ['Sinfonia Cosmica: Versione Pizza'],\n",
       " 3: [\"Pizza Cosmica all'Essenza di Drago con Nebbia Arcobaleno e Funghi Orbitali\"],\n",
       " 4: ['Sinfonia Cosmica di Sapore'],\n",
       " 5: [],\n",
       " 6: ['Rinascita Cosmica'],\n",
       " 7: ['Portale del Cosmo: Sinfonia di Sapori Multidimensionali',\n",
       "  'Stella Nova',\n",
       "  'Rivisitazione del Kraken sotto Molecole'],\n",
       " 8: ['Cosmic Synchrony: Il Destino di Pulsar',\n",
       "  'Nebulosa Galattica',\n",
       "  'Cosmic Serenade',\n",
       "  'Aurora del Cosmo',\n",
       "  'Sinfonia Cosmica di Andromeda',\n",
       "  'Fusione Celeste'],\n",
       " 9: ['Galassia di Sapori Sublimi', 'Sinfonia Cosmica del Multiverso'],\n",
       " 10: [\"La Mucca Che Stordisce l'Universo\", 'Sogni di Abisso Cosmico'],\n",
       " 11: ['Il Viaggio delle Dimensioni Confluenti'],\n",
       " 12: ['Sinfonia Quantistica delle Stelle', 'Risveglio Cosmico'],\n",
       " 13: ['Nebulare Asteroideo con Crepuscolo di Mucca'],\n",
       " 14: ['Galassia di Sogni Cosmogastronomici', 'Il Viaggio Celeste'],\n",
       " 15: ['Tris di Carne con Pane',\n",
       "  'Panetto di Carne',\n",
       "  'Pizza Gio',\n",
       "  'Eclissi Quantica: Viaggio nei Reami del Gusto',\n",
       "  'Cosmic Harmony Infusion',\n",
       "  'Nebulare Asteroideo con Crepuscolo di Mucca',\n",
       "  'Viaggio Cosmico nel Multiverso',\n",
       "  'Serenata del Multiverso'],\n",
       " 16: ['Panetto di Carne',\n",
       "  'Pizza Gio',\n",
       "  'Eclissi Quantica: Viaggio nei Reami del Gusto',\n",
       "  'Cosmic Harmony Infusion',\n",
       "  'Nebulare Asteroideo con Crepuscolo di Mucca',\n",
       "  'Viaggio Cosmico nel Multiverso',\n",
       "  'Sinfonia Cosmica di Terracotta',\n",
       "  'Serenata del Multiverso'],\n",
       " 17: ['La Balena Sputafuoco',\n",
       "  'Sinfonia di Gusti del Multiverso',\n",
       "  'Universo in Un Boccone',\n",
       "  'Pizza Cri',\n",
       "  'Portale Interdimensionale di Sapori',\n",
       "  'Cosmo Sferico di Sogni Rigenerativi',\n",
       "  'Sinfonia Cosmica di Sapore'],\n",
       " 18: ['Nebulosa Celestiale di Sogni Quantici',\n",
       "  'Ecosistema Celeste',\n",
       "  'Euforia Cosmica',\n",
       "  'Galaxia Rinasciata'],\n",
       " 19: [],\n",
       " 20: [\"Il Viaggio dell'Etereo Risveglio\", 'Galassia Commovente di Stellari'],\n",
       " 21: ['Portale Cosmico del Kraken', 'Sinfonia Tempolare Galattica'],\n",
       " 22: ['Galassia di Sapori Eterei'],\n",
       " 23: ['Piccola Odissea Cosmica'],\n",
       " 24: ['Luce e Ombra di Nomea Spaziale'],\n",
       " 25: [],\n",
       " 26: [\"Sinfonia Cosmica all'Alba di Fenice\"],\n",
       " 27: ['Il Banchetto delle Galassie',\n",
       "  'Cosmofantasia di Terra e Mare nel Vortice delle Stelle',\n",
       "  \"La Mucca Che Stordisce l'Universo\",\n",
       "  'Cosmos Culinary Symphony',\n",
       "  'Sinfonia Temporale al Tocco di Crono',\n",
       "  'Risveglio Cosmico: Una Sinfonia di Sapori Universali'],\n",
       " 28: ['Cosmofantasia di Terra e Mare nel Vortice delle Stelle',\n",
       "  \"Sinfonia Cosmica all'Alba di Fenice\",\n",
       "  'Odissea Temporale',\n",
       "  'Il Risveglio del Drago Celeste',\n",
       "  'Sinfonia Temporale al Tocco di Crono',\n",
       "  'Galassia Suprema'],\n",
       " 29: ['Sinfonia Galattica di Sapori con Sorpresa di Drago Fiammante'],\n",
       " 30: [\"Sinfonia Cosmica all'Alba di Fenice\",\n",
       "  'Sassi e Sassolini',\n",
       "  'La Balena Sputafuoco',\n",
       "  \"L'Eternità al Crepuscolo\",\n",
       "  'Rintocchi del Cosmo',\n",
       "  'Galassia di Sapori di Aurora'],\n",
       " 31: ['Porta Celestiale alle Stelle', 'Sinfonia Cosmica ma Fatta Male'],\n",
       " 32: ['Sinfonia Cosmica alla Szechuan',\n",
       "  'Nebulosa Celestiale di Sogni Quantici',\n",
       "  'Nebulae Di-Cedri Risvegliati'],\n",
       " 33: [],\n",
       " 34: ['Universo Cosmico nel Piatto'],\n",
       " 35: ['Melodia del Multiverso Parallelo', 'Sinfonia Cosmica di Terracotta'],\n",
       " 36: ['Galassia di Sapore Quantum',\n",
       "  'Universo in Un Boccone',\n",
       "  'Sinfonia Temporale nello Spaghi del Sole'],\n",
       " 37: ['Nebulose della Fenice su Vento Lunare'],\n",
       " 38: ['Rivelazione del Multiverso'],\n",
       " 39: ['Sinfonia Temporale nello Spaghi del Sole',\n",
       "  'Etereo Crepuscolare',\n",
       "  'Il Risveglio delle Stelle',\n",
       "  'Galassie Infiammate: Sinfonia Cosmica in Sei Dimensioni',\n",
       "  'Astro-Risotto alle Onde Temporali'],\n",
       " 40: ['Fenice Galattica',\n",
       "  'Eterea Sinfonia di Gravità',\n",
       "  'Pizza Baby Daniele',\n",
       "  'Pizza Cri',\n",
       "  'Pizza Emma',\n",
       "  'Sinfonia Astrale - Risotto Multiversale con Risacca Celeste',\n",
       "  \"Fenice sull'Orizzonte degli Eventi\",\n",
       "  'Sinfonia Interstellare di Fusilli del Vento con Nettare di Sirena',\n",
       "  'Nebulose della Fenice su Vento Lunare'],\n",
       " 41: ['Serenata del Multiverso',\n",
       "  'Risveglio Cosmico: Una Sinfonia di Sapori Universali'],\n",
       " 42: [\"Falso Risotto dell'Infinito Multiverso\", 'Rinascita Cosmica'],\n",
       " 43: ['Sinfonia Cosmica del Multiverso',\n",
       "  'Ecosistema Celeste',\n",
       "  'Universo in Fusilli - Variazione Celestiale',\n",
       "  'Mycoflora con Polvere di Stelle Sbagliato',\n",
       "  'Sinfonia di Stagioni Stellari',\n",
       "  'Galassia Risvegliata'],\n",
       " 44: ['Panetto di Carne',\n",
       "  'Galassia Speculare',\n",
       "  'Ode al Crepuscolo del Multiverso',\n",
       "  'Viaggio Cosmico nel Multiverso',\n",
       "  'Portale Cosmico: Sinfonia di Gnocchi del Crepuscolo con Essenza di Tachioni e Sfumature di Fenice'],\n",
       " 45: [\"Galassie in Epifania: Risotto Celestiale con Preziosi dell'Universo\"],\n",
       " 46: ['Viaggio dei Sensi: Bolla Temporale di Aromi Ancestrali'],\n",
       " 47: [],\n",
       " 48: ['Portale Cosmico: Sinfonia di Gnocchi del Crepuscolo con Essenza di Tachioni e Sfumature di Fenice'],\n",
       " 49: [],\n",
       " 50: [],\n",
       " 51: [],\n",
       " 52: [],\n",
       " 53: [\"Sinfonia dell'Universo Morente\"],\n",
       " 54: ['Nebulosa di Confini Sfondati', 'Galassia Ardente'],\n",
       " 55: ['Stellar Fusion'],\n",
       " 56: ['Universo Cosmico nel Piatto', 'La Creazione di Nova'],\n",
       " 57: [],\n",
       " 58: [],\n",
       " 59: [],\n",
       " 60: [],\n",
       " 61: ['Tris di Verdure con Xenodonte',\n",
       "  'Galassia di Sapori: Il Viaggio Senza Tempo',\n",
       "  'Il Rapsodo Celestiale'],\n",
       " 62: ['Galassia di Sapori di Aurora', 'Evanescenza Cosmica'],\n",
       " 63: ['Portale delle Stelle'],\n",
       " 64: [\"Sinfonia Celeste dell'Equilibrio Temporale\",\n",
       "  'Porta Celestiale alle Stelle'],\n",
       " 65: [],\n",
       " 66: [],\n",
       " 67: [],\n",
       " 68: [],\n",
       " 69: [],\n",
       " 70: [],\n",
       " 71: [],\n",
       " 72: [],\n",
       " 73: ['Galassia di Sapori Interstellari',\n",
       "  'Il Risveglio del Drago Celeste',\n",
       "  'Una Mucca e una Balena nella Singolarità',\n",
       "  'Crescendo Cosmico',\n",
       "  'Fusione Celeste'],\n",
       " 74: ['Galassia Sensoriale',\n",
       "  'Ode Cosmica di Terra e Stelle',\n",
       "  'Galassia di Sogni Cosmogastronomici',\n",
       "  \"La Sinfonia dell'Universo\",\n",
       "  'Universo Incantato: Sinfonia dei Gusti Cosmogonici',\n",
       "  \"Nebulosa dell'Infinito: Un Viaggio attraverso il Cosmo del Gusto\",\n",
       "  'Sinfonia Cosmica'],\n",
       " 75: ['Galassia di Sapore Quantico',\n",
       "  'Ethereal Temporal Elixir',\n",
       "  'Pizza Baby Simone e Alessandro',\n",
       "  'Melodia del Multiverso Parallelo',\n",
       "  'Mandragora e Radici'],\n",
       " 76: ['Odissea Temporale', 'Galassia di Sapori: Il Viaggio Senza Tempo'],\n",
       " 77: [],\n",
       " 78: [],\n",
       " 79: [],\n",
       " 80: [],\n",
       " 81: [],\n",
       " 82: [],\n",
       " 83: [],\n",
       " 84: [],\n",
       " 85: [],\n",
       " 86: [],\n",
       " 87: [],\n",
       " 88: [],\n",
       " 89: [],\n",
       " 90: []}"
      ]
     },
     "execution_count": 148,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "lista_risposte"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 151,
   "metadata": {},
   "outputs": [],
   "source": [
    "with open('submission.txt', 'w') as convert_file: \n",
    "     convert_file.write(json.dumps(lista_risposte))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 156,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{1: [78], 2: [225], 3: [156], 4: [215], 5: [], 6: [179], 7: [171, 267, 189], 8: [15, 130, 13, 6, 209, 51], 9: [76, 207], 10: [115, 266], 11: [104], 12: [240, 185], 13: [125], 14: [81, 101], 15: [269, 147, 160, 35, 10, 125, 281, 191], 16: [147, 160, 35, 10, 125, 281, 217, 191], 17: [112, 263, 276, 157, 170, 16, 215], 18: [128, 37, 45, 91], 19: [], 20: [103, 54], 21: [168, 241], 22: [74], 23: [149], 24: [118], 25: [], 26: [205], 27: [92, 17, 115, 21, 243, 187], 28: [17, 205, 145, 96, 243, 62], 29: [234], 30: [205, 190, 112, 110, 180, 77], 31: [166, 221], 32: [206, 128, 124], 33: [], 34: [272], 35: [121, 217], 36: [72, 276, 247], 37: [140], 38: [188], 39: [247, 42, 99, 85, 5], 40: [49, 153, 157, 158, 197, 50, 235, 140], 41: [191, 187], 42: [48, 179], 43: [207, 37, 275, 123, 265, 59], 44: [147, 61, 142, 281, 169], 45: [89], 46: [286], 47: [], 48: [169], 49: [], 50: [], 51: [], 52: [], 53: [258], 54: [132, 52], 55: [268], 56: [272, 114], 57: [], 58: [], 59: [], 60: [], 61: [270, 78, 94], 62: [77, 46], 63: [174], 64: [198, 166], 65: [], 66: [], 67: [], 68: [], 69: [], 70: [], 71: [], 72: [], 73: [75, 96, 271, 26, 51], 74: [60, 141, 81, 116, 273, 131, 204], 75: [71, 44, 155, 121], 76: [145, 78], 77: [], 78: [], 79: [], 80: [], 81: [], 82: [], 83: [], 84: [], 85: [], 86: [], 87: [], 88: [], 89: [], 90: []}\n"
     ]
    }
   ],
   "source": [
    "import json\n",
    "\n",
    "def load_mapping(mapping_file):\n",
    "    with open(mapping_file, 'r', encoding='utf-8') as file:\n",
    "        mapping = json.load(file)\n",
    "    return mapping\n",
    "\n",
    "def map_dishes(dishes_dict, mapping):\n",
    "    mapped_dict = {}\n",
    "    for key, dishes in dishes_dict.items():\n",
    "        mapped_dishes = [mapping[dish] for dish in dishes if dish in mapping]\n",
    "        mapped_dict[key] = mapped_dishes\n",
    "    return mapped_dict\n",
    "\n",
    "# Esempio di utilizzo\n",
    "\n",
    "mapping_file = 'dish_mapping.json'\n",
    "mapping = load_mapping(mapping_file)\n",
    "mapped_dishes_dict = map_dishes(lista_risposte, mapping)\n",
    "\n",
    "print(mapped_dishes_dict)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 162,
   "metadata": {},
   "outputs": [],
   "source": [
    "import csv\n",
    "\n",
    "def dict_to_csv(data_dict, csv_filename):\n",
    "    with open(csv_filename, mode='w', newline='', encoding='utf-8') as file:\n",
    "        writer = csv.writer(file)\n",
    "        writer.writerow(['row_id', 'result'])  # Scrivi l'intestazione\n",
    "\n",
    "        for key, values in data_dict.items():\n",
    "            result = \",\".join(map(str, values))  # Converte la lista in stringa separata da virgole\n",
    "            writer.writerow([key, f'{result}'])  # Aggiungi manualmente le virgolette attorno alla stringa result\n",
    "            \n",
    "\n",
    "\n",
    "csv_filename = 'outputDaSottomettere.csv'\n",
    "dict_to_csv(mapped_dishes_dict, csv_filename)\n"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
